TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_TBCTL                    (0x00000000U)
#define PWM_EPWM_TBCTL2                   (0x00000002U)
#define PWM_EPWM_RESERVED_1               (0x00000004U)
#define PWM_EPWM_EPWMSYNCINSEL            (0x00000006U)
#define PWM_EPWM_TBCTR                    (0x00000008U)
#define PWM_EPWM_TBSTS                    (0x0000000AU)
#define PWM_EPWM_EPWMSYNCOUTEN            (0x0000000CU)
#define PWM_EPWM_TBCTL3                   (0x0000000EU)
#define PWM_EPWM_CMPCTL                   (0x00000010U)
#define PWM_EPWM_CMPCTL2                  (0x00000012U)
#define PWM_EPWM_RESERVED_2(RESERVED_2)   (0x00000014U + ((RESERVED_2) * 0x2U))
#define PWM_EPWM_DBCTL                    (0x00000018U)
#define PWM_EPWM_DBCTL2                   (0x0000001AU)
#define PWM_EPWM_RESERVED_3(RESERVED_3)   (0x0000001CU + ((RESERVED_3) * 0x2U))
#define PWM_EPWM_AQCTL                    (0x00000020U)
#define PWM_EPWM_AQTSRCSEL                (0x00000022U)
#define PWM_EPWM_RESERVED_4(RESERVED_4)   (0x00000024U + ((RESERVED_4) * 0x2U))
#define PWM_EPWM_PCCTL                    (0x00000028U)
#define PWM_EPWM_RESERVED_5(RESERVED_5)   (0x0000002AU + ((RESERVED_5) * 0x2U))
#define PWM_EPWM_VCAPCTL                  (0x00000030U)
#define PWM_EPWM_VCNTCFG                  (0x00000032U)
#define PWM_EPWM_RESERVED_6(RESERVED_6)   (0x00000034U + ((RESERVED_6) * 0x2U))
#define PWM_EPWM_HRCNFG                   (0x00000040U)
#define PWM_EPWM_RESERVED_7               (0x00000042U)
#define PWM_EPWM_RESERVED_8               (0x00000044U)
#define PWM_EPWM_RESERVED_9               (0x00000046U)
#define PWM_EPWM_RESERVED_10              (0x00000048U)
#define PWM_EPWM_RESERVED_11              (0x0000004AU)
#define PWM_EPWM_RESERVED_12              (0x0000004CU)
#define PWM_EPWM_HRCNFG2                  (0x0000004EU)
#define PWM_EPWM_RESERVED_13(RESERVED_13) (0x00000050U + ((RESERVED_13) * 0x2U))
#define PWM_EPWM_HRPCTL                   (0x0000005AU)
#define PWM_EPWM_TRREM                    (0x0000005CU)
#define PWM_EPWM_RESERVED_14(RESERVED_14) (0x0000005EU + ((RESERVED_14) * 0x2U))
#define PWM_EPWM_GLDCTL                   (0x00000068U)
#define PWM_EPWM_GLDCFG                   (0x0000006AU)
#define PWM_EPWM_RESERVED_15(RESERVED_15) (0x0000006CU + ((RESERVED_15) * 0x2U))
#define PWM_EPWM_EPWMXLINK                (0x00000070U)
#define PWM_EPWM_EPWMXLINK2               (0x00000074U)
#define PWM_EPWM_RESERVED_16              (0x00000078U)
#define PWM_EPWM_ETEST                    (0x0000007AU)
#define PWM_EPWM_EPWMREV                  (0x0000007CU)
#define PWM_EPWM_HRPWMREV                 (0x0000007EU)
#define PWM_EPWM_AQCTLA                   (0x00000080U)
#define PWM_EPWM_AQCTLA2                  (0x00000082U)
#define PWM_EPWM_AQCTLB                   (0x00000084U)
#define PWM_EPWM_AQCTLB2                  (0x00000086U)
#define PWM_EPWM_RESERVED_17(RESERVED_17) (0x00000088U + ((RESERVED_17) * 0x2U))
#define PWM_EPWM_AQSFRC                   (0x0000008EU)
#define PWM_EPWM_RESERVED_18              (0x00000090U)
#define PWM_EPWM_AQCSFRC                  (0x00000092U)
#define PWM_EPWM_RESERVED_19(RESERVED_19) (0x00000094U + ((RESERVED_19) * 0x2U))
#define PWM_EPWM_DBREDHR                  (0x000000A0U)
#define PWM_EPWM_DBRED                    (0x000000A2U)
#define PWM_EPWM_DBFEDHR                  (0x000000A4U)
#define PWM_EPWM_DBFED                    (0x000000A6U)
#define PWM_EPWM_RESERVED_20(RESERVED_20) (0x000000A8U + ((RESERVED_20) * 0x2U))
#define PWM_EPWM_TBPHS                    (0x000000C0U)
#define PWM_EPWM_TBPRDHR                  (0x000000C4U)
#define PWM_EPWM_TBPRD                    (0x000000C6U)
#define PWM_EPWM_TBPRDHRB                 (0x000000C8U)
#define PWM_EPWM_RESERVED_21(RESERVED_21) (0x000000CAU + ((RESERVED_21) * 0x2U))
#define PWM_EPWM_CMPA                     (0x000000D4U)
#define PWM_EPWM_CMPB                     (0x000000D8U)
#define PWM_EPWM_RESERVED_22              (0x000000DCU)
#define PWM_EPWM_CMPC                     (0x000000DEU)
#define PWM_EPWM_RESERVED_23              (0x000000E0U)
#define PWM_EPWM_CMPD                     (0x000000E2U)
#define PWM_EPWM_RESERVED_24(RESERVED_24) (0x000000E4U + ((RESERVED_24) * 0x2U))
#define PWM_EPWM_GLDCTL2                  (0x000000E8U)
#define PWM_EPWM_RESERVED_25(RESERVED_25) (0x000000EAU + ((RESERVED_25) * 0x2U))
#define PWM_EPWM_SWVDELVAL                (0x000000EEU)
#define PWM_EPWM_RESERVED_26(RESERVED_26) (0x000000F0U + ((RESERVED_26) * 0x2U))
#define PWM_EPWM_TZSEL                    (0x00000100U)
#define PWM_EPWM_TZSEL2                   (0x00000102U)
#define PWM_EPWM_TZDCSEL                  (0x00000104U)
#define PWM_EPWM_RESERVED_27              (0x00000106U)
#define PWM_EPWM_TZCTL                    (0x00000108U)
#define PWM_EPWM_TZCTL2                   (0x0000010AU)
#define PWM_EPWM_TZCTLDCA                 (0x0000010CU)
#define PWM_EPWM_TZCTLDCB                 (0x0000010EU)
#define PWM_EPWM_RESERVED_28(RESERVED_28) (0x00000110U + ((RESERVED_28) * 0x2U))
#define PWM_EPWM_TZEINT                   (0x0000011AU)
#define PWM_EPWM_RESERVED_29(RESERVED_29) (0x0000011CU + ((RESERVED_29) * 0x2U))
#define PWM_EPWM_TZFLG                    (0x00000126U)
#define PWM_EPWM_TZCBCFLG                 (0x00000128U)
#define PWM_EPWM_TZOSTFLG                 (0x0000012AU)
#define PWM_EPWM_RESERVED_30              (0x0000012CU)
#define PWM_EPWM_TZCLR                    (0x0000012EU)
#define PWM_EPWM_TZCBCCLR                 (0x00000130U)
#define PWM_EPWM_TZOSTCLR                 (0x00000132U)
#define PWM_EPWM_RESERVED_31              (0x00000134U)
#define PWM_EPWM_TZFRC                    (0x00000136U)
#define PWM_EPWM_RESERVED_32              (0x00000138U)
#define PWM_EPWM_TZTRIPOUTSEL             (0x0000013AU)
#define PWM_EPWM_RESERVED_33(RESERVED_33) (0x0000013CU + ((RESERVED_33) * 0x2U))
#define PWM_EPWM_ETSEL                    (0x00000148U)
#define PWM_EPWM_RESERVED_34              (0x0000014AU)
#define PWM_EPWM_ETPS                     (0x0000014CU)
#define PWM_EPWM_RESERVED_35              (0x0000014EU)
#define PWM_EPWM_ETFLG                    (0x00000150U)
#define PWM_EPWM_RESERVED_36              (0x00000152U)
#define PWM_EPWM_ETCLR                    (0x00000154U)
#define PWM_EPWM_RESERVED_37              (0x00000156U)
#define PWM_EPWM_ETFRC                    (0x00000158U)
#define PWM_EPWM_RESERVED_38              (0x0000015AU)
#define PWM_EPWM_ETINTPS                  (0x0000015CU)
#define PWM_EPWM_RESERVED_39              (0x0000015EU)
#define PWM_EPWM_ETSOCPS                  (0x00000160U)
#define PWM_EPWM_RESERVED_40              (0x00000162U)
#define PWM_EPWM_ETCNTINITCTL             (0x00000164U)
#define PWM_EPWM_RESERVED_41              (0x00000166U)
#define PWM_EPWM_ETCNTINIT                (0x00000168U)
#define PWM_EPWM_RESERVED_42              (0x0000016AU)
#define PWM_EPWM_ETINTMIXEN               (0x0000016CU)
#define PWM_EPWM_RESERVED_43              (0x0000016EU)
#define PWM_EPWM_ETSOCAMIXEN              (0x00000170U)
#define PWM_EPWM_RESERVED_44              (0x00000172U)
#define PWM_EPWM_ETSOCBMIXEN              (0x00000174U)
#define PWM_EPWM_RESERVED_45(RESERVED_45) (0x00000176U + ((RESERVED_45) * 0x2U))
#define PWM_EPWM_DCTRIPSEL                (0x00000180U)
#define PWM_EPWM_RESERVED_46(RESERVED_46) (0x00000182U + ((RESERVED_46) * 0x2U))
#define PWM_EPWM_DCACTL                   (0x00000186U)
#define PWM_EPWM_DCBCTL                   (0x00000188U)
#define PWM_EPWM_RESERVED_47(RESERVED_47) (0x0000018AU + ((RESERVED_47) * 0x2U))
#define PWM_EPWM_DCFCTL                   (0x0000018EU)
#define PWM_EPWM_DCCAPCTL                 (0x00000190U)
#define PWM_EPWM_DCFOFFSET                (0x00000192U)
#define PWM_EPWM_DCFOFFSETCNT             (0x00000194U)
#define PWM_EPWM_DCFWINDOW                (0x00000196U)
#define PWM_EPWM_DCFWINDOWCNT             (0x00000198U)
#define PWM_EPWM_BLANKPULSEMIXSEL         (0x0000019AU)
#define PWM_EPWM_DCCAPMIXSEL              (0x0000019CU)
#define PWM_EPWM_DCCAP                    (0x0000019EU)
#define PWM_EPWM_RESERVED_48(RESERVED_48) (0x000001A0U + ((RESERVED_48) * 0x2U))
#define PWM_EPWM_DCAHTRIPSEL              (0x000001A4U)
#define PWM_EPWM_DCALTRIPSEL              (0x000001A6U)
#define PWM_EPWM_DCBHTRIPSEL              (0x000001A8U)
#define PWM_EPWM_DCBLTRIPSEL              (0x000001AAU)
#define PWM_EPWM_CAPCTL                   (0x000001ACU)
#define PWM_EPWM_CAPGATETRIPSEL           (0x000001AEU)
#define PWM_EPWM_CAPINTRIPSEL             (0x000001B0U)
#define PWM_EPWM_CAPTRIPSEL               (0x000001B2U)
#define PWM_EPWM_RESERVED_49(RESERVED_49) (0x000001B4U + ((RESERVED_49) * 0x2U))
#define PWM_EPWM_SPARE1                   (0x000001ECU)
#define PWM_EPWM_RESERVED_50              (0x000001EEU)
#define PWM_EPWM_SPARE2                   (0x000001F0U)
#define PWM_EPWM_RESERVED_51              (0x000001F2U)
#define PWM_EPWM_EPWMLOCK                 (0x000001F4U)
#define PWM_EPWM_RESERVED_52              (0x000001F8U)
#define PWM_EPWM_HWVDELVAL                (0x000001FAU)
#define PWM_EPWM_VCNTVAL                  (0x000001FCU)
#define PWM_EPWM_RESERVED_53              (0x000001FEU)
#define PWM_EPWM_XCMPCTL1                 (0x00000400U)
#define PWM_EPWM_RESERVED_54(RESERVED_54) (0x00000404U + ((RESERVED_54) * 0x4U))
#define PWM_EPWM_XLOADCTL                 (0x00000410U)
#define PWM_EPWM_RESERVED_55              (0x00000414U)
#define PWM_EPWM_XLOAD                    (0x00000418U)
#define PWM_EPWM_EPWMXLINKXLOAD           (0x0000041CU)
#define PWM_EPWM_XREGSHDW1STS             (0x00000420U)
#define PWM_EPWM_RESERVED_56              (0x00000424U)
#define PWM_EPWM_XREGSHDW2STS             (0x00000428U)
#define PWM_EPWM_RESERVED_57              (0x0000042CU)
#define PWM_EPWM_XREGSHDW3STS             (0x00000430U)
#define PWM_EPWM_RESERVED_58(RESERVED_58) (0x00000434U + ((RESERVED_58) * 0x4U))
#define PWM_EPWM_XCMP1_ACTIVE             (0x00000600U)
#define PWM_EPWM_XCMP2_ACTIVE             (0x00000604U)
#define PWM_EPWM_XCMP3_ACTIVE             (0x00000608U)
#define PWM_EPWM_XCMP4_ACTIVE             (0x0000060CU)
#define PWM_EPWM_XCMP5_ACTIVE             (0x00000610U)
#define PWM_EPWM_XCMP6_ACTIVE             (0x00000614U)
#define PWM_EPWM_XCMP7_ACTIVE             (0x00000618U)
#define PWM_EPWM_XCMP8_ACTIVE             (0x0000061CU)
#define PWM_EPWM_XTBPRD_ACTIVE            (0x00000620U)
#define PWM_EPWM_RESERVED_59(RESERVED_59) (0x00000624U + ((RESERVED_59) * 0x4U))
#define PWM_EPWM_XAQCTLA_ACTIVE           (0x00000630U)
#define PWM_EPWM_XAQCTLB_ACTIVE           (0x00000632U)
#define PWM_EPWM_RESERVED_60(RESERVED_60) (0x00000634U + ((RESERVED_60) * 0x4U))
#define PWM_EPWM_XMINMAX_ACTIVE           (0x00000644U)
#define PWM_EPWM_RESERVED_61(RESERVED_61) (0x00000648U + ((RESERVED_61) * 0x4U))
#define PWM_EPWM_XCMP1_SHDW1              (0x00000680U)
#define PWM_EPWM_XCMP2_SHDW1              (0x00000684U)
#define PWM_EPWM_XCMP3_SHDW1              (0x00000688U)
#define PWM_EPWM_XCMP4_SHDW1              (0x0000068CU)
#define PWM_EPWM_XCMP5_SHDW1              (0x00000690U)
#define PWM_EPWM_XCMP6_SHDW1              (0x00000694U)
#define PWM_EPWM_XCMP7_SHDW1              (0x00000698U)
#define PWM_EPWM_XCMP8_SHDW1              (0x0000069CU)
#define PWM_EPWM_XTBPRD_SHDW1             (0x000006A0U)
#define PWM_EPWM_RESERVED_62(RESERVED_62) (0x000006A4U + ((RESERVED_62) * 0x4U))
#define PWM_EPWM_XAQCTLA_SHDW1            (0x000006B0U)
#define PWM_EPWM_XAQCTLB_SHDW1            (0x000006B2U)
#define PWM_EPWM_RESERVED_63(RESERVED_63) (0x000006B4U + ((RESERVED_63) * 0x2U))
#define PWM_EPWM_CMPC_SHDW1               (0x000006BAU)
#define PWM_EPWM_RESERVED_64              (0x000006BCU)
#define PWM_EPWM_CMPD_SHDW1               (0x000006BEU)
#define PWM_EPWM_RESERVED_65              (0x000006C0U)
#define PWM_EPWM_XMINMAX_SHDW1            (0x000006C4U)
#define PWM_EPWM_RESERVED_66(RESERVED_66) (0x000006C8U + ((RESERVED_66) * 0x4U))
#define PWM_EPWM_XCMP1_SHDW2              (0x00000700U)
#define PWM_EPWM_XCMP2_SHDW2              (0x00000704U)
#define PWM_EPWM_XCMP3_SHDW2              (0x00000708U)
#define PWM_EPWM_XCMP4_SHDW2              (0x0000070CU)
#define PWM_EPWM_XCMP5_SHDW2              (0x00000710U)
#define PWM_EPWM_XCMP6_SHDW2              (0x00000714U)
#define PWM_EPWM_XCMP7_SHDW2              (0x00000718U)
#define PWM_EPWM_XCMP8_SHDW2              (0x0000071CU)
#define PWM_EPWM_XTBPRD_SHDW2             (0x00000720U)
#define PWM_EPWM_RESERVED_67(RESERVED_67) (0x00000724U + ((RESERVED_67) * 0x4U))
#define PWM_EPWM_XAQCTLA_SHDW2            (0x00000730U)
#define PWM_EPWM_XAQCTLB_SHDW2            (0x00000732U)
#define PWM_EPWM_RESERVED_68(RESERVED_68) (0x00000734U + ((RESERVED_68) * 0x2U))
#define PWM_EPWM_CMPC_SHDW2               (0x0000073AU)
#define PWM_EPWM_RESERVED_69              (0x0000073CU)
#define PWM_EPWM_CMPD_SHDW2               (0x0000073EU)
#define PWM_EPWM_RESERVED_70              (0x00000740U)
#define PWM_EPWM_XMINMAX_SHDW2            (0x00000744U)
#define PWM_EPWM_RESERVED_71(RESERVED_71) (0x00000748U + ((RESERVED_71) * 0x4U))
#define PWM_EPWM_XCMP1_SHDW3              (0x00000780U)
#define PWM_EPWM_XCMP2_SHDW3              (0x00000784U)
#define PWM_EPWM_XCMP3_SHDW3              (0x00000788U)
#define PWM_EPWM_XCMP4_SHDW3              (0x0000078CU)
#define PWM_EPWM_XCMP5_SHDW3              (0x00000790U)
#define PWM_EPWM_XCMP6_SHDW3              (0x00000794U)
#define PWM_EPWM_XCMP7_SHDW3              (0x00000798U)
#define PWM_EPWM_XCMP8_SHDW3              (0x0000079CU)
#define PWM_EPWM_XTBPRD_SHDW3             (0x000007A0U)
#define PWM_EPWM_RESERVED_72(RESERVED_72) (0x000007A4U + ((RESERVED_72) * 0x4U))
#define PWM_EPWM_XAQCTLA_SHDW3            (0x000007B0U)
#define PWM_EPWM_XAQCTLB_SHDW3            (0x000007B2U)
#define PWM_EPWM_RESERVED_73(RESERVED_73) (0x000007B4U + ((RESERVED_73) * 0x2U))
#define PWM_EPWM_CMPC_SHDW3               (0x000007BAU)
#define PWM_EPWM_RESERVED_74              (0x000007BCU)
#define PWM_EPWM_CMPD_SHDW3               (0x000007BEU)
#define PWM_EPWM_RESERVED_75              (0x000007C0U)
#define PWM_EPWM_XMINMAX_SHDW3            (0x000007C4U)
#define PWM_EPWM_RESERVED_76(RESERVED_76) (0x000007C8U + ((RESERVED_76) * 0x4U))
#define PWM_EPWM_DECTL                    (0x00000800U)
#define PWM_EPWM_DECOMPSEL                (0x00000804U)
#define PWM_EPWM_DEACTCTL                 (0x00000808U)
#define PWM_EPWM_DESTS                    (0x0000080CU)
#define PWM_EPWM_DEFRC                    (0x00000810U)
#define PWM_EPWM_DECLR                    (0x00000814U)
#define PWM_EPWM_RESERVED_77(RESERVED_77) (0x00000818U + ((RESERVED_77) * 0x4U))
#define PWM_EPWM_DEMONCNT                 (0x00000820U)
#define PWM_EPWM_DEMONCTL                 (0x00000824U)
#define PWM_EPWM_DEMONSTEP                (0x00000828U)
#define PWM_EPWM_DEMONTHRES               (0x0000082CU)
#define PWM_EPWM_RESERVED_78(RESERVED_78) (0x00000830U + ((RESERVED_78) * 0x4U))
#define PWM_EPWM_MINDBCFG                 (0x00000C00U)
#define PWM_EPWM_MINDBDLY                 (0x00000C04U)
#define PWM_EPWM_RESERVED_79(RESERVED_79) (0x00000C08U + ((RESERVED_79) * 0x4U))
#define PWM_EPWM_LUTCTLA                  (0x00000C20U)
#define PWM_EPWM_LUTCTLB                  (0x00000C24U)
#define PWM_EPWM_RESERVED_80(RESERVED_80) (0x00000C28U + ((RESERVED_80) * 0x4U))

/**************************************************************************
 * Field Definition Macros
 **************************************************************************/

/* TBCTL */

