TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_TBCTL_CTRMODE_MASK     (0x0003U)
#define PWM_EPWM_TBCTL_CTRMODE_SHIFT    (0x0000U)
#define PWM_EPWM_TBCTL_CTRMODE_RESETVAL (0x0003U)
#define PWM_EPWM_TBCTL_CTRMODE_MAX      (0x0003U)

#define PWM_EPWM_TBCTL_PHSEN_MASK     (0x0004U)
#define PWM_EPWM_TBCTL_PHSEN_SHIFT    (0x0002U)
#define PWM_EPWM_TBCTL_PHSEN_RESETVAL (0x0000U)
#define PWM_EPWM_TBCTL_PHSEN_MAX      (0x0001U)

#define PWM_EPWM_TBCTL_PRDLD_MASK     (0x0008U)
#define PWM_EPWM_TBCTL_PRDLD_SHIFT    (0x0003U)
#define PWM_EPWM_TBCTL_PRDLD_RESETVAL (0x0000U)
#define PWM_EPWM_TBCTL_PRDLD_MAX      (0x0001U)

#define PWM_EPWM_TBCTL_RESERVED_1_MASK     (0x0030U)
#define PWM_EPWM_TBCTL_RESERVED_1_SHIFT    (0x0004U)
#define PWM_EPWM_TBCTL_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TBCTL_RESERVED_1_MAX      (0x0003U)

#define PWM_EPWM_TBCTL_SWFSYNC_MASK     (0x0040U)
#define PWM_EPWM_TBCTL_SWFSYNC_SHIFT    (0x0006U)
#define PWM_EPWM_TBCTL_SWFSYNC_RESETVAL (0x0000U)
#define PWM_EPWM_TBCTL_SWFSYNC_MAX      (0x0001U)

#define PWM_EPWM_TBCTL_HSPCLKDIV_MASK     (0x0380U)
#define PWM_EPWM_TBCTL_HSPCLKDIV_SHIFT    (0x0007U)
#define PWM_EPWM_TBCTL_HSPCLKDIV_RESETVAL (0x0001U)
#define PWM_EPWM_TBCTL_HSPCLKDIV_MAX      (0x0007U)

#define PWM_EPWM_TBCTL_CLKDIV_MASK     (0x1C00U)
#define PWM_EPWM_TBCTL_CLKDIV_SHIFT    (0x000AU)
#define PWM_EPWM_TBCTL_CLKDIV_RESETVAL (0x0000U)
#define PWM_EPWM_TBCTL_CLKDIV_MAX      (0x0007U)

#define PWM_EPWM_TBCTL_PHSDIR_MASK     (0x2000U)
#define PWM_EPWM_TBCTL_PHSDIR_SHIFT    (0x000DU)
#define PWM_EPWM_TBCTL_PHSDIR_RESETVAL (0x0000U)
#define PWM_EPWM_TBCTL_PHSDIR_MAX      (0x0001U)

#define PWM_EPWM_TBCTL_FREE_SOFT_MASK     (0xC000U)
#define PWM_EPWM_TBCTL_FREE_SOFT_SHIFT    (0x000EU)
#define PWM_EPWM_TBCTL_FREE_SOFT_RESETVAL (0x0000U)
#define PWM_EPWM_TBCTL_FREE_SOFT_MAX      (0x0003U)

#define PWM_EPWM_TBCTL_RESETVAL (0x0083U)

/* TBCTL2 */

#define PWM_EPWM_TBCTL2_RESERVED_1_MASK     (0x001FU)
#define PWM_EPWM_TBCTL2_RESERVED_1_SHIFT    (0x0000U)
#define PWM_EPWM_TBCTL2_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TBCTL2_RESERVED_1_MAX      (0x001FU)

#define PWM_EPWM_TBCTL2_SELFCLRTRREM_MASK     (0x0020U)
#define PWM_EPWM_TBCTL2_SELFCLRTRREM_SHIFT    (0x0005U)
#define PWM_EPWM_TBCTL2_SELFCLRTRREM_RESETVAL (0x0000U)
#define PWM_EPWM_TBCTL2_SELFCLRTRREM_MAX      (0x0001U)

#define PWM_EPWM_TBCTL2_OSHTSYNCMODE_MASK     (0x0040U)
#define PWM_EPWM_TBCTL2_OSHTSYNCMODE_SHIFT    (0x0006U)
#define PWM_EPWM_TBCTL2_OSHTSYNCMODE_RESETVAL (0x0000U)
#define PWM_EPWM_TBCTL2_OSHTSYNCMODE_MAX      (0x0001U)

#define PWM_EPWM_TBCTL2_OSHTSYNC_MASK     (0x0080U)
#define PWM_EPWM_TBCTL2_OSHTSYNC_SHIFT    (0x0007U)
#define PWM_EPWM_TBCTL2_OSHTSYNC_RESETVAL (0x0000U)
#define PWM_EPWM_TBCTL2_OSHTSYNC_MAX      (0x0001U)

#define PWM_EPWM_TBCTL2_RESERVED_2_MASK     (0x0F00U)
#define PWM_EPWM_TBCTL2_RESERVED_2_SHIFT    (0x0008U)
#define PWM_EPWM_TBCTL2_RESERVED_2_RESETVAL (0x0000U)
#define PWM_EPWM_TBCTL2_RESERVED_2_MAX      (0x000FU)

#define PWM_EPWM_TBCTL2_RESERVED_3_MASK     (0x3000U)
#define PWM_EPWM_TBCTL2_RESERVED_3_SHIFT    (0x000CU)
#define PWM_EPWM_TBCTL2_RESERVED_3_RESETVAL (0x0000U)
#define PWM_EPWM_TBCTL2_RESERVED_3_MAX      (0x0003U)

#define PWM_EPWM_TBCTL2_PRDLDSYNC_MASK     (0xC000U)
#define PWM_EPWM_TBCTL2_PRDLDSYNC_SHIFT    (0x000EU)
#define PWM_EPWM_TBCTL2_PRDLDSYNC_RESETVAL (0x0000U)
#define PWM_EPWM_TBCTL2_PRDLDSYNC_MAX      (0x0003U)

#define PWM_EPWM_TBCTL2_RESETVAL (0x0000U)

/* RESERVED_1 */

#define PWM_EPWM_RESERVED_1_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_1_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_1_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_1_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_1_RESETVAL (0x0000U)

/* EPWMSYNCINSEL */

#define PWM_EPWM_EPWMSYNCINSEL_SEL_MASK     (0x007FU)
#define PWM_EPWM_EPWMSYNCINSEL_SEL_SHIFT    (0x0000U)
#define PWM_EPWM_EPWMSYNCINSEL_SEL_RESETVAL (0x0001U)
#define PWM_EPWM_EPWMSYNCINSEL_SEL_MAX      (0x007FU)

#define PWM_EPWM_EPWMSYNCINSEL_RESERVED_1_MASK     (0xFF80U)
#define PWM_EPWM_EPWMSYNCINSEL_RESERVED_1_SHIFT    (0x0007U)
#define PWM_EPWM_EPWMSYNCINSEL_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_EPWMSYNCINSEL_RESERVED_1_MAX      (0x01FFU)

#define PWM_EPWM_EPWMSYNCINSEL_RESETVAL (0x0001U)

/* TBCTR */

#define PWM_EPWM_TBCTR_TBCTR_MASK     (0xFFFFU)
#define PWM_EPWM_TBCTR_TBCTR_SHIFT    (0x0000U)
#define PWM_EPWM_TBCTR_TBCTR_RESETVAL (0x0000U)
#define PWM_EPWM_TBCTR_TBCTR_MAX      (0xFFFFU)

#define PWM_EPWM_TBCTR_RESETVAL (0x0000U)

/* TBSTS */

#define PWM_EPWM_TBSTS_CTRDIR_MASK     (0x0001U)
#define PWM_EPWM_TBSTS_CTRDIR_SHIFT    (0x0000U)
#define PWM_EPWM_TBSTS_CTRDIR_RESETVAL (0x0001U)
#define PWM_EPWM_TBSTS_CTRDIR_MAX      (0x0001U)

#define PWM_EPWM_TBSTS_SYNCI_MASK     (0x0002U)
#define PWM_EPWM_TBSTS_SYNCI_SHIFT    (0x0001U)
#define PWM_EPWM_TBSTS_SYNCI_RESETVAL (0x0000U)
#define PWM_EPWM_TBSTS_SYNCI_MAX      (0x0001U)

#define PWM_EPWM_TBSTS_CTRMAX_MASK     (0x0004U)
#define PWM_EPWM_TBSTS_CTRMAX_SHIFT    (0x0002U)
#define PWM_EPWM_TBSTS_CTRMAX_RESETVAL (0x0000U)
#define PWM_EPWM_TBSTS_CTRMAX_MAX      (0x0001U)

#define PWM_EPWM_TBSTS_RESERVED_1_MASK     (0xFFF8U)
#define PWM_EPWM_TBSTS_RESERVED_1_SHIFT    (0x0003U)
#define PWM_EPWM_TBSTS_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TBSTS_RESERVED_1_MAX      (0x1FFFU)

#define PWM_EPWM_TBSTS_RESETVAL (0x0001U)

/* EPWMSYNCOUTEN */

#define PWM_EPWM_EPWMSYNCOUTEN_SWEN_MASK     (0x0001U)
#define PWM_EPWM_EPWMSYNCOUTEN_SWEN_SHIFT    (0x0000U)
#define PWM_EPWM_EPWMSYNCOUTEN_SWEN_RESETVAL (0x0001U)
#define PWM_EPWM_EPWMSYNCOUTEN_SWEN_MAX      (0x0001U)

#define PWM_EPWM_EPWMSYNCOUTEN_ZEROEN_MASK     (0x0002U)
#define PWM_EPWM_EPWMSYNCOUTEN_ZEROEN_SHIFT    (0x0001U)
#define PWM_EPWM_EPWMSYNCOUTEN_ZEROEN_RESETVAL (0x0000U)
#define PWM_EPWM_EPWMSYNCOUTEN_ZEROEN_MAX      (0x0001U)

#define PWM_EPWM_EPWMSYNCOUTEN_CMPBEN_MASK     (0x0004U)
#define PWM_EPWM_EPWMSYNCOUTEN_CMPBEN_SHIFT    (0x0002U)
#define PWM_EPWM_EPWMSYNCOUTEN_CMPBEN_RESETVAL (0x0000U)
#define PWM_EPWM_EPWMSYNCOUTEN_CMPBEN_MAX      (0x0001U)

#define PWM_EPWM_EPWMSYNCOUTEN_CMPCEN_MASK     (0x0008U)
#define PWM_EPWM_EPWMSYNCOUTEN_CMPCEN_SHIFT    (0x0003U)
#define PWM_EPWM_EPWMSYNCOUTEN_CMPCEN_RESETVAL (0x0000U)
#define PWM_EPWM_EPWMSYNCOUTEN_CMPCEN_MAX      (0x0001U)

