TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_EPWMSYNCOUTEN_CMPDEN_MASK     (0x0010U)
#define PWM_EPWM_EPWMSYNCOUTEN_CMPDEN_SHIFT    (0x0004U)
#define PWM_EPWM_EPWMSYNCOUTEN_CMPDEN_RESETVAL (0x0000U)
#define PWM_EPWM_EPWMSYNCOUTEN_CMPDEN_MAX      (0x0001U)

#define PWM_EPWM_EPWMSYNCOUTEN_DCAEVT1EN_MASK     (0x0020U)
#define PWM_EPWM_EPWMSYNCOUTEN_DCAEVT1EN_SHIFT    (0x0005U)
#define PWM_EPWM_EPWMSYNCOUTEN_DCAEVT1EN_RESETVAL (0x0000U)
#define PWM_EPWM_EPWMSYNCOUTEN_DCAEVT1EN_MAX      (0x0001U)

#define PWM_EPWM_EPWMSYNCOUTEN_DCBEVT1EN_MASK     (0x0040U)
#define PWM_EPWM_EPWMSYNCOUTEN_DCBEVT1EN_SHIFT    (0x0006U)
#define PWM_EPWM_EPWMSYNCOUTEN_DCBEVT1EN_RESETVAL (0x0000U)
#define PWM_EPWM_EPWMSYNCOUTEN_DCBEVT1EN_MAX      (0x0001U)

#define PWM_EPWM_EPWMSYNCOUTEN_RESERVED_1_MASK     (0x0080U)
#define PWM_EPWM_EPWMSYNCOUTEN_RESERVED_1_SHIFT    (0x0007U)
#define PWM_EPWM_EPWMSYNCOUTEN_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_EPWMSYNCOUTEN_RESERVED_1_MAX      (0x0001U)

#define PWM_EPWM_EPWMSYNCOUTEN_RESERVED_2_MASK     (0xFF00U)
#define PWM_EPWM_EPWMSYNCOUTEN_RESERVED_2_SHIFT    (0x0008U)
#define PWM_EPWM_EPWMSYNCOUTEN_RESERVED_2_RESETVAL (0x0000U)
#define PWM_EPWM_EPWMSYNCOUTEN_RESERVED_2_MAX      (0x00FFU)

#define PWM_EPWM_EPWMSYNCOUTEN_RESETVAL (0x0001U)

/* TBCTL3 */

#define PWM_EPWM_TBCTL3_OSSFRCEN_MASK     (0x0001U)
#define PWM_EPWM_TBCTL3_OSSFRCEN_SHIFT    (0x0000U)
#define PWM_EPWM_TBCTL3_OSSFRCEN_RESETVAL (0x0000U)
#define PWM_EPWM_TBCTL3_OSSFRCEN_MAX      (0x0001U)

#define PWM_EPWM_TBCTL3_RESERVED_1_MASK     (0xFFFEU)
#define PWM_EPWM_TBCTL3_RESERVED_1_SHIFT    (0x0001U)
#define PWM_EPWM_TBCTL3_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TBCTL3_RESERVED_1_MAX      (0x7FFFU)

#define PWM_EPWM_TBCTL3_RESETVAL (0x0000U)

/* CMPCTL */

#define PWM_EPWM_CMPCTL_LOADAMODE_MASK     (0x0003U)
#define PWM_EPWM_CMPCTL_LOADAMODE_SHIFT    (0x0000U)
#define PWM_EPWM_CMPCTL_LOADAMODE_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL_LOADAMODE_MAX      (0x0003U)

#define PWM_EPWM_CMPCTL_LOADBMODE_MASK     (0x000CU)
#define PWM_EPWM_CMPCTL_LOADBMODE_SHIFT    (0x0002U)
#define PWM_EPWM_CMPCTL_LOADBMODE_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL_LOADBMODE_MAX      (0x0003U)

#define PWM_EPWM_CMPCTL_SHDWAMODE_MASK     (0x0010U)
#define PWM_EPWM_CMPCTL_SHDWAMODE_SHIFT    (0x0004U)
#define PWM_EPWM_CMPCTL_SHDWAMODE_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL_SHDWAMODE_MAX      (0x0001U)

#define PWM_EPWM_CMPCTL_RESERVED_1_MASK     (0x0020U)
#define PWM_EPWM_CMPCTL_RESERVED_1_SHIFT    (0x0005U)
#define PWM_EPWM_CMPCTL_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL_RESERVED_1_MAX      (0x0001U)

#define PWM_EPWM_CMPCTL_SHDWBMODE_MASK     (0x0040U)
#define PWM_EPWM_CMPCTL_SHDWBMODE_SHIFT    (0x0006U)
#define PWM_EPWM_CMPCTL_SHDWBMODE_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL_SHDWBMODE_MAX      (0x0001U)

#define PWM_EPWM_CMPCTL_RESERVED_2_MASK     (0x0080U)
#define PWM_EPWM_CMPCTL_RESERVED_2_SHIFT    (0x0007U)
#define PWM_EPWM_CMPCTL_RESERVED_2_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL_RESERVED_2_MAX      (0x0001U)

#define PWM_EPWM_CMPCTL_SHDWAFULL_MASK     (0x0100U)
#define PWM_EPWM_CMPCTL_SHDWAFULL_SHIFT    (0x0008U)
#define PWM_EPWM_CMPCTL_SHDWAFULL_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL_SHDWAFULL_MAX      (0x0001U)

#define PWM_EPWM_CMPCTL_SHDWBFULL_MASK     (0x0200U)
#define PWM_EPWM_CMPCTL_SHDWBFULL_SHIFT    (0x0009U)
#define PWM_EPWM_CMPCTL_SHDWBFULL_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL_SHDWBFULL_MAX      (0x0001U)

#define PWM_EPWM_CMPCTL_LOADASYNC_MASK     (0x0C00U)
#define PWM_EPWM_CMPCTL_LOADASYNC_SHIFT    (0x000AU)
#define PWM_EPWM_CMPCTL_LOADASYNC_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL_LOADASYNC_MAX      (0x0003U)

#define PWM_EPWM_CMPCTL_LOADBSYNC_MASK     (0x3000U)
#define PWM_EPWM_CMPCTL_LOADBSYNC_SHIFT    (0x000CU)
#define PWM_EPWM_CMPCTL_LOADBSYNC_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL_LOADBSYNC_MAX      (0x0003U)

#define PWM_EPWM_CMPCTL_RESERVED_3_MASK     (0x4000U)
#define PWM_EPWM_CMPCTL_RESERVED_3_SHIFT    (0x000EU)
#define PWM_EPWM_CMPCTL_RESERVED_3_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL_RESERVED_3_MAX      (0x0001U)

#define PWM_EPWM_CMPCTL_LINKDUTYHR_MASK     (0x8000U)
#define PWM_EPWM_CMPCTL_LINKDUTYHR_SHIFT    (0x000FU)
#define PWM_EPWM_CMPCTL_LINKDUTYHR_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL_LINKDUTYHR_MAX      (0x0001U)

#define PWM_EPWM_CMPCTL_RESETVAL (0x0000U)

/* CMPCTL2 */

#define PWM_EPWM_CMPCTL2_LOADCMODE_MASK     (0x0003U)
#define PWM_EPWM_CMPCTL2_LOADCMODE_SHIFT    (0x0000U)
#define PWM_EPWM_CMPCTL2_LOADCMODE_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL2_LOADCMODE_MAX      (0x0003U)

#define PWM_EPWM_CMPCTL2_LOADDMODE_MASK     (0x000CU)
#define PWM_EPWM_CMPCTL2_LOADDMODE_SHIFT    (0x0002U)
#define PWM_EPWM_CMPCTL2_LOADDMODE_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL2_LOADDMODE_MAX      (0x0003U)

#define PWM_EPWM_CMPCTL2_SHDWCMODE_MASK     (0x0010U)
#define PWM_EPWM_CMPCTL2_SHDWCMODE_SHIFT    (0x0004U)
#define PWM_EPWM_CMPCTL2_SHDWCMODE_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL2_SHDWCMODE_MAX      (0x0001U)

#define PWM_EPWM_CMPCTL2_RESERVED_1_MASK     (0x0020U)
#define PWM_EPWM_CMPCTL2_RESERVED_1_SHIFT    (0x0005U)
#define PWM_EPWM_CMPCTL2_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL2_RESERVED_1_MAX      (0x0001U)

#define PWM_EPWM_CMPCTL2_SHDWDMODE_MASK     (0x0040U)
#define PWM_EPWM_CMPCTL2_SHDWDMODE_SHIFT    (0x0006U)
#define PWM_EPWM_CMPCTL2_SHDWDMODE_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL2_SHDWDMODE_MAX      (0x0001U)

#define PWM_EPWM_CMPCTL2_RESERVED_2_MASK     (0x0380U)
#define PWM_EPWM_CMPCTL2_RESERVED_2_SHIFT    (0x0007U)
#define PWM_EPWM_CMPCTL2_RESERVED_2_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL2_RESERVED_2_MAX      (0x0007U)

#define PWM_EPWM_CMPCTL2_LOADCSYNC_MASK     (0x0C00U)
#define PWM_EPWM_CMPCTL2_LOADCSYNC_SHIFT    (0x000AU)
#define PWM_EPWM_CMPCTL2_LOADCSYNC_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL2_LOADCSYNC_MAX      (0x0003U)

#define PWM_EPWM_CMPCTL2_LOADDSYNC_MASK     (0x3000U)
#define PWM_EPWM_CMPCTL2_LOADDSYNC_SHIFT    (0x000CU)
#define PWM_EPWM_CMPCTL2_LOADDSYNC_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL2_LOADDSYNC_MAX      (0x0003U)

#define PWM_EPWM_CMPCTL2_RESERVED_3_MASK     (0xC000U)
#define PWM_EPWM_CMPCTL2_RESERVED_3_SHIFT    (0x000EU)
#define PWM_EPWM_CMPCTL2_RESERVED_3_RESETVAL (0x0000U)
#define PWM_EPWM_CMPCTL2_RESERVED_3_MAX      (0x0003U)

