TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_GLDCTL_GLD_MASK     (0x0001U)
#define PWM_EPWM_GLDCTL_GLD_SHIFT    (0x0000U)
#define PWM_EPWM_GLDCTL_GLD_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCTL_GLD_MAX      (0x0001U)

#define PWM_EPWM_GLDCTL_GLDMODE_MASK     (0x001EU)
#define PWM_EPWM_GLDCTL_GLDMODE_SHIFT    (0x0001U)
#define PWM_EPWM_GLDCTL_GLDMODE_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCTL_GLDMODE_MAX      (0x000FU)

#define PWM_EPWM_GLDCTL_OSHTMODE_MASK     (0x0020U)
#define PWM_EPWM_GLDCTL_OSHTMODE_SHIFT    (0x0005U)
#define PWM_EPWM_GLDCTL_OSHTMODE_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCTL_OSHTMODE_MAX      (0x0001U)

#define PWM_EPWM_GLDCTL_RESERVED_1_MASK     (0x0040U)
#define PWM_EPWM_GLDCTL_RESERVED_1_SHIFT    (0x0006U)
#define PWM_EPWM_GLDCTL_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCTL_RESERVED_1_MAX      (0x0001U)

#define PWM_EPWM_GLDCTL_GLDPRD_MASK     (0x0380U)
#define PWM_EPWM_GLDCTL_GLDPRD_SHIFT    (0x0007U)
#define PWM_EPWM_GLDCTL_GLDPRD_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCTL_GLDPRD_MAX      (0x0007U)

#define PWM_EPWM_GLDCTL_GLDCNT_MASK     (0x1C00U)
#define PWM_EPWM_GLDCTL_GLDCNT_SHIFT    (0x000AU)
#define PWM_EPWM_GLDCTL_GLDCNT_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCTL_GLDCNT_MAX      (0x0007U)

#define PWM_EPWM_GLDCTL_RESERVED_2_MASK     (0xE000U)
#define PWM_EPWM_GLDCTL_RESERVED_2_SHIFT    (0x000DU)
#define PWM_EPWM_GLDCTL_RESERVED_2_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCTL_RESERVED_2_MAX      (0x0007U)

#define PWM_EPWM_GLDCTL_RESETVAL (0x0000U)

/* GLDCFG */

#define PWM_EPWM_GLDCFG_TBPRD_TBPRDHR_MASK     (0x0001U)
#define PWM_EPWM_GLDCFG_TBPRD_TBPRDHR_SHIFT    (0x0000U)
#define PWM_EPWM_GLDCFG_TBPRD_TBPRDHR_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCFG_TBPRD_TBPRDHR_MAX      (0x0001U)

#define PWM_EPWM_GLDCFG_CMPA_CMPAHR_MASK     (0x0002U)
#define PWM_EPWM_GLDCFG_CMPA_CMPAHR_SHIFT    (0x0001U)
#define PWM_EPWM_GLDCFG_CMPA_CMPAHR_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCFG_CMPA_CMPAHR_MAX      (0x0001U)

#define PWM_EPWM_GLDCFG_CMPB_CMPBHR_MASK     (0x0004U)
#define PWM_EPWM_GLDCFG_CMPB_CMPBHR_SHIFT    (0x0002U)
#define PWM_EPWM_GLDCFG_CMPB_CMPBHR_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCFG_CMPB_CMPBHR_MAX      (0x0001U)

#define PWM_EPWM_GLDCFG_CMPC_MASK     (0x0008U)
#define PWM_EPWM_GLDCFG_CMPC_SHIFT    (0x0003U)
#define PWM_EPWM_GLDCFG_CMPC_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCFG_CMPC_MAX      (0x0001U)

#define PWM_EPWM_GLDCFG_CMPD_MASK     (0x0010U)
#define PWM_EPWM_GLDCFG_CMPD_SHIFT    (0x0004U)
#define PWM_EPWM_GLDCFG_CMPD_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCFG_CMPD_MAX      (0x0001U)

#define PWM_EPWM_GLDCFG_DBRED_DBREDHR_MASK     (0x0020U)
#define PWM_EPWM_GLDCFG_DBRED_DBREDHR_SHIFT    (0x0005U)
#define PWM_EPWM_GLDCFG_DBRED_DBREDHR_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCFG_DBRED_DBREDHR_MAX      (0x0001U)

#define PWM_EPWM_GLDCFG_DBFED_DBFEDHR_MASK     (0x0040U)
#define PWM_EPWM_GLDCFG_DBFED_DBFEDHR_SHIFT    (0x0006U)
#define PWM_EPWM_GLDCFG_DBFED_DBFEDHR_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCFG_DBFED_DBFEDHR_MAX      (0x0001U)

#define PWM_EPWM_GLDCFG_DBCTL_MASK     (0x0080U)
#define PWM_EPWM_GLDCFG_DBCTL_SHIFT    (0x0007U)
#define PWM_EPWM_GLDCFG_DBCTL_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCFG_DBCTL_MAX      (0x0001U)

#define PWM_EPWM_GLDCFG_AQCTLA_AQCTLA2_MASK     (0x0100U)
#define PWM_EPWM_GLDCFG_AQCTLA_AQCTLA2_SHIFT    (0x0008U)
#define PWM_EPWM_GLDCFG_AQCTLA_AQCTLA2_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCFG_AQCTLA_AQCTLA2_MAX      (0x0001U)

#define PWM_EPWM_GLDCFG_AQCTLB_AQCTLB2_MASK     (0x0200U)
#define PWM_EPWM_GLDCFG_AQCTLB_AQCTLB2_SHIFT    (0x0009U)
#define PWM_EPWM_GLDCFG_AQCTLB_AQCTLB2_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCFG_AQCTLB_AQCTLB2_MAX      (0x0001U)

#define PWM_EPWM_GLDCFG_AQCSFRC_MASK     (0x0400U)
#define PWM_EPWM_GLDCFG_AQCSFRC_SHIFT    (0x000AU)
#define PWM_EPWM_GLDCFG_AQCSFRC_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCFG_AQCSFRC_MAX      (0x0001U)

#define PWM_EPWM_GLDCFG_RESERVED_1_MASK     (0xF800U)
#define PWM_EPWM_GLDCFG_RESERVED_1_SHIFT    (0x000BU)
#define PWM_EPWM_GLDCFG_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCFG_RESERVED_1_MAX      (0x001FU)

#define PWM_EPWM_GLDCFG_RESETVAL (0x0000U)

/* RESERVED_15 */

#define PWM_EPWM_RESERVED_15_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_15_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_15_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_15_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_15_RESETVAL (0x0000U)

/* EPWMXLINK */

#define PWM_EPWM_EPWMXLINK_TBPRDLINK_MASK     (0x0000001FU)
#define PWM_EPWM_EPWMXLINK_TBPRDLINK_SHIFT    (0x00000000U)
#define PWM_EPWM_EPWMXLINK_TBPRDLINK_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMXLINK_TBPRDLINK_MAX      (0x0000001FU)

#define PWM_EPWM_EPWMXLINK_CMPALINK_MASK     (0x000003E0U)
#define PWM_EPWM_EPWMXLINK_CMPALINK_SHIFT    (0x00000005U)
#define PWM_EPWM_EPWMXLINK_CMPALINK_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMXLINK_CMPALINK_MAX      (0x0000001FU)

#define PWM_EPWM_EPWMXLINK_CMPBLINK_MASK     (0x00007C00U)
#define PWM_EPWM_EPWMXLINK_CMPBLINK_SHIFT    (0x0000000AU)
#define PWM_EPWM_EPWMXLINK_CMPBLINK_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMXLINK_CMPBLINK_MAX      (0x0000001FU)

#define PWM_EPWM_EPWMXLINK_RESERVED_1_MASK     (0x00008000U)
#define PWM_EPWM_EPWMXLINK_RESERVED_1_SHIFT    (0x0000000FU)
#define PWM_EPWM_EPWMXLINK_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMXLINK_RESERVED_1_MAX      (0x00000001U)

#define PWM_EPWM_EPWMXLINK_CMPCLINK_MASK     (0x001F0000U)
#define PWM_EPWM_EPWMXLINK_CMPCLINK_SHIFT    (0x00000010U)
#define PWM_EPWM_EPWMXLINK_CMPCLINK_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMXLINK_CMPCLINK_MAX      (0x0000001FU)

#define PWM_EPWM_EPWMXLINK_CMPDLINK_MASK     (0x03E00000U)
#define PWM_EPWM_EPWMXLINK_CMPDLINK_SHIFT    (0x00000015U)
#define PWM_EPWM_EPWMXLINK_CMPDLINK_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMXLINK_CMPDLINK_MAX      (0x0000001FU)

#define PWM_EPWM_EPWMXLINK_GLDCTL2LINK_MASK     (0x7C000000U)
#define PWM_EPWM_EPWMXLINK_GLDCTL2LINK_SHIFT    (0x0000001AU)
#define PWM_EPWM_EPWMXLINK_GLDCTL2LINK_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMXLINK_GLDCTL2LINK_MAX      (0x0000001FU)

