TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_EPWMXLINK_RESERVED_2_MASK     (0x80000000U)
#define PWM_EPWM_EPWMXLINK_RESERVED_2_SHIFT    (0x0000001FU)
#define PWM_EPWM_EPWMXLINK_RESERVED_2_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMXLINK_RESERVED_2_MAX      (0x00000001U)

#define PWM_EPWM_EPWMXLINK_RESETVAL (0x00000000U)

/* EPWMXLINK2 */

#define PWM_EPWM_EPWMXLINK2_DBREDLINK_MASK     (0x0000001FU)
#define PWM_EPWM_EPWMXLINK2_DBREDLINK_SHIFT    (0x00000000U)
#define PWM_EPWM_EPWMXLINK2_DBREDLINK_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMXLINK2_DBREDLINK_MAX      (0x0000001FU)

#define PWM_EPWM_EPWMXLINK2_DBFEDLINK_MASK     (0x000003E0U)
#define PWM_EPWM_EPWMXLINK2_DBFEDLINK_SHIFT    (0x00000005U)
#define PWM_EPWM_EPWMXLINK2_DBFEDLINK_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMXLINK2_DBFEDLINK_MAX      (0x0000001FU)

#define PWM_EPWM_EPWMXLINK2_RESERVED_1_MASK     (0xFFFFFC00U)
#define PWM_EPWM_EPWMXLINK2_RESERVED_1_SHIFT    (0x0000000AU)
#define PWM_EPWM_EPWMXLINK2_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMXLINK2_RESERVED_1_MAX      (0x003FFFFFU)

#define PWM_EPWM_EPWMXLINK2_RESETVAL (0x00000000U)

/* RESERVED_16 */

#define PWM_EPWM_RESERVED_16_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_16_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_16_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_16_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_16_RESETVAL (0x0000U)

/* ETEST */

#define PWM_EPWM_ETEST_CMPFIX_OVERRIDE_MASK     (0x0001U)
#define PWM_EPWM_ETEST_CMPFIX_OVERRIDE_SHIFT    (0x0000U)
#define PWM_EPWM_ETEST_CMPFIX_OVERRIDE_RESETVAL (0x0001U)
#define PWM_EPWM_ETEST_CMPFIX_OVERRIDE_MAX      (0x0001U)

#define PWM_EPWM_ETEST_RESERVED_1_MASK     (0xFFFEU)
#define PWM_EPWM_ETEST_RESERVED_1_SHIFT    (0x0001U)
#define PWM_EPWM_ETEST_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_ETEST_RESERVED_1_MAX      (0x7FFFU)

#define PWM_EPWM_ETEST_RESETVAL (0x0001U)

/* EPWMREV */

#define PWM_EPWM_EPWMREV_REV_MASK     (0x00FFU)
#define PWM_EPWM_EPWMREV_REV_SHIFT    (0x0000U)
#define PWM_EPWM_EPWMREV_REV_RESETVAL (0x0000U)
#define PWM_EPWM_EPWMREV_REV_MAX      (0x00FFU)

#define PWM_EPWM_EPWMREV_TYPE_MASK     (0xFF00U)
#define PWM_EPWM_EPWMREV_TYPE_SHIFT    (0x0008U)
#define PWM_EPWM_EPWMREV_TYPE_RESETVAL (0x0005U)
#define PWM_EPWM_EPWMREV_TYPE_MAX      (0x00FFU)

#define PWM_EPWM_EPWMREV_RESETVAL (0x0500U)

/* HRPWMREV */

#define PWM_EPWM_HRPWMREV_REV_MASK     (0x00FFU)
#define PWM_EPWM_HRPWMREV_REV_SHIFT    (0x0000U)
#define PWM_EPWM_HRPWMREV_REV_RESETVAL (0x0000U)
#define PWM_EPWM_HRPWMREV_REV_MAX      (0x00FFU)

#define PWM_EPWM_HRPWMREV_TYPE_MASK     (0xFF00U)
#define PWM_EPWM_HRPWMREV_TYPE_SHIFT    (0x0008U)
#define PWM_EPWM_HRPWMREV_TYPE_RESETVAL (0x0003U)
#define PWM_EPWM_HRPWMREV_TYPE_MAX      (0x00FFU)

#define PWM_EPWM_HRPWMREV_RESETVAL (0x0300U)

/* AQCTLA */

#define PWM_EPWM_AQCTLA_ZRO_MASK     (0x0003U)
#define PWM_EPWM_AQCTLA_ZRO_SHIFT    (0x0000U)
#define PWM_EPWM_AQCTLA_ZRO_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLA_ZRO_MAX      (0x0003U)

#define PWM_EPWM_AQCTLA_PRD_MASK     (0x000CU)
#define PWM_EPWM_AQCTLA_PRD_SHIFT    (0x0002U)
#define PWM_EPWM_AQCTLA_PRD_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLA_PRD_MAX      (0x0003U)

#define PWM_EPWM_AQCTLA_CAU_MASK     (0x0030U)
#define PWM_EPWM_AQCTLA_CAU_SHIFT    (0x0004U)
#define PWM_EPWM_AQCTLA_CAU_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLA_CAU_MAX      (0x0003U)

#define PWM_EPWM_AQCTLA_CAD_MASK     (0x00C0U)
#define PWM_EPWM_AQCTLA_CAD_SHIFT    (0x0006U)
#define PWM_EPWM_AQCTLA_CAD_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLA_CAD_MAX      (0x0003U)

#define PWM_EPWM_AQCTLA_CBU_MASK     (0x0300U)
#define PWM_EPWM_AQCTLA_CBU_SHIFT    (0x0008U)
#define PWM_EPWM_AQCTLA_CBU_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLA_CBU_MAX      (0x0003U)

#define PWM_EPWM_AQCTLA_CBD_MASK     (0x0C00U)
#define PWM_EPWM_AQCTLA_CBD_SHIFT    (0x000AU)
#define PWM_EPWM_AQCTLA_CBD_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLA_CBD_MAX      (0x0003U)

#define PWM_EPWM_AQCTLA_RESERVED_1_MASK     (0xF000U)
#define PWM_EPWM_AQCTLA_RESERVED_1_SHIFT    (0x000CU)
#define PWM_EPWM_AQCTLA_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLA_RESERVED_1_MAX      (0x000FU)

#define PWM_EPWM_AQCTLA_RESETVAL (0x0000U)

/* AQCTLA2 */

#define PWM_EPWM_AQCTLA2_T1U_MASK     (0x0003U)
#define PWM_EPWM_AQCTLA2_T1U_SHIFT    (0x0000U)
#define PWM_EPWM_AQCTLA2_T1U_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLA2_T1U_MAX      (0x0003U)

#define PWM_EPWM_AQCTLA2_T1D_MASK     (0x000CU)
#define PWM_EPWM_AQCTLA2_T1D_SHIFT    (0x0002U)
#define PWM_EPWM_AQCTLA2_T1D_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLA2_T1D_MAX      (0x0003U)

#define PWM_EPWM_AQCTLA2_T2U_MASK     (0x0030U)
#define PWM_EPWM_AQCTLA2_T2U_SHIFT    (0x0004U)
#define PWM_EPWM_AQCTLA2_T2U_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLA2_T2U_MAX      (0x0003U)

#define PWM_EPWM_AQCTLA2_T2D_MASK     (0x00C0U)
#define PWM_EPWM_AQCTLA2_T2D_SHIFT    (0x0006U)
#define PWM_EPWM_AQCTLA2_T2D_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLA2_T2D_MAX      (0x0003U)

#define PWM_EPWM_AQCTLA2_RESERVED_1_MASK     (0xFF00U)
#define PWM_EPWM_AQCTLA2_RESERVED_1_SHIFT    (0x0008U)
#define PWM_EPWM_AQCTLA2_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLA2_RESERVED_1_MAX      (0x00FFU)

#define PWM_EPWM_AQCTLA2_RESETVAL (0x0000U)

/* AQCTLB */

#define PWM_EPWM_AQCTLB_ZRO_MASK     (0x0003U)
#define PWM_EPWM_AQCTLB_ZRO_SHIFT    (0x0000U)
#define PWM_EPWM_AQCTLB_ZRO_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLB_ZRO_MAX      (0x0003U)

#define PWM_EPWM_AQCTLB_PRD_MASK     (0x000CU)
#define PWM_EPWM_AQCTLB_PRD_SHIFT    (0x0002U)
#define PWM_EPWM_AQCTLB_PRD_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLB_PRD_MAX      (0x0003U)

#define PWM_EPWM_AQCTLB_CAU_MASK     (0x0030U)
#define PWM_EPWM_AQCTLB_CAU_SHIFT    (0x0004U)
#define PWM_EPWM_AQCTLB_CAU_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLB_CAU_MAX      (0x0003U)

#define PWM_EPWM_AQCTLB_CAD_MASK     (0x00C0U)
#define PWM_EPWM_AQCTLB_CAD_SHIFT    (0x0006U)
#define PWM_EPWM_AQCTLB_CAD_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLB_CAD_MAX      (0x0003U)

#define PWM_EPWM_AQCTLB_CBU_MASK     (0x0300U)
#define PWM_EPWM_AQCTLB_CBU_SHIFT    (0x0008U)
#define PWM_EPWM_AQCTLB_CBU_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLB_CBU_MAX      (0x0003U)

#define PWM_EPWM_AQCTLB_CBD_MASK     (0x0C00U)
#define PWM_EPWM_AQCTLB_CBD_SHIFT    (0x000AU)
#define PWM_EPWM_AQCTLB_CBD_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLB_CBD_MAX      (0x0003U)

#define PWM_EPWM_AQCTLB_RESERVED_1_MASK     (0xF000U)
#define PWM_EPWM_AQCTLB_RESERVED_1_SHIFT    (0x000CU)
#define PWM_EPWM_AQCTLB_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_AQCTLB_RESERVED_1_MAX      (0x000FU)

#define PWM_EPWM_AQCTLB_RESETVAL (0x0000U)

