TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_DBFED_RESERVED_1_MASK     (0xC000U)
#define PWM_EPWM_DBFED_RESERVED_1_SHIFT    (0x000EU)
#define PWM_EPWM_DBFED_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_DBFED_RESERVED_1_MAX      (0x0003U)

#define PWM_EPWM_DBFED_RESETVAL (0x0000U)

/* RESERVED_20 */

#define PWM_EPWM_RESERVED_20_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_20_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_20_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_20_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_20_RESETVAL (0x0000U)

/* TBPHS */

#define PWM_EPWM_TBPHS_TBPHSHR_MASK     (0x0000FFFFU)
#define PWM_EPWM_TBPHS_TBPHSHR_SHIFT    (0x00000000U)
#define PWM_EPWM_TBPHS_TBPHSHR_RESETVAL (0x00000000U)
#define PWM_EPWM_TBPHS_TBPHSHR_MAX      (0x0000FFFFU)

#define PWM_EPWM_TBPHS_TBPHS_MASK     (0xFFFF0000U)
#define PWM_EPWM_TBPHS_TBPHS_SHIFT    (0x00000010U)
#define PWM_EPWM_TBPHS_TBPHS_RESETVAL (0x00000000U)
#define PWM_EPWM_TBPHS_TBPHS_MAX      (0x0000FFFFU)

#define PWM_EPWM_TBPHS_RESETVAL (0x00000000U)

/* TBPRDHR */

#define PWM_EPWM_TBPRDHR_TBPRDHR_MASK     (0xFFFFU)
#define PWM_EPWM_TBPRDHR_TBPRDHR_SHIFT    (0x0000U)
#define PWM_EPWM_TBPRDHR_TBPRDHR_RESETVAL (0x0000U)
#define PWM_EPWM_TBPRDHR_TBPRDHR_MAX      (0xFFFFU)

#define PWM_EPWM_TBPRDHR_RESETVAL (0x0000U)

/* TBPRD */

#define PWM_EPWM_TBPRD_TBPRD_MASK     (0xFFFFU)
#define PWM_EPWM_TBPRD_TBPRD_SHIFT    (0x0000U)
#define PWM_EPWM_TBPRD_TBPRD_RESETVAL (0x0000U)
#define PWM_EPWM_TBPRD_TBPRD_MAX      (0xFFFFU)

#define PWM_EPWM_TBPRD_RESETVAL (0x0000U)

/* TBPRDHRB */

#define PWM_EPWM_TBPRDHRB_TBPRDHRB_DELAY_MASK     (0x00FFU)
#define PWM_EPWM_TBPRDHRB_TBPRDHRB_DELAY_SHIFT    (0x0000U)
#define PWM_EPWM_TBPRDHRB_TBPRDHRB_DELAY_RESETVAL (0x0000U)
#define PWM_EPWM_TBPRDHRB_TBPRDHRB_DELAY_MAX      (0x00FFU)

#define PWM_EPWM_TBPRDHRB_TBPRDHRB_MASK     (0xFF00U)
#define PWM_EPWM_TBPRDHRB_TBPRDHRB_SHIFT    (0x0008U)
#define PWM_EPWM_TBPRDHRB_TBPRDHRB_RESETVAL (0x0000U)
#define PWM_EPWM_TBPRDHRB_TBPRDHRB_MAX      (0x00FFU)

#define PWM_EPWM_TBPRDHRB_RESETVAL (0x0000U)

/* RESERVED_21 */

#define PWM_EPWM_RESERVED_21_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_21_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_21_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_21_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_21_RESETVAL (0x0000U)

/* CMPA */

#define PWM_EPWM_CMPA_CMPAHR_MASK     (0x0000FFFFU)
#define PWM_EPWM_CMPA_CMPAHR_SHIFT    (0x00000000U)
#define PWM_EPWM_CMPA_CMPAHR_RESETVAL (0x00000000U)
#define PWM_EPWM_CMPA_CMPAHR_MAX      (0x0000FFFFU)

#define PWM_EPWM_CMPA_CMPA_MASK     (0xFFFF0000U)
#define PWM_EPWM_CMPA_CMPA_SHIFT    (0x00000010U)
#define PWM_EPWM_CMPA_CMPA_RESETVAL (0x00000000U)
#define PWM_EPWM_CMPA_CMPA_MAX      (0x0000FFFFU)

#define PWM_EPWM_CMPA_RESETVAL (0x00000000U)

/* CMPB */

#define PWM_EPWM_CMPB_CMPBHR_MASK     (0x0000FFFFU)
#define PWM_EPWM_CMPB_CMPBHR_SHIFT    (0x00000000U)
#define PWM_EPWM_CMPB_CMPBHR_RESETVAL (0x00000000U)
#define PWM_EPWM_CMPB_CMPBHR_MAX      (0x0000FFFFU)

#define PWM_EPWM_CMPB_CMPB_MASK     (0xFFFF0000U)
#define PWM_EPWM_CMPB_CMPB_SHIFT    (0x00000010U)
#define PWM_EPWM_CMPB_CMPB_RESETVAL (0x00000000U)
#define PWM_EPWM_CMPB_CMPB_MAX      (0x0000FFFFU)

#define PWM_EPWM_CMPB_RESETVAL (0x00000000U)

/* RESERVED_22 */

#define PWM_EPWM_RESERVED_22_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_22_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_22_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_22_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_22_RESETVAL (0x0000U)

/* CMPC */

#define PWM_EPWM_CMPC_CMPC_MASK     (0xFFFFU)
#define PWM_EPWM_CMPC_CMPC_SHIFT    (0x0000U)
#define PWM_EPWM_CMPC_CMPC_RESETVAL (0x0000U)
#define PWM_EPWM_CMPC_CMPC_MAX      (0xFFFFU)

#define PWM_EPWM_CMPC_RESETVAL (0x0000U)

/* RESERVED_23 */

#define PWM_EPWM_RESERVED_23_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_23_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_23_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_23_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_23_RESETVAL (0x0000U)

/* CMPD */

#define PWM_EPWM_CMPD_CMPD_MASK     (0xFFFFU)
#define PWM_EPWM_CMPD_CMPD_SHIFT    (0x0000U)
#define PWM_EPWM_CMPD_CMPD_RESETVAL (0x0000U)
#define PWM_EPWM_CMPD_CMPD_MAX      (0xFFFFU)

#define PWM_EPWM_CMPD_RESETVAL (0x0000U)

/* RESERVED_24 */

#define PWM_EPWM_RESERVED_24_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_24_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_24_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_24_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_24_RESETVAL (0x0000U)

/* GLDCTL2 */

#define PWM_EPWM_GLDCTL2_OSHTLD_MASK     (0x0001U)
#define PWM_EPWM_GLDCTL2_OSHTLD_SHIFT    (0x0000U)
#define PWM_EPWM_GLDCTL2_OSHTLD_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCTL2_OSHTLD_MAX      (0x0001U)

#define PWM_EPWM_GLDCTL2_GFRCLD_MASK     (0x0002U)
#define PWM_EPWM_GLDCTL2_GFRCLD_SHIFT    (0x0001U)
#define PWM_EPWM_GLDCTL2_GFRCLD_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCTL2_GFRCLD_MAX      (0x0001U)

#define PWM_EPWM_GLDCTL2_RESERVED_1_MASK     (0xFFFCU)
#define PWM_EPWM_GLDCTL2_RESERVED_1_SHIFT    (0x0002U)
#define PWM_EPWM_GLDCTL2_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_GLDCTL2_RESERVED_1_MAX      (0x3FFFU)

#define PWM_EPWM_GLDCTL2_RESETVAL (0x0000U)

/* RESERVED_25 */

#define PWM_EPWM_RESERVED_25_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_25_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_25_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_25_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_25_RESETVAL (0x0000U)

/* SWVDELVAL */

#define PWM_EPWM_SWVDELVAL_SWVDELVAL_MASK     (0xFFFFU)
#define PWM_EPWM_SWVDELVAL_SWVDELVAL_SHIFT    (0x0000U)
#define PWM_EPWM_SWVDELVAL_SWVDELVAL_RESETVAL (0x0000U)
#define PWM_EPWM_SWVDELVAL_SWVDELVAL_MAX      (0xFFFFU)

#define PWM_EPWM_SWVDELVAL_RESETVAL (0x0000U)

/* RESERVED_26 */

#define PWM_EPWM_RESERVED_26_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_26_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_26_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_26_UNNAMED_MAX      (0x0001U)

