TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_RESERVED_26_RESETVAL (0x0000U)

/* TZSEL */

#define PWM_EPWM_TZSEL_CBC1_MASK     (0x0001U)
#define PWM_EPWM_TZSEL_CBC1_SHIFT    (0x0000U)
#define PWM_EPWM_TZSEL_CBC1_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL_CBC1_MAX      (0x0001U)

#define PWM_EPWM_TZSEL_CBC2_MASK     (0x0002U)
#define PWM_EPWM_TZSEL_CBC2_SHIFT    (0x0001U)
#define PWM_EPWM_TZSEL_CBC2_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL_CBC2_MAX      (0x0001U)

#define PWM_EPWM_TZSEL_CBC3_MASK     (0x0004U)
#define PWM_EPWM_TZSEL_CBC3_SHIFT    (0x0002U)
#define PWM_EPWM_TZSEL_CBC3_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL_CBC3_MAX      (0x0001U)

#define PWM_EPWM_TZSEL_CBC4_MASK     (0x0008U)
#define PWM_EPWM_TZSEL_CBC4_SHIFT    (0x0003U)
#define PWM_EPWM_TZSEL_CBC4_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL_CBC4_MAX      (0x0001U)

#define PWM_EPWM_TZSEL_CBC5_MASK     (0x0010U)
#define PWM_EPWM_TZSEL_CBC5_SHIFT    (0x0004U)
#define PWM_EPWM_TZSEL_CBC5_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL_CBC5_MAX      (0x0001U)

#define PWM_EPWM_TZSEL_CBC6_MASK     (0x0020U)
#define PWM_EPWM_TZSEL_CBC6_SHIFT    (0x0005U)
#define PWM_EPWM_TZSEL_CBC6_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL_CBC6_MAX      (0x0001U)

#define PWM_EPWM_TZSEL_DCAEVT2_MASK     (0x0040U)
#define PWM_EPWM_TZSEL_DCAEVT2_SHIFT    (0x0006U)
#define PWM_EPWM_TZSEL_DCAEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL_DCAEVT2_MAX      (0x0001U)

#define PWM_EPWM_TZSEL_DCBEVT2_MASK     (0x0080U)
#define PWM_EPWM_TZSEL_DCBEVT2_SHIFT    (0x0007U)
#define PWM_EPWM_TZSEL_DCBEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL_DCBEVT2_MAX      (0x0001U)

#define PWM_EPWM_TZSEL_OSHT1_MASK     (0x0100U)
#define PWM_EPWM_TZSEL_OSHT1_SHIFT    (0x0008U)
#define PWM_EPWM_TZSEL_OSHT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL_OSHT1_MAX      (0x0001U)

#define PWM_EPWM_TZSEL_OSHT2_MASK     (0x0200U)
#define PWM_EPWM_TZSEL_OSHT2_SHIFT    (0x0009U)
#define PWM_EPWM_TZSEL_OSHT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL_OSHT2_MAX      (0x0001U)

#define PWM_EPWM_TZSEL_OSHT3_MASK     (0x0400U)
#define PWM_EPWM_TZSEL_OSHT3_SHIFT    (0x000AU)
#define PWM_EPWM_TZSEL_OSHT3_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL_OSHT3_MAX      (0x0001U)

#define PWM_EPWM_TZSEL_OSHT4_MASK     (0x0800U)
#define PWM_EPWM_TZSEL_OSHT4_SHIFT    (0x000BU)
#define PWM_EPWM_TZSEL_OSHT4_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL_OSHT4_MAX      (0x0001U)

#define PWM_EPWM_TZSEL_OSHT5_MASK     (0x1000U)
#define PWM_EPWM_TZSEL_OSHT5_SHIFT    (0x000CU)
#define PWM_EPWM_TZSEL_OSHT5_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL_OSHT5_MAX      (0x0001U)

#define PWM_EPWM_TZSEL_OSHT6_MASK     (0x2000U)
#define PWM_EPWM_TZSEL_OSHT6_SHIFT    (0x000DU)
#define PWM_EPWM_TZSEL_OSHT6_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL_OSHT6_MAX      (0x0001U)

#define PWM_EPWM_TZSEL_DCAEVT1_MASK     (0x4000U)
#define PWM_EPWM_TZSEL_DCAEVT1_SHIFT    (0x000EU)
#define PWM_EPWM_TZSEL_DCAEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL_DCAEVT1_MAX      (0x0001U)

#define PWM_EPWM_TZSEL_DCBEVT1_MASK     (0x8000U)
#define PWM_EPWM_TZSEL_DCBEVT1_SHIFT    (0x000FU)
#define PWM_EPWM_TZSEL_DCBEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL_DCBEVT1_MAX      (0x0001U)

#define PWM_EPWM_TZSEL_RESETVAL (0x0000U)

/* TZSEL2 */

#define PWM_EPWM_TZSEL2_CAPEVTCBC_MASK     (0x0001U)
#define PWM_EPWM_TZSEL2_CAPEVTCBC_SHIFT    (0x0000U)
#define PWM_EPWM_TZSEL2_CAPEVTCBC_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL2_CAPEVTCBC_MAX      (0x0001U)

#define PWM_EPWM_TZSEL2_RESERVED_1_MASK     (0x00FEU)
#define PWM_EPWM_TZSEL2_RESERVED_1_SHIFT    (0x0001U)
#define PWM_EPWM_TZSEL2_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL2_RESERVED_1_MAX      (0x007FU)

#define PWM_EPWM_TZSEL2_CAPEVTOST_MASK     (0x0100U)
#define PWM_EPWM_TZSEL2_CAPEVTOST_SHIFT    (0x0008U)
#define PWM_EPWM_TZSEL2_CAPEVTOST_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL2_CAPEVTOST_MAX      (0x0001U)

#define PWM_EPWM_TZSEL2_RESERVED_2_MASK     (0xFE00U)
#define PWM_EPWM_TZSEL2_RESERVED_2_SHIFT    (0x0009U)
#define PWM_EPWM_TZSEL2_RESERVED_2_RESETVAL (0x0000U)
#define PWM_EPWM_TZSEL2_RESERVED_2_MAX      (0x007FU)

#define PWM_EPWM_TZSEL2_RESETVAL (0x0000U)

/* TZDCSEL */

#define PWM_EPWM_TZDCSEL_DCAEVT1_MASK     (0x0007U)
#define PWM_EPWM_TZDCSEL_DCAEVT1_SHIFT    (0x0000U)
#define PWM_EPWM_TZDCSEL_DCAEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZDCSEL_DCAEVT1_MAX      (0x0007U)

#define PWM_EPWM_TZDCSEL_DCAEVT2_MASK     (0x0038U)
#define PWM_EPWM_TZDCSEL_DCAEVT2_SHIFT    (0x0003U)
#define PWM_EPWM_TZDCSEL_DCAEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZDCSEL_DCAEVT2_MAX      (0x0007U)

#define PWM_EPWM_TZDCSEL_DCBEVT1_MASK     (0x01C0U)
#define PWM_EPWM_TZDCSEL_DCBEVT1_SHIFT    (0x0006U)
#define PWM_EPWM_TZDCSEL_DCBEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZDCSEL_DCBEVT1_MAX      (0x0007U)

#define PWM_EPWM_TZDCSEL_DCBEVT2_MASK     (0x0E00U)
#define PWM_EPWM_TZDCSEL_DCBEVT2_SHIFT    (0x0009U)
#define PWM_EPWM_TZDCSEL_DCBEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZDCSEL_DCBEVT2_MAX      (0x0007U)

#define PWM_EPWM_TZDCSEL_RESERVED_1_MASK     (0xF000U)
#define PWM_EPWM_TZDCSEL_RESERVED_1_SHIFT    (0x000CU)
#define PWM_EPWM_TZDCSEL_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TZDCSEL_RESERVED_1_MAX      (0x000FU)

#define PWM_EPWM_TZDCSEL_RESETVAL (0x0000U)

/* RESERVED_27 */

#define PWM_EPWM_RESERVED_27_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_27_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_27_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_27_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_27_RESETVAL (0x0000U)

/* TZCTL */

#define PWM_EPWM_TZCTL_TZA_MASK     (0x0003U)
#define PWM_EPWM_TZCTL_TZA_SHIFT    (0x0000U)
#define PWM_EPWM_TZCTL_TZA_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTL_TZA_MAX      (0x0003U)

#define PWM_EPWM_TZCTL_TZB_MASK     (0x000CU)
#define PWM_EPWM_TZCTL_TZB_SHIFT    (0x0002U)
#define PWM_EPWM_TZCTL_TZB_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTL_TZB_MAX      (0x0003U)

#define PWM_EPWM_TZCTL_DCAEVT1_MASK     (0x0030U)
#define PWM_EPWM_TZCTL_DCAEVT1_SHIFT    (0x0004U)
#define PWM_EPWM_TZCTL_DCAEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTL_DCAEVT1_MAX      (0x0003U)

#define PWM_EPWM_TZCTL_DCAEVT2_MASK     (0x00C0U)
#define PWM_EPWM_TZCTL_DCAEVT2_SHIFT    (0x0006U)
#define PWM_EPWM_TZCTL_DCAEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTL_DCAEVT2_MAX      (0x0003U)

#define PWM_EPWM_TZCTL_DCBEVT1_MASK     (0x0300U)
#define PWM_EPWM_TZCTL_DCBEVT1_SHIFT    (0x0008U)
#define PWM_EPWM_TZCTL_DCBEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTL_DCBEVT1_MAX      (0x0003U)

#define PWM_EPWM_TZCTL_DCBEVT2_MASK     (0x0C00U)
#define PWM_EPWM_TZCTL_DCBEVT2_SHIFT    (0x000AU)
#define PWM_EPWM_TZCTL_DCBEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTL_DCBEVT2_MAX      (0x0003U)

#define PWM_EPWM_TZCTL_RESERVED_1_MASK     (0xF000U)
#define PWM_EPWM_TZCTL_RESERVED_1_SHIFT    (0x000CU)
#define PWM_EPWM_TZCTL_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTL_RESERVED_1_MAX      (0x000FU)

#define PWM_EPWM_TZCTL_RESETVAL (0x0000U)

/* TZCTL2 */

