TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_TZCTL2_TZAU_MASK     (0x0007U)
#define PWM_EPWM_TZCTL2_TZAU_SHIFT    (0x0000U)
#define PWM_EPWM_TZCTL2_TZAU_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTL2_TZAU_MAX      (0x0007U)

#define PWM_EPWM_TZCTL2_TZAD_MASK     (0x0038U)
#define PWM_EPWM_TZCTL2_TZAD_SHIFT    (0x0003U)
#define PWM_EPWM_TZCTL2_TZAD_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTL2_TZAD_MAX      (0x0007U)

#define PWM_EPWM_TZCTL2_TZBU_MASK     (0x01C0U)
#define PWM_EPWM_TZCTL2_TZBU_SHIFT    (0x0006U)
#define PWM_EPWM_TZCTL2_TZBU_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTL2_TZBU_MAX      (0x0007U)

#define PWM_EPWM_TZCTL2_TZBD_MASK     (0x0E00U)
#define PWM_EPWM_TZCTL2_TZBD_SHIFT    (0x0009U)
#define PWM_EPWM_TZCTL2_TZBD_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTL2_TZBD_MAX      (0x0007U)

#define PWM_EPWM_TZCTL2_RESERVED_1_MASK     (0x7000U)
#define PWM_EPWM_TZCTL2_RESERVED_1_SHIFT    (0x000CU)
#define PWM_EPWM_TZCTL2_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTL2_RESERVED_1_MAX      (0x0007U)

#define PWM_EPWM_TZCTL2_ETZE_MASK     (0x8000U)
#define PWM_EPWM_TZCTL2_ETZE_SHIFT    (0x000FU)
#define PWM_EPWM_TZCTL2_ETZE_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTL2_ETZE_MAX      (0x0001U)

#define PWM_EPWM_TZCTL2_RESETVAL (0x0000U)

/* TZCTLDCA */

#define PWM_EPWM_TZCTLDCA_DCAEVT1U_MASK     (0x0007U)
#define PWM_EPWM_TZCTLDCA_DCAEVT1U_SHIFT    (0x0000U)
#define PWM_EPWM_TZCTLDCA_DCAEVT1U_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTLDCA_DCAEVT1U_MAX      (0x0007U)

#define PWM_EPWM_TZCTLDCA_DCAEVT1D_MASK     (0x0038U)
#define PWM_EPWM_TZCTLDCA_DCAEVT1D_SHIFT    (0x0003U)
#define PWM_EPWM_TZCTLDCA_DCAEVT1D_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTLDCA_DCAEVT1D_MAX      (0x0007U)

#define PWM_EPWM_TZCTLDCA_DCAEVT2U_MASK     (0x01C0U)
#define PWM_EPWM_TZCTLDCA_DCAEVT2U_SHIFT    (0x0006U)
#define PWM_EPWM_TZCTLDCA_DCAEVT2U_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTLDCA_DCAEVT2U_MAX      (0x0007U)

#define PWM_EPWM_TZCTLDCA_DCAEVT2D_MASK     (0x0E00U)
#define PWM_EPWM_TZCTLDCA_DCAEVT2D_SHIFT    (0x0009U)
#define PWM_EPWM_TZCTLDCA_DCAEVT2D_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTLDCA_DCAEVT2D_MAX      (0x0007U)

#define PWM_EPWM_TZCTLDCA_RESERVED_1_MASK     (0xF000U)
#define PWM_EPWM_TZCTLDCA_RESERVED_1_SHIFT    (0x000CU)
#define PWM_EPWM_TZCTLDCA_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTLDCA_RESERVED_1_MAX      (0x000FU)

#define PWM_EPWM_TZCTLDCA_RESETVAL (0x0000U)

/* TZCTLDCB */

#define PWM_EPWM_TZCTLDCB_DCBEVT1U_MASK     (0x0007U)
#define PWM_EPWM_TZCTLDCB_DCBEVT1U_SHIFT    (0x0000U)
#define PWM_EPWM_TZCTLDCB_DCBEVT1U_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTLDCB_DCBEVT1U_MAX      (0x0007U)

#define PWM_EPWM_TZCTLDCB_DCBEVT1D_MASK     (0x0038U)
#define PWM_EPWM_TZCTLDCB_DCBEVT1D_SHIFT    (0x0003U)
#define PWM_EPWM_TZCTLDCB_DCBEVT1D_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTLDCB_DCBEVT1D_MAX      (0x0007U)

#define PWM_EPWM_TZCTLDCB_DCBEVT2U_MASK     (0x01C0U)
#define PWM_EPWM_TZCTLDCB_DCBEVT2U_SHIFT    (0x0006U)
#define PWM_EPWM_TZCTLDCB_DCBEVT2U_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTLDCB_DCBEVT2U_MAX      (0x0007U)

#define PWM_EPWM_TZCTLDCB_DCBEVT2D_MASK     (0x0E00U)
#define PWM_EPWM_TZCTLDCB_DCBEVT2D_SHIFT    (0x0009U)
#define PWM_EPWM_TZCTLDCB_DCBEVT2D_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTLDCB_DCBEVT2D_MAX      (0x0007U)

#define PWM_EPWM_TZCTLDCB_RESERVED_1_MASK     (0xF000U)
#define PWM_EPWM_TZCTLDCB_RESERVED_1_SHIFT    (0x000CU)
#define PWM_EPWM_TZCTLDCB_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TZCTLDCB_RESERVED_1_MAX      (0x000FU)

#define PWM_EPWM_TZCTLDCB_RESETVAL (0x0000U)

/* RESERVED_28 */

#define PWM_EPWM_RESERVED_28_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_28_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_28_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_28_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_28_RESETVAL (0x0000U)

/* TZEINT */

#define PWM_EPWM_TZEINT_RESERVED_1_MASK     (0x0001U)
#define PWM_EPWM_TZEINT_RESERVED_1_SHIFT    (0x0000U)
#define PWM_EPWM_TZEINT_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TZEINT_RESERVED_1_MAX      (0x0001U)

#define PWM_EPWM_TZEINT_CBC_MASK     (0x0002U)
#define PWM_EPWM_TZEINT_CBC_SHIFT    (0x0001U)
#define PWM_EPWM_TZEINT_CBC_RESETVAL (0x0000U)
#define PWM_EPWM_TZEINT_CBC_MAX      (0x0001U)

#define PWM_EPWM_TZEINT_OST_MASK     (0x0004U)
#define PWM_EPWM_TZEINT_OST_SHIFT    (0x0002U)
#define PWM_EPWM_TZEINT_OST_RESETVAL (0x0000U)
#define PWM_EPWM_TZEINT_OST_MAX      (0x0001U)

#define PWM_EPWM_TZEINT_DCAEVT1_MASK     (0x0008U)
#define PWM_EPWM_TZEINT_DCAEVT1_SHIFT    (0x0003U)
#define PWM_EPWM_TZEINT_DCAEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZEINT_DCAEVT1_MAX      (0x0001U)

#define PWM_EPWM_TZEINT_DCAEVT2_MASK     (0x0010U)
#define PWM_EPWM_TZEINT_DCAEVT2_SHIFT    (0x0004U)
#define PWM_EPWM_TZEINT_DCAEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZEINT_DCAEVT2_MAX      (0x0001U)

#define PWM_EPWM_TZEINT_DCBEVT1_MASK     (0x0020U)
#define PWM_EPWM_TZEINT_DCBEVT1_SHIFT    (0x0005U)
#define PWM_EPWM_TZEINT_DCBEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZEINT_DCBEVT1_MAX      (0x0001U)

#define PWM_EPWM_TZEINT_DCBEVT2_MASK     (0x0040U)
#define PWM_EPWM_TZEINT_DCBEVT2_SHIFT    (0x0006U)
#define PWM_EPWM_TZEINT_DCBEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZEINT_DCBEVT2_MAX      (0x0001U)

#define PWM_EPWM_TZEINT_CAPEVT_MASK     (0x0080U)
#define PWM_EPWM_TZEINT_CAPEVT_SHIFT    (0x0007U)
#define PWM_EPWM_TZEINT_CAPEVT_RESETVAL (0x0000U)
#define PWM_EPWM_TZEINT_CAPEVT_MAX      (0x0001U)

#define PWM_EPWM_TZEINT_RESERVED_2_MASK     (0xFF00U)
#define PWM_EPWM_TZEINT_RESERVED_2_SHIFT    (0x0008U)
#define PWM_EPWM_TZEINT_RESERVED_2_RESETVAL (0x0000U)
#define PWM_EPWM_TZEINT_RESERVED_2_MAX      (0x00FFU)

#define PWM_EPWM_TZEINT_RESETVAL (0x0000U)

/* RESERVED_29 */

#define PWM_EPWM_RESERVED_29_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_29_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_29_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_29_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_29_RESETVAL (0x0000U)

/* TZFLG */

