TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_TZFLG_INT_MASK     (0x0001U)
#define PWM_EPWM_TZFLG_INT_SHIFT    (0x0000U)
#define PWM_EPWM_TZFLG_INT_RESETVAL (0x0000U)
#define PWM_EPWM_TZFLG_INT_MAX      (0x0001U)

#define PWM_EPWM_TZFLG_CBC_MASK     (0x0002U)
#define PWM_EPWM_TZFLG_CBC_SHIFT    (0x0001U)
#define PWM_EPWM_TZFLG_CBC_RESETVAL (0x0000U)
#define PWM_EPWM_TZFLG_CBC_MAX      (0x0001U)

#define PWM_EPWM_TZFLG_OST_MASK     (0x0004U)
#define PWM_EPWM_TZFLG_OST_SHIFT    (0x0002U)
#define PWM_EPWM_TZFLG_OST_RESETVAL (0x0000U)
#define PWM_EPWM_TZFLG_OST_MAX      (0x0001U)

#define PWM_EPWM_TZFLG_DCAEVT1_MASK     (0x0008U)
#define PWM_EPWM_TZFLG_DCAEVT1_SHIFT    (0x0003U)
#define PWM_EPWM_TZFLG_DCAEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZFLG_DCAEVT1_MAX      (0x0001U)

#define PWM_EPWM_TZFLG_DCAEVT2_MASK     (0x0010U)
#define PWM_EPWM_TZFLG_DCAEVT2_SHIFT    (0x0004U)
#define PWM_EPWM_TZFLG_DCAEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZFLG_DCAEVT2_MAX      (0x0001U)

#define PWM_EPWM_TZFLG_DCBEVT1_MASK     (0x0020U)
#define PWM_EPWM_TZFLG_DCBEVT1_SHIFT    (0x0005U)
#define PWM_EPWM_TZFLG_DCBEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZFLG_DCBEVT1_MAX      (0x0001U)

#define PWM_EPWM_TZFLG_DCBEVT2_MASK     (0x0040U)
#define PWM_EPWM_TZFLG_DCBEVT2_SHIFT    (0x0006U)
#define PWM_EPWM_TZFLG_DCBEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZFLG_DCBEVT2_MAX      (0x0001U)

#define PWM_EPWM_TZFLG_CAPEVT_MASK     (0x0080U)
#define PWM_EPWM_TZFLG_CAPEVT_SHIFT    (0x0007U)
#define PWM_EPWM_TZFLG_CAPEVT_RESETVAL (0x0000U)
#define PWM_EPWM_TZFLG_CAPEVT_MAX      (0x0001U)

#define PWM_EPWM_TZFLG_RESERVED_1_MASK     (0xFF00U)
#define PWM_EPWM_TZFLG_RESERVED_1_SHIFT    (0x0008U)
#define PWM_EPWM_TZFLG_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TZFLG_RESERVED_1_MAX      (0x00FFU)

#define PWM_EPWM_TZFLG_RESETVAL (0x0000U)

/* TZCBCFLG */

#define PWM_EPWM_TZCBCFLG_CBC1_MASK     (0x0001U)
#define PWM_EPWM_TZCBCFLG_CBC1_SHIFT    (0x0000U)
#define PWM_EPWM_TZCBCFLG_CBC1_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCFLG_CBC1_MAX      (0x0001U)

#define PWM_EPWM_TZCBCFLG_CBC2_MASK     (0x0002U)
#define PWM_EPWM_TZCBCFLG_CBC2_SHIFT    (0x0001U)
#define PWM_EPWM_TZCBCFLG_CBC2_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCFLG_CBC2_MAX      (0x0001U)

#define PWM_EPWM_TZCBCFLG_CBC3_MASK     (0x0004U)
#define PWM_EPWM_TZCBCFLG_CBC3_SHIFT    (0x0002U)
#define PWM_EPWM_TZCBCFLG_CBC3_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCFLG_CBC3_MAX      (0x0001U)

#define PWM_EPWM_TZCBCFLG_CBC4_MASK     (0x0008U)
#define PWM_EPWM_TZCBCFLG_CBC4_SHIFT    (0x0003U)
#define PWM_EPWM_TZCBCFLG_CBC4_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCFLG_CBC4_MAX      (0x0001U)

#define PWM_EPWM_TZCBCFLG_CBC5_MASK     (0x0010U)
#define PWM_EPWM_TZCBCFLG_CBC5_SHIFT    (0x0004U)
#define PWM_EPWM_TZCBCFLG_CBC5_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCFLG_CBC5_MAX      (0x0001U)

#define PWM_EPWM_TZCBCFLG_CBC6_MASK     (0x0020U)
#define PWM_EPWM_TZCBCFLG_CBC6_SHIFT    (0x0005U)
#define PWM_EPWM_TZCBCFLG_CBC6_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCFLG_CBC6_MAX      (0x0001U)

#define PWM_EPWM_TZCBCFLG_DCAEVT2_MASK     (0x0040U)
#define PWM_EPWM_TZCBCFLG_DCAEVT2_SHIFT    (0x0006U)
#define PWM_EPWM_TZCBCFLG_DCAEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCFLG_DCAEVT2_MAX      (0x0001U)

#define PWM_EPWM_TZCBCFLG_DCBEVT2_MASK     (0x0080U)
#define PWM_EPWM_TZCBCFLG_DCBEVT2_SHIFT    (0x0007U)
#define PWM_EPWM_TZCBCFLG_DCBEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCFLG_DCBEVT2_MAX      (0x0001U)

#define PWM_EPWM_TZCBCFLG_CAPEVT_MASK     (0x0100U)
#define PWM_EPWM_TZCBCFLG_CAPEVT_SHIFT    (0x0008U)
#define PWM_EPWM_TZCBCFLG_CAPEVT_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCFLG_CAPEVT_MAX      (0x0001U)

#define PWM_EPWM_TZCBCFLG_RESERVED_1_MASK     (0xFE00U)
#define PWM_EPWM_TZCBCFLG_RESERVED_1_SHIFT    (0x0009U)
#define PWM_EPWM_TZCBCFLG_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCFLG_RESERVED_1_MAX      (0x007FU)

#define PWM_EPWM_TZCBCFLG_RESETVAL (0x0000U)

/* TZOSTFLG */

#define PWM_EPWM_TZOSTFLG_OST1_MASK     (0x0001U)
#define PWM_EPWM_TZOSTFLG_OST1_SHIFT    (0x0000U)
#define PWM_EPWM_TZOSTFLG_OST1_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTFLG_OST1_MAX      (0x0001U)

#define PWM_EPWM_TZOSTFLG_OST2_MASK     (0x0002U)
#define PWM_EPWM_TZOSTFLG_OST2_SHIFT    (0x0001U)
#define PWM_EPWM_TZOSTFLG_OST2_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTFLG_OST2_MAX      (0x0001U)

#define PWM_EPWM_TZOSTFLG_OST3_MASK     (0x0004U)
#define PWM_EPWM_TZOSTFLG_OST3_SHIFT    (0x0002U)
#define PWM_EPWM_TZOSTFLG_OST3_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTFLG_OST3_MAX      (0x0001U)

#define PWM_EPWM_TZOSTFLG_OST4_MASK     (0x0008U)
#define PWM_EPWM_TZOSTFLG_OST4_SHIFT    (0x0003U)
#define PWM_EPWM_TZOSTFLG_OST4_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTFLG_OST4_MAX      (0x0001U)

#define PWM_EPWM_TZOSTFLG_OST5_MASK     (0x0010U)
#define PWM_EPWM_TZOSTFLG_OST5_SHIFT    (0x0004U)
#define PWM_EPWM_TZOSTFLG_OST5_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTFLG_OST5_MAX      (0x0001U)

#define PWM_EPWM_TZOSTFLG_OST6_MASK     (0x0020U)
#define PWM_EPWM_TZOSTFLG_OST6_SHIFT    (0x0005U)
#define PWM_EPWM_TZOSTFLG_OST6_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTFLG_OST6_MAX      (0x0001U)

#define PWM_EPWM_TZOSTFLG_DCAEVT1_MASK     (0x0040U)
#define PWM_EPWM_TZOSTFLG_DCAEVT1_SHIFT    (0x0006U)
#define PWM_EPWM_TZOSTFLG_DCAEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTFLG_DCAEVT1_MAX      (0x0001U)

#define PWM_EPWM_TZOSTFLG_DCBEVT1_MASK     (0x0080U)
#define PWM_EPWM_TZOSTFLG_DCBEVT1_SHIFT    (0x0007U)
#define PWM_EPWM_TZOSTFLG_DCBEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTFLG_DCBEVT1_MAX      (0x0001U)

#define PWM_EPWM_TZOSTFLG_CAPEVT_MASK     (0x0100U)
#define PWM_EPWM_TZOSTFLG_CAPEVT_SHIFT    (0x0008U)
#define PWM_EPWM_TZOSTFLG_CAPEVT_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTFLG_CAPEVT_MAX      (0x0001U)

#define PWM_EPWM_TZOSTFLG_RESERVED_1_MASK     (0xFE00U)
#define PWM_EPWM_TZOSTFLG_RESERVED_1_SHIFT    (0x0009U)
#define PWM_EPWM_TZOSTFLG_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTFLG_RESERVED_1_MAX      (0x007FU)

