TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_TZOSTFLG_RESETVAL (0x0000U)

/* RESERVED_30 */

#define PWM_EPWM_RESERVED_30_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_30_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_30_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_30_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_30_RESETVAL (0x0000U)

/* TZCLR */

#define PWM_EPWM_TZCLR_INT_MASK     (0x0001U)
#define PWM_EPWM_TZCLR_INT_SHIFT    (0x0000U)
#define PWM_EPWM_TZCLR_INT_RESETVAL (0x0000U)
#define PWM_EPWM_TZCLR_INT_MAX      (0x0001U)

#define PWM_EPWM_TZCLR_CBC_MASK     (0x0002U)
#define PWM_EPWM_TZCLR_CBC_SHIFT    (0x0001U)
#define PWM_EPWM_TZCLR_CBC_RESETVAL (0x0000U)
#define PWM_EPWM_TZCLR_CBC_MAX      (0x0001U)

#define PWM_EPWM_TZCLR_OST_MASK     (0x0004U)
#define PWM_EPWM_TZCLR_OST_SHIFT    (0x0002U)
#define PWM_EPWM_TZCLR_OST_RESETVAL (0x0000U)
#define PWM_EPWM_TZCLR_OST_MAX      (0x0001U)

#define PWM_EPWM_TZCLR_DCAEVT1_MASK     (0x0008U)
#define PWM_EPWM_TZCLR_DCAEVT1_SHIFT    (0x0003U)
#define PWM_EPWM_TZCLR_DCAEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZCLR_DCAEVT1_MAX      (0x0001U)

#define PWM_EPWM_TZCLR_DCAEVT2_MASK     (0x0010U)
#define PWM_EPWM_TZCLR_DCAEVT2_SHIFT    (0x0004U)
#define PWM_EPWM_TZCLR_DCAEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZCLR_DCAEVT2_MAX      (0x0001U)

#define PWM_EPWM_TZCLR_DCBEVT1_MASK     (0x0020U)
#define PWM_EPWM_TZCLR_DCBEVT1_SHIFT    (0x0005U)
#define PWM_EPWM_TZCLR_DCBEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZCLR_DCBEVT1_MAX      (0x0001U)

#define PWM_EPWM_TZCLR_DCBEVT2_MASK     (0x0040U)
#define PWM_EPWM_TZCLR_DCBEVT2_SHIFT    (0x0006U)
#define PWM_EPWM_TZCLR_DCBEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZCLR_DCBEVT2_MAX      (0x0001U)

#define PWM_EPWM_TZCLR_CAPEVT_MASK     (0x0080U)
#define PWM_EPWM_TZCLR_CAPEVT_SHIFT    (0x0007U)
#define PWM_EPWM_TZCLR_CAPEVT_RESETVAL (0x0000U)
#define PWM_EPWM_TZCLR_CAPEVT_MAX      (0x0001U)

#define PWM_EPWM_TZCLR_RESERVED_1_MASK     (0x3F00U)
#define PWM_EPWM_TZCLR_RESERVED_1_SHIFT    (0x0008U)
#define PWM_EPWM_TZCLR_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TZCLR_RESERVED_1_MAX      (0x003FU)

#define PWM_EPWM_TZCLR_CBCPULSE_MASK     (0xC000U)
#define PWM_EPWM_TZCLR_CBCPULSE_SHIFT    (0x000EU)
#define PWM_EPWM_TZCLR_CBCPULSE_RESETVAL (0x0000U)
#define PWM_EPWM_TZCLR_CBCPULSE_MAX      (0x0003U)

#define PWM_EPWM_TZCLR_RESETVAL (0x0000U)

/* TZCBCCLR */

#define PWM_EPWM_TZCBCCLR_CBC1_MASK     (0x0001U)
#define PWM_EPWM_TZCBCCLR_CBC1_SHIFT    (0x0000U)
#define PWM_EPWM_TZCBCCLR_CBC1_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCCLR_CBC1_MAX      (0x0001U)

#define PWM_EPWM_TZCBCCLR_CBC2_MASK     (0x0002U)
#define PWM_EPWM_TZCBCCLR_CBC2_SHIFT    (0x0001U)
#define PWM_EPWM_TZCBCCLR_CBC2_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCCLR_CBC2_MAX      (0x0001U)

#define PWM_EPWM_TZCBCCLR_CBC3_MASK     (0x0004U)
#define PWM_EPWM_TZCBCCLR_CBC3_SHIFT    (0x0002U)
#define PWM_EPWM_TZCBCCLR_CBC3_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCCLR_CBC3_MAX      (0x0001U)

#define PWM_EPWM_TZCBCCLR_CBC4_MASK     (0x0008U)
#define PWM_EPWM_TZCBCCLR_CBC4_SHIFT    (0x0003U)
#define PWM_EPWM_TZCBCCLR_CBC4_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCCLR_CBC4_MAX      (0x0001U)

#define PWM_EPWM_TZCBCCLR_CBC5_MASK     (0x0010U)
#define PWM_EPWM_TZCBCCLR_CBC5_SHIFT    (0x0004U)
#define PWM_EPWM_TZCBCCLR_CBC5_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCCLR_CBC5_MAX      (0x0001U)

#define PWM_EPWM_TZCBCCLR_CBC6_MASK     (0x0020U)
#define PWM_EPWM_TZCBCCLR_CBC6_SHIFT    (0x0005U)
#define PWM_EPWM_TZCBCCLR_CBC6_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCCLR_CBC6_MAX      (0x0001U)

#define PWM_EPWM_TZCBCCLR_DCAEVT2_MASK     (0x0040U)
#define PWM_EPWM_TZCBCCLR_DCAEVT2_SHIFT    (0x0006U)
#define PWM_EPWM_TZCBCCLR_DCAEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCCLR_DCAEVT2_MAX      (0x0001U)

#define PWM_EPWM_TZCBCCLR_DCBEVT2_MASK     (0x0080U)
#define PWM_EPWM_TZCBCCLR_DCBEVT2_SHIFT    (0x0007U)
#define PWM_EPWM_TZCBCCLR_DCBEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCCLR_DCBEVT2_MAX      (0x0001U)

#define PWM_EPWM_TZCBCCLR_CAPEVT_MASK     (0x0100U)
#define PWM_EPWM_TZCBCCLR_CAPEVT_SHIFT    (0x0008U)
#define PWM_EPWM_TZCBCCLR_CAPEVT_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCCLR_CAPEVT_MAX      (0x0001U)

#define PWM_EPWM_TZCBCCLR_RESERVED_1_MASK     (0xFE00U)
#define PWM_EPWM_TZCBCCLR_RESERVED_1_SHIFT    (0x0009U)
#define PWM_EPWM_TZCBCCLR_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TZCBCCLR_RESERVED_1_MAX      (0x007FU)

#define PWM_EPWM_TZCBCCLR_RESETVAL (0x0000U)

/* TZOSTCLR */

#define PWM_EPWM_TZOSTCLR_OST1_MASK     (0x0001U)
#define PWM_EPWM_TZOSTCLR_OST1_SHIFT    (0x0000U)
#define PWM_EPWM_TZOSTCLR_OST1_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTCLR_OST1_MAX      (0x0001U)

#define PWM_EPWM_TZOSTCLR_OST2_MASK     (0x0002U)
#define PWM_EPWM_TZOSTCLR_OST2_SHIFT    (0x0001U)
#define PWM_EPWM_TZOSTCLR_OST2_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTCLR_OST2_MAX      (0x0001U)

#define PWM_EPWM_TZOSTCLR_OST3_MASK     (0x0004U)
#define PWM_EPWM_TZOSTCLR_OST3_SHIFT    (0x0002U)
#define PWM_EPWM_TZOSTCLR_OST3_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTCLR_OST3_MAX      (0x0001U)

#define PWM_EPWM_TZOSTCLR_OST4_MASK     (0x0008U)
#define PWM_EPWM_TZOSTCLR_OST4_SHIFT    (0x0003U)
#define PWM_EPWM_TZOSTCLR_OST4_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTCLR_OST4_MAX      (0x0001U)

#define PWM_EPWM_TZOSTCLR_OST5_MASK     (0x0010U)
#define PWM_EPWM_TZOSTCLR_OST5_SHIFT    (0x0004U)
#define PWM_EPWM_TZOSTCLR_OST5_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTCLR_OST5_MAX      (0x0001U)

#define PWM_EPWM_TZOSTCLR_OST6_MASK     (0x0020U)
#define PWM_EPWM_TZOSTCLR_OST6_SHIFT    (0x0005U)
#define PWM_EPWM_TZOSTCLR_OST6_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTCLR_OST6_MAX      (0x0001U)

#define PWM_EPWM_TZOSTCLR_DCAEVT1_MASK     (0x0040U)
#define PWM_EPWM_TZOSTCLR_DCAEVT1_SHIFT    (0x0006U)
#define PWM_EPWM_TZOSTCLR_DCAEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTCLR_DCAEVT1_MAX      (0x0001U)

#define PWM_EPWM_TZOSTCLR_DCBEVT1_MASK     (0x0080U)
#define PWM_EPWM_TZOSTCLR_DCBEVT1_SHIFT    (0x0007U)
#define PWM_EPWM_TZOSTCLR_DCBEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTCLR_DCBEVT1_MAX      (0x0001U)

#define PWM_EPWM_TZOSTCLR_CAPEVT_MASK     (0x0100U)
#define PWM_EPWM_TZOSTCLR_CAPEVT_SHIFT    (0x0008U)
#define PWM_EPWM_TZOSTCLR_CAPEVT_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTCLR_CAPEVT_MAX      (0x0001U)

