TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_TZOSTCLR_RESERVED_1_MASK     (0xFE00U)
#define PWM_EPWM_TZOSTCLR_RESERVED_1_SHIFT    (0x0009U)
#define PWM_EPWM_TZOSTCLR_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TZOSTCLR_RESERVED_1_MAX      (0x007FU)

#define PWM_EPWM_TZOSTCLR_RESETVAL (0x0000U)

/* RESERVED_31 */

#define PWM_EPWM_RESERVED_31_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_31_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_31_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_31_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_31_RESETVAL (0x0000U)

/* TZFRC */

#define PWM_EPWM_TZFRC_RESERVED_1_MASK     (0x0001U)
#define PWM_EPWM_TZFRC_RESERVED_1_SHIFT    (0x0000U)
#define PWM_EPWM_TZFRC_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TZFRC_RESERVED_1_MAX      (0x0001U)

#define PWM_EPWM_TZFRC_CBC_MASK     (0x0002U)
#define PWM_EPWM_TZFRC_CBC_SHIFT    (0x0001U)
#define PWM_EPWM_TZFRC_CBC_RESETVAL (0x0000U)
#define PWM_EPWM_TZFRC_CBC_MAX      (0x0001U)

#define PWM_EPWM_TZFRC_OST_MASK     (0x0004U)
#define PWM_EPWM_TZFRC_OST_SHIFT    (0x0002U)
#define PWM_EPWM_TZFRC_OST_RESETVAL (0x0000U)
#define PWM_EPWM_TZFRC_OST_MAX      (0x0001U)

#define PWM_EPWM_TZFRC_DCAEVT1_MASK     (0x0008U)
#define PWM_EPWM_TZFRC_DCAEVT1_SHIFT    (0x0003U)
#define PWM_EPWM_TZFRC_DCAEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZFRC_DCAEVT1_MAX      (0x0001U)

#define PWM_EPWM_TZFRC_DCAEVT2_MASK     (0x0010U)
#define PWM_EPWM_TZFRC_DCAEVT2_SHIFT    (0x0004U)
#define PWM_EPWM_TZFRC_DCAEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZFRC_DCAEVT2_MAX      (0x0001U)

#define PWM_EPWM_TZFRC_DCBEVT1_MASK     (0x0020U)
#define PWM_EPWM_TZFRC_DCBEVT1_SHIFT    (0x0005U)
#define PWM_EPWM_TZFRC_DCBEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZFRC_DCBEVT1_MAX      (0x0001U)

#define PWM_EPWM_TZFRC_DCBEVT2_MASK     (0x0040U)
#define PWM_EPWM_TZFRC_DCBEVT2_SHIFT    (0x0006U)
#define PWM_EPWM_TZFRC_DCBEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZFRC_DCBEVT2_MAX      (0x0001U)

#define PWM_EPWM_TZFRC_CAPEVT_MASK     (0x0080U)
#define PWM_EPWM_TZFRC_CAPEVT_SHIFT    (0x0007U)
#define PWM_EPWM_TZFRC_CAPEVT_RESETVAL (0x0000U)
#define PWM_EPWM_TZFRC_CAPEVT_MAX      (0x0001U)

#define PWM_EPWM_TZFRC_RESERVED_2_MASK     (0xFF00U)
#define PWM_EPWM_TZFRC_RESERVED_2_SHIFT    (0x0008U)
#define PWM_EPWM_TZFRC_RESERVED_2_RESETVAL (0x0000U)
#define PWM_EPWM_TZFRC_RESERVED_2_MAX      (0x00FFU)

#define PWM_EPWM_TZFRC_RESETVAL (0x0000U)

/* RESERVED_32 */

#define PWM_EPWM_RESERVED_32_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_32_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_32_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_32_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_32_RESETVAL (0x0000U)

/* TZTRIPOUTSEL */

#define PWM_EPWM_TZTRIPOUTSEL_OST_MASK     (0x0001U)
#define PWM_EPWM_TZTRIPOUTSEL_OST_SHIFT    (0x0000U)
#define PWM_EPWM_TZTRIPOUTSEL_OST_RESETVAL (0x0000U)
#define PWM_EPWM_TZTRIPOUTSEL_OST_MAX      (0x0001U)

#define PWM_EPWM_TZTRIPOUTSEL_CBC_MASK     (0x0002U)
#define PWM_EPWM_TZTRIPOUTSEL_CBC_SHIFT    (0x0001U)
#define PWM_EPWM_TZTRIPOUTSEL_CBC_RESETVAL (0x0000U)
#define PWM_EPWM_TZTRIPOUTSEL_CBC_MAX      (0x0001U)

#define PWM_EPWM_TZTRIPOUTSEL_TZ1_MASK     (0x0004U)
#define PWM_EPWM_TZTRIPOUTSEL_TZ1_SHIFT    (0x0002U)
#define PWM_EPWM_TZTRIPOUTSEL_TZ1_RESETVAL (0x0000U)
#define PWM_EPWM_TZTRIPOUTSEL_TZ1_MAX      (0x0001U)

#define PWM_EPWM_TZTRIPOUTSEL_TZ2_MASK     (0x0008U)
#define PWM_EPWM_TZTRIPOUTSEL_TZ2_SHIFT    (0x0003U)
#define PWM_EPWM_TZTRIPOUTSEL_TZ2_RESETVAL (0x0000U)
#define PWM_EPWM_TZTRIPOUTSEL_TZ2_MAX      (0x0001U)

#define PWM_EPWM_TZTRIPOUTSEL_TZ3_MASK     (0x0010U)
#define PWM_EPWM_TZTRIPOUTSEL_TZ3_SHIFT    (0x0004U)
#define PWM_EPWM_TZTRIPOUTSEL_TZ3_RESETVAL (0x0000U)
#define PWM_EPWM_TZTRIPOUTSEL_TZ3_MAX      (0x0001U)

#define PWM_EPWM_TZTRIPOUTSEL_TZ4_MASK     (0x0020U)
#define PWM_EPWM_TZTRIPOUTSEL_TZ4_SHIFT    (0x0005U)
#define PWM_EPWM_TZTRIPOUTSEL_TZ4_RESETVAL (0x0000U)
#define PWM_EPWM_TZTRIPOUTSEL_TZ4_MAX      (0x0001U)

#define PWM_EPWM_TZTRIPOUTSEL_TZ5_MASK     (0x0040U)
#define PWM_EPWM_TZTRIPOUTSEL_TZ5_SHIFT    (0x0006U)
#define PWM_EPWM_TZTRIPOUTSEL_TZ5_RESETVAL (0x0000U)
#define PWM_EPWM_TZTRIPOUTSEL_TZ5_MAX      (0x0001U)

#define PWM_EPWM_TZTRIPOUTSEL_TZ6_MASK     (0x0080U)
#define PWM_EPWM_TZTRIPOUTSEL_TZ6_SHIFT    (0x0007U)
#define PWM_EPWM_TZTRIPOUTSEL_TZ6_RESETVAL (0x0000U)
#define PWM_EPWM_TZTRIPOUTSEL_TZ6_MAX      (0x0001U)

#define PWM_EPWM_TZTRIPOUTSEL_DCAEVT1_MASK     (0x0100U)
#define PWM_EPWM_TZTRIPOUTSEL_DCAEVT1_SHIFT    (0x0008U)
#define PWM_EPWM_TZTRIPOUTSEL_DCAEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZTRIPOUTSEL_DCAEVT1_MAX      (0x0001U)

#define PWM_EPWM_TZTRIPOUTSEL_DCAEVT2_MASK     (0x0200U)
#define PWM_EPWM_TZTRIPOUTSEL_DCAEVT2_SHIFT    (0x0009U)
#define PWM_EPWM_TZTRIPOUTSEL_DCAEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZTRIPOUTSEL_DCAEVT2_MAX      (0x0001U)

#define PWM_EPWM_TZTRIPOUTSEL_DCBEVT1_MASK     (0x0400U)
#define PWM_EPWM_TZTRIPOUTSEL_DCBEVT1_SHIFT    (0x000AU)
#define PWM_EPWM_TZTRIPOUTSEL_DCBEVT1_RESETVAL (0x0000U)
#define PWM_EPWM_TZTRIPOUTSEL_DCBEVT1_MAX      (0x0001U)

#define PWM_EPWM_TZTRIPOUTSEL_DCBEVT2_MASK     (0x0800U)
#define PWM_EPWM_TZTRIPOUTSEL_DCBEVT2_SHIFT    (0x000BU)
#define PWM_EPWM_TZTRIPOUTSEL_DCBEVT2_RESETVAL (0x0000U)
#define PWM_EPWM_TZTRIPOUTSEL_DCBEVT2_MAX      (0x0001U)

#define PWM_EPWM_TZTRIPOUTSEL_CAPEVT_MASK     (0x1000U)
#define PWM_EPWM_TZTRIPOUTSEL_CAPEVT_SHIFT    (0x000CU)
#define PWM_EPWM_TZTRIPOUTSEL_CAPEVT_RESETVAL (0x0000U)
#define PWM_EPWM_TZTRIPOUTSEL_CAPEVT_MAX      (0x0001U)

#define PWM_EPWM_TZTRIPOUTSEL_RESERVED_1_MASK     (0xE000U)
#define PWM_EPWM_TZTRIPOUTSEL_RESERVED_1_SHIFT    (0x000DU)
#define PWM_EPWM_TZTRIPOUTSEL_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_TZTRIPOUTSEL_RESERVED_1_MAX      (0x0007U)

#define PWM_EPWM_TZTRIPOUTSEL_RESETVAL (0x0000U)

/* RESERVED_33 */

#define PWM_EPWM_RESERVED_33_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_33_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_33_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_33_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_33_RESETVAL (0x0000U)

/* ETSEL */

#define PWM_EPWM_ETSEL_INTSEL_MASK     (0x0007U)
#define PWM_EPWM_ETSEL_INTSEL_SHIFT    (0x0000U)
#define PWM_EPWM_ETSEL_INTSEL_RESETVAL (0x0000U)
#define PWM_EPWM_ETSEL_INTSEL_MAX      (0x0007U)

#define PWM_EPWM_ETSEL_INTEN_MASK     (0x0008U)
#define PWM_EPWM_ETSEL_INTEN_SHIFT    (0x0003U)
#define PWM_EPWM_ETSEL_INTEN_RESETVAL (0x0000U)
#define PWM_EPWM_ETSEL_INTEN_MAX      (0x0001U)

#define PWM_EPWM_ETSEL_SOCASELCMP_MASK     (0x0010U)
#define PWM_EPWM_ETSEL_SOCASELCMP_SHIFT    (0x0004U)
#define PWM_EPWM_ETSEL_SOCASELCMP_RESETVAL (0x0000U)
#define PWM_EPWM_ETSEL_SOCASELCMP_MAX      (0x0001U)

