TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_ETSEL_SOCBSELCMP_MASK     (0x0020U)
#define PWM_EPWM_ETSEL_SOCBSELCMP_SHIFT    (0x0005U)
#define PWM_EPWM_ETSEL_SOCBSELCMP_RESETVAL (0x0000U)
#define PWM_EPWM_ETSEL_SOCBSELCMP_MAX      (0x0001U)

#define PWM_EPWM_ETSEL_INTSELCMP_MASK     (0x0040U)
#define PWM_EPWM_ETSEL_INTSELCMP_SHIFT    (0x0006U)
#define PWM_EPWM_ETSEL_INTSELCMP_RESETVAL (0x0000U)
#define PWM_EPWM_ETSEL_INTSELCMP_MAX      (0x0001U)

#define PWM_EPWM_ETSEL_RESERVED_1_MASK     (0x0080U)
#define PWM_EPWM_ETSEL_RESERVED_1_SHIFT    (0x0007U)
#define PWM_EPWM_ETSEL_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_ETSEL_RESERVED_1_MAX      (0x0001U)

#define PWM_EPWM_ETSEL_SOCASEL_MASK     (0x0700U)
#define PWM_EPWM_ETSEL_SOCASEL_SHIFT    (0x0008U)
#define PWM_EPWM_ETSEL_SOCASEL_RESETVAL (0x0000U)
#define PWM_EPWM_ETSEL_SOCASEL_MAX      (0x0007U)

#define PWM_EPWM_ETSEL_SOCAEN_MASK     (0x0800U)
#define PWM_EPWM_ETSEL_SOCAEN_SHIFT    (0x000BU)
#define PWM_EPWM_ETSEL_SOCAEN_RESETVAL (0x0000U)
#define PWM_EPWM_ETSEL_SOCAEN_MAX      (0x0001U)

#define PWM_EPWM_ETSEL_SOCBSEL_MASK     (0x7000U)
#define PWM_EPWM_ETSEL_SOCBSEL_SHIFT    (0x000CU)
#define PWM_EPWM_ETSEL_SOCBSEL_RESETVAL (0x0000U)
#define PWM_EPWM_ETSEL_SOCBSEL_MAX      (0x0007U)

#define PWM_EPWM_ETSEL_SOCBEN_MASK     (0x8000U)
#define PWM_EPWM_ETSEL_SOCBEN_SHIFT    (0x000FU)
#define PWM_EPWM_ETSEL_SOCBEN_RESETVAL (0x0000U)
#define PWM_EPWM_ETSEL_SOCBEN_MAX      (0x0001U)

#define PWM_EPWM_ETSEL_RESETVAL (0x0000U)

/* RESERVED_34 */

#define PWM_EPWM_RESERVED_34_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_34_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_34_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_34_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_34_RESETVAL (0x0000U)

/* ETPS */

#define PWM_EPWM_ETPS_INTPRD_MASK     (0x0003U)
#define PWM_EPWM_ETPS_INTPRD_SHIFT    (0x0000U)
#define PWM_EPWM_ETPS_INTPRD_RESETVAL (0x0000U)
#define PWM_EPWM_ETPS_INTPRD_MAX      (0x0003U)

#define PWM_EPWM_ETPS_INTCNT_MASK     (0x000CU)
#define PWM_EPWM_ETPS_INTCNT_SHIFT    (0x0002U)
#define PWM_EPWM_ETPS_INTCNT_RESETVAL (0x0000U)
#define PWM_EPWM_ETPS_INTCNT_MAX      (0x0003U)

#define PWM_EPWM_ETPS_INTPSSEL_MASK     (0x0010U)
#define PWM_EPWM_ETPS_INTPSSEL_SHIFT    (0x0004U)
#define PWM_EPWM_ETPS_INTPSSEL_RESETVAL (0x0000U)
#define PWM_EPWM_ETPS_INTPSSEL_MAX      (0x0001U)

#define PWM_EPWM_ETPS_SOCPSSEL_MASK     (0x0020U)
#define PWM_EPWM_ETPS_SOCPSSEL_SHIFT    (0x0005U)
#define PWM_EPWM_ETPS_SOCPSSEL_RESETVAL (0x0000U)
#define PWM_EPWM_ETPS_SOCPSSEL_MAX      (0x0001U)

#define PWM_EPWM_ETPS_RESERVED_1_MASK     (0x00C0U)
#define PWM_EPWM_ETPS_RESERVED_1_SHIFT    (0x0006U)
#define PWM_EPWM_ETPS_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_ETPS_RESERVED_1_MAX      (0x0003U)

#define PWM_EPWM_ETPS_SOCAPRD_MASK     (0x0300U)
#define PWM_EPWM_ETPS_SOCAPRD_SHIFT    (0x0008U)
#define PWM_EPWM_ETPS_SOCAPRD_RESETVAL (0x0000U)
#define PWM_EPWM_ETPS_SOCAPRD_MAX      (0x0003U)

#define PWM_EPWM_ETPS_SOCACNT_MASK     (0x0C00U)
#define PWM_EPWM_ETPS_SOCACNT_SHIFT    (0x000AU)
#define PWM_EPWM_ETPS_SOCACNT_RESETVAL (0x0000U)
#define PWM_EPWM_ETPS_SOCACNT_MAX      (0x0003U)

#define PWM_EPWM_ETPS_SOCBPRD_MASK     (0x3000U)
#define PWM_EPWM_ETPS_SOCBPRD_SHIFT    (0x000CU)
#define PWM_EPWM_ETPS_SOCBPRD_RESETVAL (0x0000U)
#define PWM_EPWM_ETPS_SOCBPRD_MAX      (0x0003U)

#define PWM_EPWM_ETPS_SOCBCNT_MASK     (0xC000U)
#define PWM_EPWM_ETPS_SOCBCNT_SHIFT    (0x000EU)
#define PWM_EPWM_ETPS_SOCBCNT_RESETVAL (0x0000U)
#define PWM_EPWM_ETPS_SOCBCNT_MAX      (0x0003U)

#define PWM_EPWM_ETPS_RESETVAL (0x0000U)

/* RESERVED_35 */

#define PWM_EPWM_RESERVED_35_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_35_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_35_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_35_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_35_RESETVAL (0x0000U)

/* ETFLG */

#define PWM_EPWM_ETFLG_INT_MASK     (0x0001U)
#define PWM_EPWM_ETFLG_INT_SHIFT    (0x0000U)
#define PWM_EPWM_ETFLG_INT_RESETVAL (0x0000U)
#define PWM_EPWM_ETFLG_INT_MAX      (0x0001U)

#define PWM_EPWM_ETFLG_RESERVED_1_MASK     (0x0002U)
#define PWM_EPWM_ETFLG_RESERVED_1_SHIFT    (0x0001U)
#define PWM_EPWM_ETFLG_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_ETFLG_RESERVED_1_MAX      (0x0001U)

#define PWM_EPWM_ETFLG_SOCA_MASK     (0x0004U)
#define PWM_EPWM_ETFLG_SOCA_SHIFT    (0x0002U)
#define PWM_EPWM_ETFLG_SOCA_RESETVAL (0x0000U)
#define PWM_EPWM_ETFLG_SOCA_MAX      (0x0001U)

#define PWM_EPWM_ETFLG_SOCB_MASK     (0x0008U)
#define PWM_EPWM_ETFLG_SOCB_SHIFT    (0x0003U)
#define PWM_EPWM_ETFLG_SOCB_RESETVAL (0x0000U)
#define PWM_EPWM_ETFLG_SOCB_MAX      (0x0001U)

#define PWM_EPWM_ETFLG_RESERVED_2_MASK     (0xFFF0U)
#define PWM_EPWM_ETFLG_RESERVED_2_SHIFT    (0x0004U)
#define PWM_EPWM_ETFLG_RESERVED_2_RESETVAL (0x0000U)
#define PWM_EPWM_ETFLG_RESERVED_2_MAX      (0x0FFFU)

#define PWM_EPWM_ETFLG_RESETVAL (0x0000U)

/* RESERVED_36 */

#define PWM_EPWM_RESERVED_36_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_36_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_36_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_36_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_36_RESETVAL (0x0000U)

/* ETCLR */

#define PWM_EPWM_ETCLR_INT_MASK     (0x0001U)
#define PWM_EPWM_ETCLR_INT_SHIFT    (0x0000U)
#define PWM_EPWM_ETCLR_INT_RESETVAL (0x0000U)
#define PWM_EPWM_ETCLR_INT_MAX      (0x0001U)

#define PWM_EPWM_ETCLR_RESERVED_1_MASK     (0x0002U)
#define PWM_EPWM_ETCLR_RESERVED_1_SHIFT    (0x0001U)
#define PWM_EPWM_ETCLR_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_ETCLR_RESERVED_1_MAX      (0x0001U)

#define PWM_EPWM_ETCLR_SOCA_MASK     (0x0004U)
#define PWM_EPWM_ETCLR_SOCA_SHIFT    (0x0002U)
#define PWM_EPWM_ETCLR_SOCA_RESETVAL (0x0000U)
#define PWM_EPWM_ETCLR_SOCA_MAX      (0x0001U)

#define PWM_EPWM_ETCLR_SOCB_MASK     (0x0008U)
#define PWM_EPWM_ETCLR_SOCB_SHIFT    (0x0003U)
#define PWM_EPWM_ETCLR_SOCB_RESETVAL (0x0000U)
#define PWM_EPWM_ETCLR_SOCB_MAX      (0x0001U)

#define PWM_EPWM_ETCLR_RESERVED_2_MASK     (0xFFF0U)
#define PWM_EPWM_ETCLR_RESERVED_2_SHIFT    (0x0004U)
#define PWM_EPWM_ETCLR_RESERVED_2_RESETVAL (0x0000U)
#define PWM_EPWM_ETCLR_RESERVED_2_MAX      (0x0FFFU)

