TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_DCACTL_RESERVED_1_MASK     (0x0C00U)
#define PWM_EPWM_DCACTL_RESERVED_1_SHIFT    (0x000AU)
#define PWM_EPWM_DCACTL_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_DCACTL_RESERVED_1_MAX      (0x0003U)

#define PWM_EPWM_DCACTL_EVT2LATSEL_MASK     (0x1000U)
#define PWM_EPWM_DCACTL_EVT2LATSEL_SHIFT    (0x000CU)
#define PWM_EPWM_DCACTL_EVT2LATSEL_RESETVAL (0x0000U)
#define PWM_EPWM_DCACTL_EVT2LATSEL_MAX      (0x0001U)

#define PWM_EPWM_DCACTL_EVT2LATCLRSEL_MASK     (0x6000U)
#define PWM_EPWM_DCACTL_EVT2LATCLRSEL_SHIFT    (0x000DU)
#define PWM_EPWM_DCACTL_EVT2LATCLRSEL_RESETVAL (0x0000U)
#define PWM_EPWM_DCACTL_EVT2LATCLRSEL_MAX      (0x0003U)

#define PWM_EPWM_DCACTL_EVT2LAT_MASK     (0x8000U)
#define PWM_EPWM_DCACTL_EVT2LAT_SHIFT    (0x000FU)
#define PWM_EPWM_DCACTL_EVT2LAT_RESETVAL (0x0000U)
#define PWM_EPWM_DCACTL_EVT2LAT_MAX      (0x0001U)

#define PWM_EPWM_DCACTL_RESETVAL (0x0000U)

/* DCBCTL */

#define PWM_EPWM_DCBCTL_EVT1SRCSEL_MASK     (0x0001U)
#define PWM_EPWM_DCBCTL_EVT1SRCSEL_SHIFT    (0x0000U)
#define PWM_EPWM_DCBCTL_EVT1SRCSEL_RESETVAL (0x0000U)
#define PWM_EPWM_DCBCTL_EVT1SRCSEL_MAX      (0x0001U)

#define PWM_EPWM_DCBCTL_EVT1FRCSYNCSEL_MASK     (0x0002U)
#define PWM_EPWM_DCBCTL_EVT1FRCSYNCSEL_SHIFT    (0x0001U)
#define PWM_EPWM_DCBCTL_EVT1FRCSYNCSEL_RESETVAL (0x0000U)
#define PWM_EPWM_DCBCTL_EVT1FRCSYNCSEL_MAX      (0x0001U)

#define PWM_EPWM_DCBCTL_EVT1SOCE_MASK     (0x0004U)
#define PWM_EPWM_DCBCTL_EVT1SOCE_SHIFT    (0x0002U)
#define PWM_EPWM_DCBCTL_EVT1SOCE_RESETVAL (0x0000U)
#define PWM_EPWM_DCBCTL_EVT1SOCE_MAX      (0x0001U)

#define PWM_EPWM_DCBCTL_EVT1SYNCE_MASK     (0x0008U)
#define PWM_EPWM_DCBCTL_EVT1SYNCE_SHIFT    (0x0003U)
#define PWM_EPWM_DCBCTL_EVT1SYNCE_RESETVAL (0x0000U)
#define PWM_EPWM_DCBCTL_EVT1SYNCE_MAX      (0x0001U)

#define PWM_EPWM_DCBCTL_EVT1LATSEL_MASK     (0x0010U)
#define PWM_EPWM_DCBCTL_EVT1LATSEL_SHIFT    (0x0004U)
#define PWM_EPWM_DCBCTL_EVT1LATSEL_RESETVAL (0x0000U)
#define PWM_EPWM_DCBCTL_EVT1LATSEL_MAX      (0x0001U)

#define PWM_EPWM_DCBCTL_EVT1LATCLRSEL_MASK     (0x0060U)
#define PWM_EPWM_DCBCTL_EVT1LATCLRSEL_SHIFT    (0x0005U)
#define PWM_EPWM_DCBCTL_EVT1LATCLRSEL_RESETVAL (0x0000U)
#define PWM_EPWM_DCBCTL_EVT1LATCLRSEL_MAX      (0x0003U)

#define PWM_EPWM_DCBCTL_EVT1LAT_MASK     (0x0080U)
#define PWM_EPWM_DCBCTL_EVT1LAT_SHIFT    (0x0007U)
#define PWM_EPWM_DCBCTL_EVT1LAT_RESETVAL (0x0000U)
#define PWM_EPWM_DCBCTL_EVT1LAT_MAX      (0x0001U)

#define PWM_EPWM_DCBCTL_EVT2SRCSEL_MASK     (0x0100U)
#define PWM_EPWM_DCBCTL_EVT2SRCSEL_SHIFT    (0x0008U)
#define PWM_EPWM_DCBCTL_EVT2SRCSEL_RESETVAL (0x0000U)
#define PWM_EPWM_DCBCTL_EVT2SRCSEL_MAX      (0x0001U)

#define PWM_EPWM_DCBCTL_EVT2FRCSYNCSEL_MASK     (0x0200U)
#define PWM_EPWM_DCBCTL_EVT2FRCSYNCSEL_SHIFT    (0x0009U)
#define PWM_EPWM_DCBCTL_EVT2FRCSYNCSEL_RESETVAL (0x0000U)
#define PWM_EPWM_DCBCTL_EVT2FRCSYNCSEL_MAX      (0x0001U)

#define PWM_EPWM_DCBCTL_RESERVED_1_MASK     (0x0C00U)
#define PWM_EPWM_DCBCTL_RESERVED_1_SHIFT    (0x000AU)
#define PWM_EPWM_DCBCTL_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_DCBCTL_RESERVED_1_MAX      (0x0003U)

#define PWM_EPWM_DCBCTL_EVT2LATSEL_MASK     (0x1000U)
#define PWM_EPWM_DCBCTL_EVT2LATSEL_SHIFT    (0x000CU)
#define PWM_EPWM_DCBCTL_EVT2LATSEL_RESETVAL (0x0000U)
#define PWM_EPWM_DCBCTL_EVT2LATSEL_MAX      (0x0001U)

#define PWM_EPWM_DCBCTL_EVT2LATCLRSEL_MASK     (0x6000U)
#define PWM_EPWM_DCBCTL_EVT2LATCLRSEL_SHIFT    (0x000DU)
#define PWM_EPWM_DCBCTL_EVT2LATCLRSEL_RESETVAL (0x0000U)
#define PWM_EPWM_DCBCTL_EVT2LATCLRSEL_MAX      (0x0003U)

#define PWM_EPWM_DCBCTL_EVT2LAT_MASK     (0x8000U)
#define PWM_EPWM_DCBCTL_EVT2LAT_SHIFT    (0x000FU)
#define PWM_EPWM_DCBCTL_EVT2LAT_RESETVAL (0x0000U)
#define PWM_EPWM_DCBCTL_EVT2LAT_MAX      (0x0001U)

#define PWM_EPWM_DCBCTL_RESETVAL (0x0000U)

/* RESERVED_47 */

#define PWM_EPWM_RESERVED_47_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_47_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_47_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_47_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_47_RESETVAL (0x0000U)

/* DCFCTL */

#define PWM_EPWM_DCFCTL_SRCSEL_MASK     (0x0003U)
#define PWM_EPWM_DCFCTL_SRCSEL_SHIFT    (0x0000U)
#define PWM_EPWM_DCFCTL_SRCSEL_RESETVAL (0x0000U)
#define PWM_EPWM_DCFCTL_SRCSEL_MAX      (0x0003U)

#define PWM_EPWM_DCFCTL_BLANKE_MASK     (0x0004U)
#define PWM_EPWM_DCFCTL_BLANKE_SHIFT    (0x0002U)
#define PWM_EPWM_DCFCTL_BLANKE_RESETVAL (0x0000U)
#define PWM_EPWM_DCFCTL_BLANKE_MAX      (0x0001U)

#define PWM_EPWM_DCFCTL_BLANKINV_MASK     (0x0008U)
#define PWM_EPWM_DCFCTL_BLANKINV_SHIFT    (0x0003U)
#define PWM_EPWM_DCFCTL_BLANKINV_RESETVAL (0x0000U)
#define PWM_EPWM_DCFCTL_BLANKINV_MAX      (0x0001U)

#define PWM_EPWM_DCFCTL_PULSESEL_MASK     (0x0030U)
#define PWM_EPWM_DCFCTL_PULSESEL_SHIFT    (0x0004U)
#define PWM_EPWM_DCFCTL_PULSESEL_RESETVAL (0x0000U)
#define PWM_EPWM_DCFCTL_PULSESEL_MAX      (0x0003U)

#define PWM_EPWM_DCFCTL_EDGEFILTSEL_MASK     (0x0040U)
#define PWM_EPWM_DCFCTL_EDGEFILTSEL_SHIFT    (0x0006U)
#define PWM_EPWM_DCFCTL_EDGEFILTSEL_RESETVAL (0x0000U)
#define PWM_EPWM_DCFCTL_EDGEFILTSEL_MAX      (0x0001U)

#define PWM_EPWM_DCFCTL_RESERVED_1_MASK     (0x0080U)
#define PWM_EPWM_DCFCTL_RESERVED_1_SHIFT    (0x0007U)
#define PWM_EPWM_DCFCTL_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_DCFCTL_RESERVED_1_MAX      (0x0001U)

#define PWM_EPWM_DCFCTL_EDGEMODE_MASK     (0x0300U)
#define PWM_EPWM_DCFCTL_EDGEMODE_SHIFT    (0x0008U)
#define PWM_EPWM_DCFCTL_EDGEMODE_RESETVAL (0x0000U)
#define PWM_EPWM_DCFCTL_EDGEMODE_MAX      (0x0003U)

#define PWM_EPWM_DCFCTL_EDGECOUNT_MASK     (0x1C00U)
#define PWM_EPWM_DCFCTL_EDGECOUNT_SHIFT    (0x000AU)
#define PWM_EPWM_DCFCTL_EDGECOUNT_RESETVAL (0x0000U)
#define PWM_EPWM_DCFCTL_EDGECOUNT_MAX      (0x0007U)

#define PWM_EPWM_DCFCTL_EDGESTATUS_MASK     (0xE000U)
#define PWM_EPWM_DCFCTL_EDGESTATUS_SHIFT    (0x000DU)
#define PWM_EPWM_DCFCTL_EDGESTATUS_RESETVAL (0x0000U)
#define PWM_EPWM_DCFCTL_EDGESTATUS_MAX      (0x0007U)

#define PWM_EPWM_DCFCTL_RESETVAL (0x0000U)

/* DCCAPCTL */

#define PWM_EPWM_DCCAPCTL_CAPE_MASK     (0x0001U)
#define PWM_EPWM_DCCAPCTL_CAPE_SHIFT    (0x0000U)
#define PWM_EPWM_DCCAPCTL_CAPE_RESETVAL (0x0000U)
#define PWM_EPWM_DCCAPCTL_CAPE_MAX      (0x0001U)

#define PWM_EPWM_DCCAPCTL_SHDWMODE_MASK     (0x0002U)
#define PWM_EPWM_DCCAPCTL_SHDWMODE_SHIFT    (0x0001U)
#define PWM_EPWM_DCCAPCTL_SHDWMODE_RESETVAL (0x0000U)
#define PWM_EPWM_DCCAPCTL_SHDWMODE_MAX      (0x0001U)

#define PWM_EPWM_DCCAPCTL_RESERVED_1_MASK     (0x1FFCU)
#define PWM_EPWM_DCCAPCTL_RESERVED_1_SHIFT    (0x0002U)
#define PWM_EPWM_DCCAPCTL_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_DCCAPCTL_RESERVED_1_MAX      (0x07FFU)

