TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_DCCAPCTL_CAPSTS_MASK     (0x2000U)
#define PWM_EPWM_DCCAPCTL_CAPSTS_SHIFT    (0x000DU)
#define PWM_EPWM_DCCAPCTL_CAPSTS_RESETVAL (0x0000U)
#define PWM_EPWM_DCCAPCTL_CAPSTS_MAX      (0x0001U)

#define PWM_EPWM_DCCAPCTL_CAPCLR_MASK     (0x4000U)
#define PWM_EPWM_DCCAPCTL_CAPCLR_SHIFT    (0x000EU)
#define PWM_EPWM_DCCAPCTL_CAPCLR_RESETVAL (0x0000U)
#define PWM_EPWM_DCCAPCTL_CAPCLR_MAX      (0x0001U)

#define PWM_EPWM_DCCAPCTL_CAPMODE_MASK     (0x8000U)
#define PWM_EPWM_DCCAPCTL_CAPMODE_SHIFT    (0x000FU)
#define PWM_EPWM_DCCAPCTL_CAPMODE_RESETVAL (0x0000U)
#define PWM_EPWM_DCCAPCTL_CAPMODE_MAX      (0x0001U)

#define PWM_EPWM_DCCAPCTL_RESETVAL (0x0000U)

/* DCFOFFSET */

#define PWM_EPWM_DCFOFFSET_DCFOFFSET_MASK     (0xFFFFU)
#define PWM_EPWM_DCFOFFSET_DCFOFFSET_SHIFT    (0x0000U)
#define PWM_EPWM_DCFOFFSET_DCFOFFSET_RESETVAL (0x0000U)
#define PWM_EPWM_DCFOFFSET_DCFOFFSET_MAX      (0xFFFFU)

#define PWM_EPWM_DCFOFFSET_RESETVAL (0x0000U)

/* DCFOFFSETCNT */

#define PWM_EPWM_DCFOFFSETCNT_DCFOFFSETCNT_MASK     (0xFFFFU)
#define PWM_EPWM_DCFOFFSETCNT_DCFOFFSETCNT_SHIFT    (0x0000U)
#define PWM_EPWM_DCFOFFSETCNT_DCFOFFSETCNT_RESETVAL (0x0000U)
#define PWM_EPWM_DCFOFFSETCNT_DCFOFFSETCNT_MAX      (0xFFFFU)

#define PWM_EPWM_DCFOFFSETCNT_RESETVAL (0x0000U)

/* DCFWINDOW */

#define PWM_EPWM_DCFWINDOW_DCFWINDOW_MASK     (0xFFFFU)
#define PWM_EPWM_DCFWINDOW_DCFWINDOW_SHIFT    (0x0000U)
#define PWM_EPWM_DCFWINDOW_DCFWINDOW_RESETVAL (0x0000U)
#define PWM_EPWM_DCFWINDOW_DCFWINDOW_MAX      (0xFFFFU)

#define PWM_EPWM_DCFWINDOW_RESETVAL (0x0000U)

/* DCFWINDOWCNT */

#define PWM_EPWM_DCFWINDOWCNT_DCFWINDOWCNT_MASK     (0xFFFFU)
#define PWM_EPWM_DCFWINDOWCNT_DCFWINDOWCNT_SHIFT    (0x0000U)
#define PWM_EPWM_DCFWINDOWCNT_DCFWINDOWCNT_RESETVAL (0x0000U)
#define PWM_EPWM_DCFWINDOWCNT_DCFWINDOWCNT_MAX      (0xFFFFU)

#define PWM_EPWM_DCFWINDOWCNT_RESETVAL (0x0000U)

/* BLANKPULSEMIXSEL */

#define PWM_EPWM_BLANKPULSEMIXSEL_ZRO_MASK     (0x0001U)
#define PWM_EPWM_BLANKPULSEMIXSEL_ZRO_SHIFT    (0x0000U)
#define PWM_EPWM_BLANKPULSEMIXSEL_ZRO_RESETVAL (0x0000U)
#define PWM_EPWM_BLANKPULSEMIXSEL_ZRO_MAX      (0x0001U)

#define PWM_EPWM_BLANKPULSEMIXSEL_PRD_MASK     (0x0002U)
#define PWM_EPWM_BLANKPULSEMIXSEL_PRD_SHIFT    (0x0001U)
#define PWM_EPWM_BLANKPULSEMIXSEL_PRD_RESETVAL (0x0000U)
#define PWM_EPWM_BLANKPULSEMIXSEL_PRD_MAX      (0x0001U)

#define PWM_EPWM_BLANKPULSEMIXSEL_CAU_MASK     (0x0004U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CAU_SHIFT    (0x0002U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CAU_RESETVAL (0x0000U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CAU_MAX      (0x0001U)

#define PWM_EPWM_BLANKPULSEMIXSEL_CAD_MASK     (0x0008U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CAD_SHIFT    (0x0003U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CAD_RESETVAL (0x0000U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CAD_MAX      (0x0001U)

#define PWM_EPWM_BLANKPULSEMIXSEL_CBU_MASK     (0x0010U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CBU_SHIFT    (0x0004U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CBU_RESETVAL (0x0000U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CBU_MAX      (0x0001U)

#define PWM_EPWM_BLANKPULSEMIXSEL_CBD_MASK     (0x0020U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CBD_SHIFT    (0x0005U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CBD_RESETVAL (0x0000U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CBD_MAX      (0x0001U)

#define PWM_EPWM_BLANKPULSEMIXSEL_CCU_MASK     (0x0040U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CCU_SHIFT    (0x0006U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CCU_RESETVAL (0x0000U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CCU_MAX      (0x0001U)

#define PWM_EPWM_BLANKPULSEMIXSEL_CCD_MASK     (0x0080U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CCD_SHIFT    (0x0007U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CCD_RESETVAL (0x0000U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CCD_MAX      (0x0001U)

#define PWM_EPWM_BLANKPULSEMIXSEL_CDU_MASK     (0x0100U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CDU_SHIFT    (0x0008U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CDU_RESETVAL (0x0000U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CDU_MAX      (0x0001U)

#define PWM_EPWM_BLANKPULSEMIXSEL_CDD_MASK     (0x0200U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CDD_SHIFT    (0x0009U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CDD_RESETVAL (0x0000U)
#define PWM_EPWM_BLANKPULSEMIXSEL_CDD_MAX      (0x0001U)

#define PWM_EPWM_BLANKPULSEMIXSEL_RESERVED_1_MASK     (0xFC00U)
#define PWM_EPWM_BLANKPULSEMIXSEL_RESERVED_1_SHIFT    (0x000AU)
#define PWM_EPWM_BLANKPULSEMIXSEL_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_BLANKPULSEMIXSEL_RESERVED_1_MAX      (0x003FU)

#define PWM_EPWM_BLANKPULSEMIXSEL_RESETVAL (0x0000U)

/* DCCAPMIXSEL */

#define PWM_EPWM_DCCAPMIXSEL_ZRO_MASK     (0x0001U)
#define PWM_EPWM_DCCAPMIXSEL_ZRO_SHIFT    (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_ZRO_RESETVAL (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_ZRO_MAX      (0x0001U)

#define PWM_EPWM_DCCAPMIXSEL_PRD_MASK     (0x0002U)
#define PWM_EPWM_DCCAPMIXSEL_PRD_SHIFT    (0x0001U)
#define PWM_EPWM_DCCAPMIXSEL_PRD_RESETVAL (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_PRD_MAX      (0x0001U)

#define PWM_EPWM_DCCAPMIXSEL_CAU_MASK     (0x0004U)
#define PWM_EPWM_DCCAPMIXSEL_CAU_SHIFT    (0x0002U)
#define PWM_EPWM_DCCAPMIXSEL_CAU_RESETVAL (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_CAU_MAX      (0x0001U)

#define PWM_EPWM_DCCAPMIXSEL_CAD_MASK     (0x0008U)
#define PWM_EPWM_DCCAPMIXSEL_CAD_SHIFT    (0x0003U)
#define PWM_EPWM_DCCAPMIXSEL_CAD_RESETVAL (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_CAD_MAX      (0x0001U)

#define PWM_EPWM_DCCAPMIXSEL_CBU_MASK     (0x0010U)
#define PWM_EPWM_DCCAPMIXSEL_CBU_SHIFT    (0x0004U)
#define PWM_EPWM_DCCAPMIXSEL_CBU_RESETVAL (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_CBU_MAX      (0x0001U)

#define PWM_EPWM_DCCAPMIXSEL_CBD_MASK     (0x0020U)
#define PWM_EPWM_DCCAPMIXSEL_CBD_SHIFT    (0x0005U)
#define PWM_EPWM_DCCAPMIXSEL_CBD_RESETVAL (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_CBD_MAX      (0x0001U)

#define PWM_EPWM_DCCAPMIXSEL_CCU_MASK     (0x0040U)
#define PWM_EPWM_DCCAPMIXSEL_CCU_SHIFT    (0x0006U)
#define PWM_EPWM_DCCAPMIXSEL_CCU_RESETVAL (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_CCU_MAX      (0x0001U)

#define PWM_EPWM_DCCAPMIXSEL_CCD_MASK     (0x0080U)
#define PWM_EPWM_DCCAPMIXSEL_CCD_SHIFT    (0x0007U)
#define PWM_EPWM_DCCAPMIXSEL_CCD_RESETVAL (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_CCD_MAX      (0x0001U)

#define PWM_EPWM_DCCAPMIXSEL_CDU_MASK     (0x0100U)
#define PWM_EPWM_DCCAPMIXSEL_CDU_SHIFT    (0x0008U)
#define PWM_EPWM_DCCAPMIXSEL_CDU_RESETVAL (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_CDU_MAX      (0x0001U)

