TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
/* RESERVED_49 */

#define PWM_EPWM_RESERVED_49_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_49_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_49_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_49_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_49_RESETVAL (0x0000U)

/* SPARE1 */

#define PWM_EPWM_SPARE1_SPARE1_BITS_MASK     (0x00FFU)
#define PWM_EPWM_SPARE1_SPARE1_BITS_SHIFT    (0x0000U)
#define PWM_EPWM_SPARE1_SPARE1_BITS_RESETVAL (0x0000U)
#define PWM_EPWM_SPARE1_SPARE1_BITS_MAX      (0x00FFU)

#define PWM_EPWM_SPARE1_RESERVED_1_MASK     (0xFF00U)
#define PWM_EPWM_SPARE1_RESERVED_1_SHIFT    (0x0008U)
#define PWM_EPWM_SPARE1_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_SPARE1_RESERVED_1_MAX      (0x00FFU)

#define PWM_EPWM_SPARE1_RESETVAL (0x0000U)

/* RESERVED_50 */

#define PWM_EPWM_RESERVED_50_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_50_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_50_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_50_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_50_RESETVAL (0x0000U)

/* SPARE2 */

#define PWM_EPWM_SPARE2_SPARE2_BITS_MASK     (0x00FFU)
#define PWM_EPWM_SPARE2_SPARE2_BITS_SHIFT    (0x0000U)
#define PWM_EPWM_SPARE2_SPARE2_BITS_RESETVAL (0x0000U)
#define PWM_EPWM_SPARE2_SPARE2_BITS_MAX      (0x00FFU)

#define PWM_EPWM_SPARE2_RESERVED_1_MASK     (0xFF00U)
#define PWM_EPWM_SPARE2_RESERVED_1_SHIFT    (0x0008U)
#define PWM_EPWM_SPARE2_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_SPARE2_RESERVED_1_MAX      (0x00FFU)

#define PWM_EPWM_SPARE2_RESETVAL (0x0000U)

/* RESERVED_51 */

#define PWM_EPWM_RESERVED_51_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_51_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_51_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_51_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_51_RESETVAL (0x0000U)

/* EPWMLOCK */

#define PWM_EPWM_EPWMLOCK_HRLOCK_MASK     (0x00000001U)
#define PWM_EPWM_EPWMLOCK_HRLOCK_SHIFT    (0x00000000U)
#define PWM_EPWM_EPWMLOCK_HRLOCK_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMLOCK_HRLOCK_MAX      (0x00000001U)

#define PWM_EPWM_EPWMLOCK_GLLOCK_MASK     (0x00000002U)
#define PWM_EPWM_EPWMLOCK_GLLOCK_SHIFT    (0x00000001U)
#define PWM_EPWM_EPWMLOCK_GLLOCK_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMLOCK_GLLOCK_MAX      (0x00000001U)

#define PWM_EPWM_EPWMLOCK_TZCFGLOCK_MASK     (0x00000004U)
#define PWM_EPWM_EPWMLOCK_TZCFGLOCK_SHIFT    (0x00000002U)
#define PWM_EPWM_EPWMLOCK_TZCFGLOCK_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMLOCK_TZCFGLOCK_MAX      (0x00000001U)

#define PWM_EPWM_EPWMLOCK_TZCLRLOCK_MASK     (0x00000008U)
#define PWM_EPWM_EPWMLOCK_TZCLRLOCK_SHIFT    (0x00000003U)
#define PWM_EPWM_EPWMLOCK_TZCLRLOCK_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMLOCK_TZCLRLOCK_MAX      (0x00000001U)

#define PWM_EPWM_EPWMLOCK_DCLOCK_MASK     (0x00000010U)
#define PWM_EPWM_EPWMLOCK_DCLOCK_SHIFT    (0x00000004U)
#define PWM_EPWM_EPWMLOCK_DCLOCK_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMLOCK_DCLOCK_MAX      (0x00000001U)

#define PWM_EPWM_EPWMLOCK_RESERVED_1_MASK     (0x0000FFE0U)
#define PWM_EPWM_EPWMLOCK_RESERVED_1_SHIFT    (0x00000005U)
#define PWM_EPWM_EPWMLOCK_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMLOCK_RESERVED_1_MAX      (0x000007FFU)

#define PWM_EPWM_EPWMLOCK_KEY_MASK     (0xFFFF0000U)
#define PWM_EPWM_EPWMLOCK_KEY_SHIFT    (0x00000010U)
#define PWM_EPWM_EPWMLOCK_KEY_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMLOCK_KEY_MAX      (0x0000FFFFU)

#define PWM_EPWM_EPWMLOCK_RESETVAL (0x00000000U)

/* RESERVED_52 */

#define PWM_EPWM_RESERVED_52_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_52_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_52_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_52_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_52_RESETVAL (0x0000U)

/* HWVDELVAL */

#define PWM_EPWM_HWVDELVAL_HWVDELVAL_MASK     (0xFFFFU)
#define PWM_EPWM_HWVDELVAL_HWVDELVAL_SHIFT    (0x0000U)
#define PWM_EPWM_HWVDELVAL_HWVDELVAL_RESETVAL (0x0000U)
#define PWM_EPWM_HWVDELVAL_HWVDELVAL_MAX      (0xFFFFU)

#define PWM_EPWM_HWVDELVAL_RESETVAL (0x0000U)

/* VCNTVAL */

#define PWM_EPWM_VCNTVAL_VCNTVAL_MASK     (0xFFFFU)
#define PWM_EPWM_VCNTVAL_VCNTVAL_SHIFT    (0x0000U)
#define PWM_EPWM_VCNTVAL_VCNTVAL_RESETVAL (0x0000U)
#define PWM_EPWM_VCNTVAL_VCNTVAL_MAX      (0xFFFFU)

#define PWM_EPWM_VCNTVAL_RESETVAL (0x0000U)

/* RESERVED_53 */

#define PWM_EPWM_RESERVED_53_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_53_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_53_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_53_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_53_RESETVAL (0x0000U)

/* XCMPCTL1 */

#define PWM_EPWM_XCMPCTL1_XCMPEN_MASK     (0x00000001U)
#define PWM_EPWM_XCMPCTL1_XCMPEN_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMPCTL1_XCMPEN_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMPCTL1_XCMPEN_MAX      (0x00000001U)

#define PWM_EPWM_XCMPCTL1_XCMPSPLIT_MASK     (0x00000002U)
#define PWM_EPWM_XCMPCTL1_XCMPSPLIT_SHIFT    (0x00000001U)
#define PWM_EPWM_XCMPCTL1_XCMPSPLIT_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMPCTL1_XCMPSPLIT_MAX      (0x00000001U)

#define PWM_EPWM_XCMPCTL1_RESERVED_1_MASK     (0x0000000CU)
#define PWM_EPWM_XCMPCTL1_RESERVED_1_SHIFT    (0x00000002U)
#define PWM_EPWM_XCMPCTL1_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMPCTL1_RESERVED_1_MAX      (0x00000003U)

#define PWM_EPWM_XCMPCTL1_XCMPA_ALLOC_MASK     (0x000000F0U)
#define PWM_EPWM_XCMPCTL1_XCMPA_ALLOC_SHIFT    (0x00000004U)
#define PWM_EPWM_XCMPCTL1_XCMPA_ALLOC_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMPCTL1_XCMPA_ALLOC_MAX      (0x0000000FU)

#define PWM_EPWM_XCMPCTL1_XCMPB_ALLOC_MASK     (0x00000F00U)
#define PWM_EPWM_XCMPCTL1_XCMPB_ALLOC_SHIFT    (0x00000008U)
#define PWM_EPWM_XCMPCTL1_XCMPB_ALLOC_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMPCTL1_XCMPB_ALLOC_MAX      (0x0000000FU)

#define PWM_EPWM_XCMPCTL1_RESERVED_2_MASK     (0xFFFFF000U)
#define PWM_EPWM_XCMPCTL1_RESERVED_2_SHIFT    (0x0000000CU)
#define PWM_EPWM_XCMPCTL1_RESERVED_2_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMPCTL1_RESERVED_2_MAX      (0x000FFFFFU)

#define PWM_EPWM_XCMPCTL1_RESETVAL (0x00000000U)

/* RESERVED_54 */

#define PWM_EPWM_RESERVED_54_UNNAMED_MASK     (0x00000001U)
#define PWM_EPWM_RESERVED_54_UNNAMED_SHIFT    (0x00000000U)
#define PWM_EPWM_RESERVED_54_UNNAMED_RESETVAL (0x00000000U)
#define PWM_EPWM_RESERVED_54_UNNAMED_MAX      (0x00000001U)

