TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_RESERVED_54_RESETVAL (0x00000000U)

/* XLOADCTL */

#define PWM_EPWM_XLOADCTL_RESERVED_1_MASK     (0x00000003U)
#define PWM_EPWM_XLOADCTL_RESERVED_1_SHIFT    (0x00000000U)
#define PWM_EPWM_XLOADCTL_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOADCTL_RESERVED_1_MAX      (0x00000003U)

#define PWM_EPWM_XLOADCTL_LOADMODE_MASK     (0x00000004U)
#define PWM_EPWM_XLOADCTL_LOADMODE_SHIFT    (0x00000002U)
#define PWM_EPWM_XLOADCTL_LOADMODE_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOADCTL_LOADMODE_MAX      (0x00000001U)

#define PWM_EPWM_XLOADCTL_RESERVED_2_MASK     (0x00000008U)
#define PWM_EPWM_XLOADCTL_RESERVED_2_SHIFT    (0x00000003U)
#define PWM_EPWM_XLOADCTL_RESERVED_2_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOADCTL_RESERVED_2_MAX      (0x00000001U)

#define PWM_EPWM_XLOADCTL_SHDWLEVEL_MASK     (0x00000030U)
#define PWM_EPWM_XLOADCTL_SHDWLEVEL_SHIFT    (0x00000004U)
#define PWM_EPWM_XLOADCTL_SHDWLEVEL_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOADCTL_SHDWLEVEL_MAX      (0x00000003U)

#define PWM_EPWM_XLOADCTL_RESERVED_3_MASK     (0x000000C0U)
#define PWM_EPWM_XLOADCTL_RESERVED_3_SHIFT    (0x00000006U)
#define PWM_EPWM_XLOADCTL_RESERVED_3_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOADCTL_RESERVED_3_MAX      (0x00000003U)

#define PWM_EPWM_XLOADCTL_SHDWBUFPTR_LOADONCE_MASK     (0x00000300U)
#define PWM_EPWM_XLOADCTL_SHDWBUFPTR_LOADONCE_SHIFT    (0x00000008U)
#define PWM_EPWM_XLOADCTL_SHDWBUFPTR_LOADONCE_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOADCTL_SHDWBUFPTR_LOADONCE_MAX      (0x00000003U)

#define PWM_EPWM_XLOADCTL_SHDWBUFPTR_LOADMULTIPLE_MASK     (0x00000C00U)
#define PWM_EPWM_XLOADCTL_SHDWBUFPTR_LOADMULTIPLE_SHIFT    (0x0000000AU)
#define PWM_EPWM_XLOADCTL_SHDWBUFPTR_LOADMULTIPLE_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOADCTL_SHDWBUFPTR_LOADMULTIPLE_MAX      (0x00000003U)

#define PWM_EPWM_XLOADCTL_RESERVED_4_MASK     (0x0000F000U)
#define PWM_EPWM_XLOADCTL_RESERVED_4_SHIFT    (0x0000000CU)
#define PWM_EPWM_XLOADCTL_RESERVED_4_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOADCTL_RESERVED_4_MAX      (0x0000000FU)

#define PWM_EPWM_XLOADCTL_RPTBUF2PRD_MASK     (0x00070000U)
#define PWM_EPWM_XLOADCTL_RPTBUF2PRD_SHIFT    (0x00000010U)
#define PWM_EPWM_XLOADCTL_RPTBUF2PRD_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOADCTL_RPTBUF2PRD_MAX      (0x00000007U)

#define PWM_EPWM_XLOADCTL_RESERVED_5_MASK     (0x00080000U)
#define PWM_EPWM_XLOADCTL_RESERVED_5_SHIFT    (0x00000013U)
#define PWM_EPWM_XLOADCTL_RESERVED_5_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOADCTL_RESERVED_5_MAX      (0x00000001U)

#define PWM_EPWM_XLOADCTL_RPTBUF2CNT_MASK     (0x00700000U)
#define PWM_EPWM_XLOADCTL_RPTBUF2CNT_SHIFT    (0x00000014U)
#define PWM_EPWM_XLOADCTL_RPTBUF2CNT_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOADCTL_RPTBUF2CNT_MAX      (0x00000007U)

#define PWM_EPWM_XLOADCTL_RESERVED_6_MASK     (0x00800000U)
#define PWM_EPWM_XLOADCTL_RESERVED_6_SHIFT    (0x00000017U)
#define PWM_EPWM_XLOADCTL_RESERVED_6_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOADCTL_RESERVED_6_MAX      (0x00000001U)

#define PWM_EPWM_XLOADCTL_RPTBUF3PRD_MASK     (0x07000000U)
#define PWM_EPWM_XLOADCTL_RPTBUF3PRD_SHIFT    (0x00000018U)
#define PWM_EPWM_XLOADCTL_RPTBUF3PRD_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOADCTL_RPTBUF3PRD_MAX      (0x00000007U)

#define PWM_EPWM_XLOADCTL_RESERVED_7_MASK     (0x08000000U)
#define PWM_EPWM_XLOADCTL_RESERVED_7_SHIFT    (0x0000001BU)
#define PWM_EPWM_XLOADCTL_RESERVED_7_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOADCTL_RESERVED_7_MAX      (0x00000001U)

#define PWM_EPWM_XLOADCTL_RPTBUF3CNT_MASK     (0x70000000U)
#define PWM_EPWM_XLOADCTL_RPTBUF3CNT_SHIFT    (0x0000001CU)
#define PWM_EPWM_XLOADCTL_RPTBUF3CNT_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOADCTL_RPTBUF3CNT_MAX      (0x00000007U)

#define PWM_EPWM_XLOADCTL_RESERVED_8_MASK     (0x80000000U)
#define PWM_EPWM_XLOADCTL_RESERVED_8_SHIFT    (0x0000001FU)
#define PWM_EPWM_XLOADCTL_RESERVED_8_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOADCTL_RESERVED_8_MAX      (0x00000001U)

#define PWM_EPWM_XLOADCTL_RESETVAL (0x00000000U)

/* RESERVED_55 */

#define PWM_EPWM_RESERVED_55_UNNAMED_MASK     (0x00000001U)
#define PWM_EPWM_RESERVED_55_UNNAMED_SHIFT    (0x00000000U)
#define PWM_EPWM_RESERVED_55_UNNAMED_RESETVAL (0x00000000U)
#define PWM_EPWM_RESERVED_55_UNNAMED_MAX      (0x00000001U)

#define PWM_EPWM_RESERVED_55_RESETVAL (0x00000000U)

/* XLOAD */

#define PWM_EPWM_XLOAD_STARTLD_MASK     (0x00000001U)
#define PWM_EPWM_XLOAD_STARTLD_SHIFT    (0x00000000U)
#define PWM_EPWM_XLOAD_STARTLD_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOAD_STARTLD_MAX      (0x00000001U)

#define PWM_EPWM_XLOAD_FRCLD_MASK     (0x00000002U)
#define PWM_EPWM_XLOAD_FRCLD_SHIFT    (0x00000001U)
#define PWM_EPWM_XLOAD_FRCLD_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOAD_FRCLD_MAX      (0x00000001U)

#define PWM_EPWM_XLOAD_RESERVED_1_MASK     (0xFFFFFFFCU)
#define PWM_EPWM_XLOAD_RESERVED_1_SHIFT    (0x00000002U)
#define PWM_EPWM_XLOAD_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_XLOAD_RESERVED_1_MAX      (0x3FFFFFFFU)

#define PWM_EPWM_XLOAD_RESETVAL (0x00000000U)

/* EPWMXLINKXLOAD */

#define PWM_EPWM_EPWMXLINKXLOAD_XLOADLINK_MASK     (0x0000001FU)
#define PWM_EPWM_EPWMXLINKXLOAD_XLOADLINK_SHIFT    (0x00000000U)
#define PWM_EPWM_EPWMXLINKXLOAD_XLOADLINK_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMXLINKXLOAD_XLOADLINK_MAX      (0x0000001FU)

#define PWM_EPWM_EPWMXLINKXLOAD_RESERVED_1_MASK     (0xFFFFFFE0U)
#define PWM_EPWM_EPWMXLINKXLOAD_RESERVED_1_SHIFT    (0x00000005U)
#define PWM_EPWM_EPWMXLINKXLOAD_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_EPWMXLINKXLOAD_RESERVED_1_MAX      (0x07FFFFFFU)

#define PWM_EPWM_EPWMXLINKXLOAD_RESETVAL (0x00000000U)

/* XREGSHDW1STS */

#define PWM_EPWM_XREGSHDW1STS_XCMP1_SHDW1FULL_MASK     (0x00000001U)
#define PWM_EPWM_XREGSHDW1STS_XCMP1_SHDW1FULL_SHIFT    (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XCMP1_SHDW1FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XCMP1_SHDW1FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XCMP2_SHDW1FULL_MASK     (0x00000002U)
#define PWM_EPWM_XREGSHDW1STS_XCMP2_SHDW1FULL_SHIFT    (0x00000001U)
#define PWM_EPWM_XREGSHDW1STS_XCMP2_SHDW1FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XCMP2_SHDW1FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XCMP3_SHDW1FULL_MASK     (0x00000004U)
#define PWM_EPWM_XREGSHDW1STS_XCMP3_SHDW1FULL_SHIFT    (0x00000002U)
#define PWM_EPWM_XREGSHDW1STS_XCMP3_SHDW1FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XCMP3_SHDW1FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XCMP4_SHDW1FULL_MASK     (0x00000008U)
#define PWM_EPWM_XREGSHDW1STS_XCMP4_SHDW1FULL_SHIFT    (0x00000003U)
#define PWM_EPWM_XREGSHDW1STS_XCMP4_SHDW1FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XCMP4_SHDW1FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XCMP5_SHDW1FULL_MASK     (0x00000010U)
#define PWM_EPWM_XREGSHDW1STS_XCMP5_SHDW1FULL_SHIFT    (0x00000004U)
#define PWM_EPWM_XREGSHDW1STS_XCMP5_SHDW1FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XCMP5_SHDW1FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XCMP6_SHDW1FULL_MASK     (0x00000020U)
#define PWM_EPWM_XREGSHDW1STS_XCMP6_SHDW1FULL_SHIFT    (0x00000005U)
#define PWM_EPWM_XREGSHDW1STS_XCMP6_SHDW1FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XCMP6_SHDW1FULL_MAX      (0x00000001U)

