TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_XREGSHDW1STS_XCMP7_SHDW1FULL_MASK     (0x00000040U)
#define PWM_EPWM_XREGSHDW1STS_XCMP7_SHDW1FULL_SHIFT    (0x00000006U)
#define PWM_EPWM_XREGSHDW1STS_XCMP7_SHDW1FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XCMP7_SHDW1FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XCMP8_SHDW1FULL_MASK     (0x00000080U)
#define PWM_EPWM_XREGSHDW1STS_XCMP8_SHDW1FULL_SHIFT    (0x00000007U)
#define PWM_EPWM_XREGSHDW1STS_XCMP8_SHDW1FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XCMP8_SHDW1FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XTBPRD_SHDW1FULL_MASK     (0x00000100U)
#define PWM_EPWM_XREGSHDW1STS_XTBPRD_SHDW1FULL_SHIFT    (0x00000008U)
#define PWM_EPWM_XREGSHDW1STS_XTBPRD_SHDW1FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XTBPRD_SHDW1FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_CMPC_SHDW1FULL_MASK     (0x00000200U)
#define PWM_EPWM_XREGSHDW1STS_CMPC_SHDW1FULL_SHIFT    (0x00000009U)
#define PWM_EPWM_XREGSHDW1STS_CMPC_SHDW1FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_CMPC_SHDW1FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_CMPD_SHDW1FULL_MASK     (0x00000400U)
#define PWM_EPWM_XREGSHDW1STS_CMPD_SHDW1FULL_SHIFT    (0x0000000AU)
#define PWM_EPWM_XREGSHDW1STS_CMPD_SHDW1FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_CMPD_SHDW1FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XAQCTLA_SHDW1FULL_MASK     (0x00000800U)
#define PWM_EPWM_XREGSHDW1STS_XAQCTLA_SHDW1FULL_SHIFT    (0x0000000BU)
#define PWM_EPWM_XREGSHDW1STS_XAQCTLA_SHDW1FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XAQCTLA_SHDW1FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XAQCTLB_SHDW1FULL_MASK     (0x00001000U)
#define PWM_EPWM_XREGSHDW1STS_XAQCTLB_SHDW1FULL_SHIFT    (0x0000000CU)
#define PWM_EPWM_XREGSHDW1STS_XAQCTLB_SHDW1FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XAQCTLB_SHDW1FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XMAX_SHDW1FULL_MASK     (0x00002000U)
#define PWM_EPWM_XREGSHDW1STS_XMAX_SHDW1FULL_SHIFT    (0x0000000DU)
#define PWM_EPWM_XREGSHDW1STS_XMAX_SHDW1FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XMAX_SHDW1FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XMIN_SHDW1FULL_MASK     (0x00004000U)
#define PWM_EPWM_XREGSHDW1STS_XMIN_SHDW1FULL_SHIFT    (0x0000000EU)
#define PWM_EPWM_XREGSHDW1STS_XMIN_SHDW1FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XMIN_SHDW1FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_RESERVED_1_MASK     (0xFFFF8000U)
#define PWM_EPWM_XREGSHDW1STS_RESERVED_1_SHIFT    (0x0000000FU)
#define PWM_EPWM_XREGSHDW1STS_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_RESERVED_1_MAX      (0x0001FFFFU)

#define PWM_EPWM_XREGSHDW1STS_RESETVAL (0x00000000U)

/* RESERVED_56 */

#define PWM_EPWM_RESERVED_56_UNNAMED_MASK     (0x00000001U)
#define PWM_EPWM_RESERVED_56_UNNAMED_SHIFT    (0x00000000U)
#define PWM_EPWM_RESERVED_56_UNNAMED_RESETVAL (0x00000000U)
#define PWM_EPWM_RESERVED_56_UNNAMED_MAX      (0x00000001U)

#define PWM_EPWM_RESERVED_56_RESETVAL (0x00000000U)

/* XREGSHDW2STS */

#define PWM_EPWM_XREGSHDW2STS_XCMP1_SHDW2FULL_MASK     (0x00000001U)
#define PWM_EPWM_XREGSHDW2STS_XCMP1_SHDW2FULL_SHIFT    (0x00000000U)
#define PWM_EPWM_XREGSHDW2STS_XCMP1_SHDW2FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW2STS_XCMP1_SHDW2FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW2STS_XCMP2_SHDW2FULL_MASK     (0x00000002U)
#define PWM_EPWM_XREGSHDW2STS_XCMP2_SHDW2FULL_SHIFT    (0x00000001U)
#define PWM_EPWM_XREGSHDW2STS_XCMP2_SHDW2FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW2STS_XCMP2_SHDW2FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW2STS_XCMP3_SHDW2FULL_MASK     (0x00000004U)
#define PWM_EPWM_XREGSHDW2STS_XCMP3_SHDW2FULL_SHIFT    (0x00000002U)
#define PWM_EPWM_XREGSHDW2STS_XCMP3_SHDW2FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW2STS_XCMP3_SHDW2FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW2STS_XCMP4_SHDW2FULL_MASK     (0x00000008U)
#define PWM_EPWM_XREGSHDW2STS_XCMP4_SHDW2FULL_SHIFT    (0x00000003U)
#define PWM_EPWM_XREGSHDW2STS_XCMP4_SHDW2FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW2STS_XCMP4_SHDW2FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW2STS_XCMP5_SHDW2FULL_MASK     (0x00000010U)
#define PWM_EPWM_XREGSHDW2STS_XCMP5_SHDW2FULL_SHIFT    (0x00000004U)
#define PWM_EPWM_XREGSHDW2STS_XCMP5_SHDW2FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW2STS_XCMP5_SHDW2FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW2STS_XCMP6_SHDW2FULL_MASK     (0x00000020U)
#define PWM_EPWM_XREGSHDW2STS_XCMP6_SHDW2FULL_SHIFT    (0x00000005U)
#define PWM_EPWM_XREGSHDW2STS_XCMP6_SHDW2FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW2STS_XCMP6_SHDW2FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW2STS_XCMP7_SHDW2FULL_MASK     (0x00000040U)
#define PWM_EPWM_XREGSHDW2STS_XCMP7_SHDW2FULL_SHIFT    (0x00000006U)
#define PWM_EPWM_XREGSHDW2STS_XCMP7_SHDW2FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW2STS_XCMP7_SHDW2FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW2STS_XCMP8_SHDW2FULL_MASK     (0x00000080U)
#define PWM_EPWM_XREGSHDW2STS_XCMP8_SHDW2FULL_SHIFT    (0x00000007U)
#define PWM_EPWM_XREGSHDW2STS_XCMP8_SHDW2FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW2STS_XCMP8_SHDW2FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW2STS_XTBPRD_SHDW2FULL_MASK     (0x00000100U)
#define PWM_EPWM_XREGSHDW2STS_XTBPRD_SHDW2FULL_SHIFT    (0x00000008U)
#define PWM_EPWM_XREGSHDW2STS_XTBPRD_SHDW2FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW2STS_XTBPRD_SHDW2FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW2STS_CMPC_SHDW2FULL_MASK     (0x00000200U)
#define PWM_EPWM_XREGSHDW2STS_CMPC_SHDW2FULL_SHIFT    (0x00000009U)
#define PWM_EPWM_XREGSHDW2STS_CMPC_SHDW2FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW2STS_CMPC_SHDW2FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW2STS_CMPD_SHDW2FULL_MASK     (0x00000400U)
#define PWM_EPWM_XREGSHDW2STS_CMPD_SHDW2FULL_SHIFT    (0x0000000AU)
#define PWM_EPWM_XREGSHDW2STS_CMPD_SHDW2FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW2STS_CMPD_SHDW2FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW2STS_XAQCTLA_SHDW2FULL_MASK     (0x00000800U)
#define PWM_EPWM_XREGSHDW2STS_XAQCTLA_SHDW2FULL_SHIFT    (0x0000000BU)
#define PWM_EPWM_XREGSHDW2STS_XAQCTLA_SHDW2FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW2STS_XAQCTLA_SHDW2FULL_MAX      (0x00000001U)

