TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_XREGSHDW2STS_XAQCTLB_SHDW2FULL_MASK     (0x00001000U)
#define PWM_EPWM_XREGSHDW2STS_XAQCTLB_SHDW2FULL_SHIFT    (0x0000000CU)
#define PWM_EPWM_XREGSHDW2STS_XAQCTLB_SHDW2FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW2STS_XAQCTLB_SHDW2FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW2STS_XMAX_SHDW2FULL_MASK     (0x00002000U)
#define PWM_EPWM_XREGSHDW2STS_XMAX_SHDW2FULL_SHIFT    (0x0000000DU)
#define PWM_EPWM_XREGSHDW2STS_XMAX_SHDW2FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW2STS_XMAX_SHDW2FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW2STS_XMIN_SHDW2FULL_MASK     (0x00004000U)
#define PWM_EPWM_XREGSHDW2STS_XMIN_SHDW2FULL_SHIFT    (0x0000000EU)
#define PWM_EPWM_XREGSHDW2STS_XMIN_SHDW2FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW2STS_XMIN_SHDW2FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW2STS_RESERVED_1_MASK     (0xFFFF8000U)
#define PWM_EPWM_XREGSHDW2STS_RESERVED_1_SHIFT    (0x0000000FU)
#define PWM_EPWM_XREGSHDW2STS_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW2STS_RESERVED_1_MAX      (0x0001FFFFU)

#define PWM_EPWM_XREGSHDW2STS_RESETVAL (0x00000000U)

/* RESERVED_57 */

#define PWM_EPWM_RESERVED_57_UNNAMED_MASK     (0x00000001U)
#define PWM_EPWM_RESERVED_57_UNNAMED_SHIFT    (0x00000000U)
#define PWM_EPWM_RESERVED_57_UNNAMED_RESETVAL (0x00000000U)
#define PWM_EPWM_RESERVED_57_UNNAMED_MAX      (0x00000001U)

#define PWM_EPWM_RESERVED_57_RESETVAL (0x00000000U)

/* XREGSHDW3STS */

#define PWM_EPWM_XREGSHDW3STS_XCMP1_SHDW3FULL_MASK     (0x00000001U)
#define PWM_EPWM_XREGSHDW3STS_XCMP1_SHDW3FULL_SHIFT    (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_XCMP1_SHDW3FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_XCMP1_SHDW3FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW3STS_XCMP2_SHDW3FULL_MASK     (0x00000002U)
#define PWM_EPWM_XREGSHDW3STS_XCMP2_SHDW3FULL_SHIFT    (0x00000001U)
#define PWM_EPWM_XREGSHDW3STS_XCMP2_SHDW3FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_XCMP2_SHDW3FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW3STS_XCMP3_SHDW3FULL_MASK     (0x00000004U)
#define PWM_EPWM_XREGSHDW3STS_XCMP3_SHDW3FULL_SHIFT    (0x00000002U)
#define PWM_EPWM_XREGSHDW3STS_XCMP3_SHDW3FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_XCMP3_SHDW3FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW3STS_XCMP4_SHDW3FULL_MASK     (0x00000008U)
#define PWM_EPWM_XREGSHDW3STS_XCMP4_SHDW3FULL_SHIFT    (0x00000003U)
#define PWM_EPWM_XREGSHDW3STS_XCMP4_SHDW3FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_XCMP4_SHDW3FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW3STS_XCMP5_SHDW3FULL_MASK     (0x00000010U)
#define PWM_EPWM_XREGSHDW3STS_XCMP5_SHDW3FULL_SHIFT    (0x00000004U)
#define PWM_EPWM_XREGSHDW3STS_XCMP5_SHDW3FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_XCMP5_SHDW3FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW3STS_XCMP6_SHDW3FULL_MASK     (0x00000020U)
#define PWM_EPWM_XREGSHDW3STS_XCMP6_SHDW3FULL_SHIFT    (0x00000005U)
#define PWM_EPWM_XREGSHDW3STS_XCMP6_SHDW3FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_XCMP6_SHDW3FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW3STS_XCMP7_SHDW3FULL_MASK     (0x00000040U)
#define PWM_EPWM_XREGSHDW3STS_XCMP7_SHDW3FULL_SHIFT    (0x00000006U)
#define PWM_EPWM_XREGSHDW3STS_XCMP7_SHDW3FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_XCMP7_SHDW3FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW3STS_XCMP8_SHDW3FULL_MASK     (0x00000080U)
#define PWM_EPWM_XREGSHDW3STS_XCMP8_SHDW3FULL_SHIFT    (0x00000007U)
#define PWM_EPWM_XREGSHDW3STS_XCMP8_SHDW3FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_XCMP8_SHDW3FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW3STS_XTBPRD_SHDW3FULL_MASK     (0x00000100U)
#define PWM_EPWM_XREGSHDW3STS_XTBPRD_SHDW3FULL_SHIFT    (0x00000008U)
#define PWM_EPWM_XREGSHDW3STS_XTBPRD_SHDW3FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_XTBPRD_SHDW3FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW3STS_CMPC_SHDW3FULL_MASK     (0x00000200U)
#define PWM_EPWM_XREGSHDW3STS_CMPC_SHDW3FULL_SHIFT    (0x00000009U)
#define PWM_EPWM_XREGSHDW3STS_CMPC_SHDW3FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_CMPC_SHDW3FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW3STS_CMPD_SHDW3FULL_MASK     (0x00000400U)
#define PWM_EPWM_XREGSHDW3STS_CMPD_SHDW3FULL_SHIFT    (0x0000000AU)
#define PWM_EPWM_XREGSHDW3STS_CMPD_SHDW3FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_CMPD_SHDW3FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW3STS_XAQCTLA_SHDW3FULL_MASK     (0x00000800U)
#define PWM_EPWM_XREGSHDW3STS_XAQCTLA_SHDW3FULL_SHIFT    (0x0000000BU)
#define PWM_EPWM_XREGSHDW3STS_XAQCTLA_SHDW3FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_XAQCTLA_SHDW3FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW3STS_XAQCTLB_SHDW3FULL_MASK     (0x00001000U)
#define PWM_EPWM_XREGSHDW3STS_XAQCTLB_SHDW3FULL_SHIFT    (0x0000000CU)
#define PWM_EPWM_XREGSHDW3STS_XAQCTLB_SHDW3FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_XAQCTLB_SHDW3FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW3STS_XMAX_SHDW3FULL_MASK     (0x00002000U)
#define PWM_EPWM_XREGSHDW3STS_XMAX_SHDW3FULL_SHIFT    (0x0000000DU)
#define PWM_EPWM_XREGSHDW3STS_XMAX_SHDW3FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_XMAX_SHDW3FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW3STS_XMIN_SHDW3FULL_MASK     (0x00004000U)
#define PWM_EPWM_XREGSHDW3STS_XMIN_SHDW3FULL_SHIFT    (0x0000000EU)
#define PWM_EPWM_XREGSHDW3STS_XMIN_SHDW3FULL_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_XMIN_SHDW3FULL_MAX      (0x00000001U)

#define PWM_EPWM_XREGSHDW3STS_RESERVED_1_MASK     (0xFFFF8000U)
#define PWM_EPWM_XREGSHDW3STS_RESERVED_1_SHIFT    (0x0000000FU)
#define PWM_EPWM_XREGSHDW3STS_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_RESERVED_1_MAX      (0x0001FFFFU)

#define PWM_EPWM_XREGSHDW3STS_RESETVAL (0x00000000U)

/* RESERVED_58 */

#define PWM_EPWM_RESERVED_58_UNNAMED_MASK     (0x00000001U)
#define PWM_EPWM_RESERVED_58_UNNAMED_SHIFT    (0x00000000U)
#define PWM_EPWM_RESERVED_58_UNNAMED_RESETVAL (0x00000000U)
#define PWM_EPWM_RESERVED_58_UNNAMED_MAX      (0x00000001U)

#define PWM_EPWM_RESERVED_58_RESETVAL (0x00000000U)

/* XCMP1_ACTIVE */

#define PWM_EPWM_XCMP1_ACTIVE_XCMP1HR_ACTIVE_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP1_ACTIVE_XCMP1HR_ACTIVE_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP1_ACTIVE_XCMP1HR_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP1_ACTIVE_XCMP1HR_ACTIVE_MAX      (0x0000FFFFU)

