TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_XCMP1_ACTIVE_XCMP1_ACTIVE_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP1_ACTIVE_XCMP1_ACTIVE_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP1_ACTIVE_XCMP1_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP1_ACTIVE_XCMP1_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP1_ACTIVE_RESETVAL (0x00000000U)

/* XCMP2_ACTIVE */

#define PWM_EPWM_XCMP2_ACTIVE_XCMP2HR_ACTIVE_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP2_ACTIVE_XCMP2HR_ACTIVE_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP2_ACTIVE_XCMP2HR_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP2_ACTIVE_XCMP2HR_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP2_ACTIVE_XCMP2_ACTIVE_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP2_ACTIVE_XCMP2_ACTIVE_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP2_ACTIVE_XCMP2_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP2_ACTIVE_XCMP2_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP2_ACTIVE_RESETVAL (0x00000000U)

/* XCMP3_ACTIVE */

#define PWM_EPWM_XCMP3_ACTIVE_XCMP3HR_ACTIVE_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP3_ACTIVE_XCMP3HR_ACTIVE_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP3_ACTIVE_XCMP3HR_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP3_ACTIVE_XCMP3HR_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP3_ACTIVE_XCMP3_ACTIVE_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP3_ACTIVE_XCMP3_ACTIVE_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP3_ACTIVE_XCMP3_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP3_ACTIVE_XCMP3_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP3_ACTIVE_RESETVAL (0x00000000U)

/* XCMP4_ACTIVE */

#define PWM_EPWM_XCMP4_ACTIVE_XCMP4HR_ACTIVE_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP4_ACTIVE_XCMP4HR_ACTIVE_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP4_ACTIVE_XCMP4HR_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP4_ACTIVE_XCMP4HR_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP4_ACTIVE_XCMP4_ACTIVE_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP4_ACTIVE_XCMP4_ACTIVE_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP4_ACTIVE_XCMP4_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP4_ACTIVE_XCMP4_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP4_ACTIVE_RESETVAL (0x00000000U)

/* XCMP5_ACTIVE */

#define PWM_EPWM_XCMP5_ACTIVE_XCMP5HR_ACTIVE_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP5_ACTIVE_XCMP5HR_ACTIVE_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP5_ACTIVE_XCMP5HR_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP5_ACTIVE_XCMP5HR_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP5_ACTIVE_XCMP5_ACTIVE_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP5_ACTIVE_XCMP5_ACTIVE_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP5_ACTIVE_XCMP5_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP5_ACTIVE_XCMP5_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP5_ACTIVE_RESETVAL (0x00000000U)

/* XCMP6_ACTIVE */

#define PWM_EPWM_XCMP6_ACTIVE_XCMP6HR_ACTIVE_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP6_ACTIVE_XCMP6HR_ACTIVE_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP6_ACTIVE_XCMP6HR_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP6_ACTIVE_XCMP6HR_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP6_ACTIVE_XCMP6_ACTIVE_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP6_ACTIVE_XCMP6_ACTIVE_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP6_ACTIVE_XCMP6_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP6_ACTIVE_XCMP6_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP6_ACTIVE_RESETVAL (0x00000000U)

/* XCMP7_ACTIVE */

#define PWM_EPWM_XCMP7_ACTIVE_XCMP7HR_ACTIVE_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP7_ACTIVE_XCMP7HR_ACTIVE_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP7_ACTIVE_XCMP7HR_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP7_ACTIVE_XCMP7HR_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP7_ACTIVE_XCMP7_ACTIVE_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP7_ACTIVE_XCMP7_ACTIVE_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP7_ACTIVE_XCMP7_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP7_ACTIVE_XCMP7_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP7_ACTIVE_RESETVAL (0x00000000U)

/* XCMP8_ACTIVE */

#define PWM_EPWM_XCMP8_ACTIVE_XCMP8HR_ACTIVE_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP8_ACTIVE_XCMP8HR_ACTIVE_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP8_ACTIVE_XCMP8HR_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP8_ACTIVE_XCMP8HR_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP8_ACTIVE_XCMP8_ACTIVE_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP8_ACTIVE_XCMP8_ACTIVE_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP8_ACTIVE_XCMP8_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP8_ACTIVE_XCMP8_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP8_ACTIVE_RESETVAL (0x00000000U)

/* XTBPRD_ACTIVE */

#define PWM_EPWM_XTBPRD_ACTIVE_XTBPRDHR_ACTIVE_MASK     (0x0000FFFFU)
#define PWM_EPWM_XTBPRD_ACTIVE_XTBPRDHR_ACTIVE_SHIFT    (0x00000000U)
#define PWM_EPWM_XTBPRD_ACTIVE_XTBPRDHR_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XTBPRD_ACTIVE_XTBPRDHR_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XTBPRD_ACTIVE_XTBPRD_ACTIVE_MASK     (0xFFFF0000U)
#define PWM_EPWM_XTBPRD_ACTIVE_XTBPRD_ACTIVE_SHIFT    (0x00000010U)
#define PWM_EPWM_XTBPRD_ACTIVE_XTBPRD_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XTBPRD_ACTIVE_XTBPRD_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XTBPRD_ACTIVE_RESETVAL (0x00000000U)

/* RESERVED_59 */

#define PWM_EPWM_RESERVED_59_UNNAMED_MASK     (0x00000001U)
#define PWM_EPWM_RESERVED_59_UNNAMED_SHIFT    (0x00000000U)
#define PWM_EPWM_RESERVED_59_UNNAMED_RESETVAL (0x00000000U)
#define PWM_EPWM_RESERVED_59_UNNAMED_MAX      (0x00000001U)

#define PWM_EPWM_RESERVED_59_RESETVAL (0x00000000U)

/* XAQCTLA_ACTIVE */

#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP1_MASK     (0x0003U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP1_SHIFT    (0x0000U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP1_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP1_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP2_MASK     (0x000CU)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP2_SHIFT    (0x0002U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP2_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP2_MAX      (0x0003U)

