TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP3_MASK     (0x0030U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP3_SHIFT    (0x0004U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP3_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP3_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP4_MASK     (0x00C0U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP4_SHIFT    (0x0006U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP4_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP4_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP5_MASK     (0x0300U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP5_SHIFT    (0x0008U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP5_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP5_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP6_MASK     (0x0C00U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP6_SHIFT    (0x000AU)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP6_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP6_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP7_MASK     (0x3000U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP7_SHIFT    (0x000CU)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP7_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP7_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP8_MASK     (0xC000U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP8_SHIFT    (0x000EU)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP8_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLA_ACTIVE_XCMP8_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLA_ACTIVE_RESETVAL (0x0000U)

/* XAQCTLB_ACTIVE */

#define PWM_EPWM_XAQCTLB_ACTIVE_RESERVED_1_MASK     (0x00FFU)
#define PWM_EPWM_XAQCTLB_ACTIVE_RESERVED_1_SHIFT    (0x0000U)
#define PWM_EPWM_XAQCTLB_ACTIVE_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLB_ACTIVE_RESERVED_1_MAX      (0x00FFU)

#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP5_MASK     (0x0300U)
#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP5_SHIFT    (0x0008U)
#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP5_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP5_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP6_MASK     (0x0C00U)
#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP6_SHIFT    (0x000AU)
#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP6_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP6_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP7_MASK     (0x3000U)
#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP7_SHIFT    (0x000CU)
#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP7_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP7_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP8_MASK     (0xC000U)
#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP8_SHIFT    (0x000EU)
#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP8_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP8_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLB_ACTIVE_RESETVAL (0x0000U)

/* RESERVED_60 */

#define PWM_EPWM_RESERVED_60_UNNAMED_MASK     (0x00000001U)
#define PWM_EPWM_RESERVED_60_UNNAMED_SHIFT    (0x00000000U)
#define PWM_EPWM_RESERVED_60_UNNAMED_RESETVAL (0x00000000U)
#define PWM_EPWM_RESERVED_60_UNNAMED_MAX      (0x00000001U)

#define PWM_EPWM_RESERVED_60_RESETVAL (0x00000000U)

/* XMINMAX_ACTIVE */

#define PWM_EPWM_XMINMAX_ACTIVE_XMAX_ACTIVE_MASK     (0x0000FFFFU)
#define PWM_EPWM_XMINMAX_ACTIVE_XMAX_ACTIVE_SHIFT    (0x00000000U)
#define PWM_EPWM_XMINMAX_ACTIVE_XMAX_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XMINMAX_ACTIVE_XMAX_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XMINMAX_ACTIVE_XMIN_ACTIVE_MASK     (0xFFFF0000U)
#define PWM_EPWM_XMINMAX_ACTIVE_XMIN_ACTIVE_SHIFT    (0x00000010U)
#define PWM_EPWM_XMINMAX_ACTIVE_XMIN_ACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_XMINMAX_ACTIVE_XMIN_ACTIVE_MAX      (0x0000FFFFU)

#define PWM_EPWM_XMINMAX_ACTIVE_RESETVAL (0x00000000U)

/* RESERVED_61 */

#define PWM_EPWM_RESERVED_61_UNNAMED_MASK     (0x00000001U)
#define PWM_EPWM_RESERVED_61_UNNAMED_SHIFT    (0x00000000U)
#define PWM_EPWM_RESERVED_61_UNNAMED_RESETVAL (0x00000000U)
#define PWM_EPWM_RESERVED_61_UNNAMED_MAX      (0x00000001U)

#define PWM_EPWM_RESERVED_61_RESETVAL (0x00000000U)

/* XCMP1_SHDW1 */

#define PWM_EPWM_XCMP1_SHDW1_XCMP1HR_SHDW1_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP1_SHDW1_XCMP1HR_SHDW1_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP1_SHDW1_XCMP1HR_SHDW1_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP1_SHDW1_XCMP1HR_SHDW1_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP1_SHDW1_XCMP1_SHDW1_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP1_SHDW1_XCMP1_SHDW1_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP1_SHDW1_XCMP1_SHDW1_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP1_SHDW1_XCMP1_SHDW1_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP1_SHDW1_RESETVAL (0x00000000U)

/* XCMP2_SHDW1 */

#define PWM_EPWM_XCMP2_SHDW1_XCMP2HR_SHDW1_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP2_SHDW1_XCMP2HR_SHDW1_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP2_SHDW1_XCMP2HR_SHDW1_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP2_SHDW1_XCMP2HR_SHDW1_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP2_SHDW1_XCMP2_SHDW1_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP2_SHDW1_XCMP2_SHDW1_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP2_SHDW1_XCMP2_SHDW1_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP2_SHDW1_XCMP2_SHDW1_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP2_SHDW1_RESETVAL (0x00000000U)

/* XCMP3_SHDW1 */

#define PWM_EPWM_XCMP3_SHDW1_XCMP3HR_SHDW1_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP3_SHDW1_XCMP3HR_SHDW1_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP3_SHDW1_XCMP3HR_SHDW1_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP3_SHDW1_XCMP3HR_SHDW1_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP3_SHDW1_XCMP3_SHDW1_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP3_SHDW1_XCMP3_SHDW1_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP3_SHDW1_XCMP3_SHDW1_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP3_SHDW1_XCMP3_SHDW1_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP3_SHDW1_RESETVAL (0x00000000U)

/* XCMP4_SHDW1 */

#define PWM_EPWM_XCMP4_SHDW1_XCMP4HR_SHDW1_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP4_SHDW1_XCMP4HR_SHDW1_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP4_SHDW1_XCMP4HR_SHDW1_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP4_SHDW1_XCMP4HR_SHDW1_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP4_SHDW1_XCMP4_SHDW1_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP4_SHDW1_XCMP4_SHDW1_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP4_SHDW1_XCMP4_SHDW1_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP4_SHDW1_XCMP4_SHDW1_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP4_SHDW1_RESETVAL (0x00000000U)

/* XCMP5_SHDW1 */

#define PWM_EPWM_XCMP5_SHDW1_XCMP5HR_SHDW1_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP5_SHDW1_XCMP5HR_SHDW1_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP5_SHDW1_XCMP5HR_SHDW1_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP5_SHDW1_XCMP5HR_SHDW1_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP5_SHDW1_XCMP5_SHDW1_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP5_SHDW1_XCMP5_SHDW1_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP5_SHDW1_XCMP5_SHDW1_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP5_SHDW1_XCMP5_SHDW1_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP5_SHDW1_RESETVAL (0x00000000U)

/* XCMP6_SHDW1 */

#define PWM_EPWM_XCMP6_SHDW1_XCMP6HR_SHDW1_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP6_SHDW1_XCMP6HR_SHDW1_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP6_SHDW1_XCMP6HR_SHDW1_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP6_SHDW1_XCMP6HR_SHDW1_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP6_SHDW1_XCMP6_SHDW1_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP6_SHDW1_XCMP6_SHDW1_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP6_SHDW1_XCMP6_SHDW1_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP6_SHDW1_XCMP6_SHDW1_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP6_SHDW1_RESETVAL (0x00000000U)

