TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_CMPD_SHDW1_CMPD_SHDW1_MASK     (0xFFFFU)
#define PWM_EPWM_CMPD_SHDW1_CMPD_SHDW1_SHIFT    (0x0000U)
#define PWM_EPWM_CMPD_SHDW1_CMPD_SHDW1_RESETVAL (0x0000U)
#define PWM_EPWM_CMPD_SHDW1_CMPD_SHDW1_MAX      (0xFFFFU)

#define PWM_EPWM_CMPD_SHDW1_RESETVAL (0x0000U)

/* RESERVED_65 */

#define PWM_EPWM_RESERVED_65_UNNAMED_MASK     (0x00000001U)
#define PWM_EPWM_RESERVED_65_UNNAMED_SHIFT    (0x00000000U)
#define PWM_EPWM_RESERVED_65_UNNAMED_RESETVAL (0x00000000U)
#define PWM_EPWM_RESERVED_65_UNNAMED_MAX      (0x00000001U)

#define PWM_EPWM_RESERVED_65_RESETVAL (0x00000000U)

/* XMINMAX_SHDW1 */

#define PWM_EPWM_XMINMAX_SHDW1_XMAX_SHDW1_MASK     (0x0000FFFFU)
#define PWM_EPWM_XMINMAX_SHDW1_XMAX_SHDW1_SHIFT    (0x00000000U)
#define PWM_EPWM_XMINMAX_SHDW1_XMAX_SHDW1_RESETVAL (0x00000000U)
#define PWM_EPWM_XMINMAX_SHDW1_XMAX_SHDW1_MAX      (0x0000FFFFU)

#define PWM_EPWM_XMINMAX_SHDW1_XMIN_SHDW1_MASK     (0xFFFF0000U)
#define PWM_EPWM_XMINMAX_SHDW1_XMIN_SHDW1_SHIFT    (0x00000010U)
#define PWM_EPWM_XMINMAX_SHDW1_XMIN_SHDW1_RESETVAL (0x00000000U)
#define PWM_EPWM_XMINMAX_SHDW1_XMIN_SHDW1_MAX      (0x0000FFFFU)

#define PWM_EPWM_XMINMAX_SHDW1_RESETVAL (0x00000000U)

/* RESERVED_66 */

#define PWM_EPWM_RESERVED_66_UNNAMED_MASK     (0x00000001U)
#define PWM_EPWM_RESERVED_66_UNNAMED_SHIFT    (0x00000000U)
#define PWM_EPWM_RESERVED_66_UNNAMED_RESETVAL (0x00000000U)
#define PWM_EPWM_RESERVED_66_UNNAMED_MAX      (0x00000001U)

#define PWM_EPWM_RESERVED_66_RESETVAL (0x00000000U)

/* XCMP1_SHDW2 */

#define PWM_EPWM_XCMP1_SHDW2_XCMP1HR_SHDW2_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP1_SHDW2_XCMP1HR_SHDW2_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP1_SHDW2_XCMP1HR_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP1_SHDW2_XCMP1HR_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP1_SHDW2_XCMP1_SHDW2_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP1_SHDW2_XCMP1_SHDW2_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP1_SHDW2_XCMP1_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP1_SHDW2_XCMP1_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP1_SHDW2_RESETVAL (0x00000000U)

/* XCMP2_SHDW2 */

#define PWM_EPWM_XCMP2_SHDW2_XCMP2HR_SHDW2_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP2_SHDW2_XCMP2HR_SHDW2_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP2_SHDW2_XCMP2HR_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP2_SHDW2_XCMP2HR_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP2_SHDW2_XCMP2_SHDW2_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP2_SHDW2_XCMP2_SHDW2_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP2_SHDW2_XCMP2_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP2_SHDW2_XCMP2_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP2_SHDW2_RESETVAL (0x00000000U)

/* XCMP3_SHDW2 */

#define PWM_EPWM_XCMP3_SHDW2_XCMP3HR_SHDW2_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP3_SHDW2_XCMP3HR_SHDW2_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP3_SHDW2_XCMP3HR_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP3_SHDW2_XCMP3HR_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP3_SHDW2_XCMP3_SHDW2_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP3_SHDW2_XCMP3_SHDW2_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP3_SHDW2_XCMP3_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP3_SHDW2_XCMP3_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP3_SHDW2_RESETVAL (0x00000000U)

/* XCMP4_SHDW2 */

#define PWM_EPWM_XCMP4_SHDW2_XCMP4HR_SHDW2_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP4_SHDW2_XCMP4HR_SHDW2_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP4_SHDW2_XCMP4HR_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP4_SHDW2_XCMP4HR_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP4_SHDW2_XCMP4_SHDW2_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP4_SHDW2_XCMP4_SHDW2_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP4_SHDW2_XCMP4_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP4_SHDW2_XCMP4_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP4_SHDW2_RESETVAL (0x00000000U)

/* XCMP5_SHDW2 */

#define PWM_EPWM_XCMP5_SHDW2_XCMP5HR_SHDW2_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP5_SHDW2_XCMP5HR_SHDW2_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP5_SHDW2_XCMP5HR_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP5_SHDW2_XCMP5HR_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP5_SHDW2_XCMP5_SHDW2_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP5_SHDW2_XCMP5_SHDW2_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP5_SHDW2_XCMP5_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP5_SHDW2_XCMP5_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP5_SHDW2_RESETVAL (0x00000000U)

/* XCMP6_SHDW2 */

#define PWM_EPWM_XCMP6_SHDW2_XCMP6HR_SHDW2_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP6_SHDW2_XCMP6HR_SHDW2_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP6_SHDW2_XCMP6HR_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP6_SHDW2_XCMP6HR_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP6_SHDW2_XCMP6_SHDW2_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP6_SHDW2_XCMP6_SHDW2_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP6_SHDW2_XCMP6_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP6_SHDW2_XCMP6_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP6_SHDW2_RESETVAL (0x00000000U)

/* XCMP7_SHDW2 */

#define PWM_EPWM_XCMP7_SHDW2_XCMP7HR_SHDW2_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP7_SHDW2_XCMP7HR_SHDW2_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP7_SHDW2_XCMP7HR_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP7_SHDW2_XCMP7HR_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP7_SHDW2_XCMP7_SHDW2_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP7_SHDW2_XCMP7_SHDW2_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP7_SHDW2_XCMP7_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP7_SHDW2_XCMP7_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP7_SHDW2_RESETVAL (0x00000000U)

/* XCMP8_SHDW2 */

#define PWM_EPWM_XCMP8_SHDW2_XCMP8HR_SHDW2_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP8_SHDW2_XCMP8HR_SHDW2_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP8_SHDW2_XCMP8HR_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP8_SHDW2_XCMP8HR_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP8_SHDW2_XCMP8_SHDW2_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP8_SHDW2_XCMP8_SHDW2_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP8_SHDW2_XCMP8_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP8_SHDW2_XCMP8_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP8_SHDW2_RESETVAL (0x00000000U)

/* XTBPRD_SHDW2 */

#define PWM_EPWM_XTBPRD_SHDW2_XTBPRDHR_SHDW2_MASK     (0x0000FFFFU)
#define PWM_EPWM_XTBPRD_SHDW2_XTBPRDHR_SHDW2_SHIFT    (0x00000000U)
#define PWM_EPWM_XTBPRD_SHDW2_XTBPRDHR_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XTBPRD_SHDW2_XTBPRDHR_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XTBPRD_SHDW2_XTBPRD_SHDW2_MASK     (0xFFFF0000U)
#define PWM_EPWM_XTBPRD_SHDW2_XTBPRD_SHDW2_SHIFT    (0x00000010U)
#define PWM_EPWM_XTBPRD_SHDW2_XTBPRD_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XTBPRD_SHDW2_XTBPRD_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XTBPRD_SHDW2_RESETVAL (0x00000000U)

/* RESERVED_67 */

#define PWM_EPWM_RESERVED_67_UNNAMED_MASK     (0x00000001U)
#define PWM_EPWM_RESERVED_67_UNNAMED_SHIFT    (0x00000000U)
#define PWM_EPWM_RESERVED_67_UNNAMED_RESETVAL (0x00000000U)
#define PWM_EPWM_RESERVED_67_UNNAMED_MAX      (0x00000001U)

#define PWM_EPWM_RESERVED_67_RESETVAL (0x00000000U)

/* XAQCTLA_SHDW2 */

#define PWM_EPWM_XAQCTLA_SHDW2_XCMP1_MASK     (0x0003U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP1_SHIFT    (0x0000U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP1_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP1_MAX      (0x0003U)

