TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP2_MASK     (0x000CU)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP2_SHIFT    (0x0002U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP2_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP2_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLA_SHDW2_XCMP3_MASK     (0x0030U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP3_SHIFT    (0x0004U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP3_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP3_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLA_SHDW2_XCMP4_MASK     (0x00C0U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP4_SHIFT    (0x0006U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP4_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP4_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLA_SHDW2_XCMP5_MASK     (0x0300U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP5_SHIFT    (0x0008U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP5_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP5_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLA_SHDW2_XCMP6_MASK     (0x0C00U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP6_SHIFT    (0x000AU)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP6_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP6_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLA_SHDW2_XCMP7_MASK     (0x3000U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP7_SHIFT    (0x000CU)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP7_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP7_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLA_SHDW2_XCMP8_MASK     (0xC000U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP8_SHIFT    (0x000EU)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP8_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLA_SHDW2_XCMP8_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLA_SHDW2_RESETVAL (0x0000U)

/* XAQCTLB_SHDW2 */

#define PWM_EPWM_XAQCTLB_SHDW2_RESERVED_1_MASK     (0x00FFU)
#define PWM_EPWM_XAQCTLB_SHDW2_RESERVED_1_SHIFT    (0x0000U)
#define PWM_EPWM_XAQCTLB_SHDW2_RESERVED_1_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLB_SHDW2_RESERVED_1_MAX      (0x00FFU)

#define PWM_EPWM_XAQCTLB_SHDW2_XCMP5_MASK     (0x0300U)
#define PWM_EPWM_XAQCTLB_SHDW2_XCMP5_SHIFT    (0x0008U)
#define PWM_EPWM_XAQCTLB_SHDW2_XCMP5_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLB_SHDW2_XCMP5_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLB_SHDW2_XCMP6_MASK     (0x0C00U)
#define PWM_EPWM_XAQCTLB_SHDW2_XCMP6_SHIFT    (0x000AU)
#define PWM_EPWM_XAQCTLB_SHDW2_XCMP6_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLB_SHDW2_XCMP6_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLB_SHDW2_XCMP7_MASK     (0x3000U)
#define PWM_EPWM_XAQCTLB_SHDW2_XCMP7_SHIFT    (0x000CU)
#define PWM_EPWM_XAQCTLB_SHDW2_XCMP7_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLB_SHDW2_XCMP7_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLB_SHDW2_XCMP8_MASK     (0xC000U)
#define PWM_EPWM_XAQCTLB_SHDW2_XCMP8_SHIFT    (0x000EU)
#define PWM_EPWM_XAQCTLB_SHDW2_XCMP8_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLB_SHDW2_XCMP8_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLB_SHDW2_RESETVAL (0x0000U)

/* RESERVED_68 */

#define PWM_EPWM_RESERVED_68_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_68_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_68_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_68_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_68_RESETVAL (0x0000U)

/* CMPC_SHDW2 */

#define PWM_EPWM_CMPC_SHDW2_CMPC_SHDW2_MASK     (0xFFFFU)
#define PWM_EPWM_CMPC_SHDW2_CMPC_SHDW2_SHIFT    (0x0000U)
#define PWM_EPWM_CMPC_SHDW2_CMPC_SHDW2_RESETVAL (0x0000U)
#define PWM_EPWM_CMPC_SHDW2_CMPC_SHDW2_MAX      (0xFFFFU)

#define PWM_EPWM_CMPC_SHDW2_RESETVAL (0x0000U)

/* RESERVED_69 */

#define PWM_EPWM_RESERVED_69_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_69_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_69_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_69_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_69_RESETVAL (0x0000U)

/* CMPD_SHDW2 */

#define PWM_EPWM_CMPD_SHDW2_CMPD_SHDW2_MASK     (0xFFFFU)
#define PWM_EPWM_CMPD_SHDW2_CMPD_SHDW2_SHIFT    (0x0000U)
#define PWM_EPWM_CMPD_SHDW2_CMPD_SHDW2_RESETVAL (0x0000U)
#define PWM_EPWM_CMPD_SHDW2_CMPD_SHDW2_MAX      (0xFFFFU)

#define PWM_EPWM_CMPD_SHDW2_RESETVAL (0x0000U)

/* RESERVED_70 */

#define PWM_EPWM_RESERVED_70_UNNAMED_MASK     (0x00000001U)
#define PWM_EPWM_RESERVED_70_UNNAMED_SHIFT    (0x00000000U)
#define PWM_EPWM_RESERVED_70_UNNAMED_RESETVAL (0x00000000U)
#define PWM_EPWM_RESERVED_70_UNNAMED_MAX      (0x00000001U)

#define PWM_EPWM_RESERVED_70_RESETVAL (0x00000000U)

/* XMINMAX_SHDW2 */

#define PWM_EPWM_XMINMAX_SHDW2_XMAX_SHDW2_MASK     (0x0000FFFFU)
#define PWM_EPWM_XMINMAX_SHDW2_XMAX_SHDW2_SHIFT    (0x00000000U)
#define PWM_EPWM_XMINMAX_SHDW2_XMAX_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XMINMAX_SHDW2_XMAX_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XMINMAX_SHDW2_XMIN_SHDW2_MASK     (0xFFFF0000U)
#define PWM_EPWM_XMINMAX_SHDW2_XMIN_SHDW2_SHIFT    (0x00000010U)
#define PWM_EPWM_XMINMAX_SHDW2_XMIN_SHDW2_RESETVAL (0x00000000U)
#define PWM_EPWM_XMINMAX_SHDW2_XMIN_SHDW2_MAX      (0x0000FFFFU)

#define PWM_EPWM_XMINMAX_SHDW2_RESETVAL (0x00000000U)

/* RESERVED_71 */

#define PWM_EPWM_RESERVED_71_UNNAMED_MASK     (0x00000001U)
#define PWM_EPWM_RESERVED_71_UNNAMED_SHIFT    (0x00000000U)
#define PWM_EPWM_RESERVED_71_UNNAMED_RESETVAL (0x00000000U)
#define PWM_EPWM_RESERVED_71_UNNAMED_MAX      (0x00000001U)

#define PWM_EPWM_RESERVED_71_RESETVAL (0x00000000U)

/* XCMP1_SHDW3 */

#define PWM_EPWM_XCMP1_SHDW3_XCMP1HR_SHDW3_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP1_SHDW3_XCMP1HR_SHDW3_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP1_SHDW3_XCMP1HR_SHDW3_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP1_SHDW3_XCMP1HR_SHDW3_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP1_SHDW3_XCMP1_SHDW3_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP1_SHDW3_XCMP1_SHDW3_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP1_SHDW3_XCMP1_SHDW3_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP1_SHDW3_XCMP1_SHDW3_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP1_SHDW3_RESETVAL (0x00000000U)

/* XCMP2_SHDW3 */

#define PWM_EPWM_XCMP2_SHDW3_XCMP2HR_SHDW3_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP2_SHDW3_XCMP2HR_SHDW3_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP2_SHDW3_XCMP2HR_SHDW3_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP2_SHDW3_XCMP2HR_SHDW3_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP2_SHDW3_XCMP2_SHDW3_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP2_SHDW3_XCMP2_SHDW3_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP2_SHDW3_XCMP2_SHDW3_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP2_SHDW3_XCMP2_SHDW3_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP2_SHDW3_RESETVAL (0x00000000U)

/* XCMP3_SHDW3 */

#define PWM_EPWM_XCMP3_SHDW3_XCMP3HR_SHDW3_MASK     (0x0000FFFFU)
#define PWM_EPWM_XCMP3_SHDW3_XCMP3HR_SHDW3_SHIFT    (0x00000000U)
#define PWM_EPWM_XCMP3_SHDW3_XCMP3HR_SHDW3_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP3_SHDW3_XCMP3HR_SHDW3_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP3_SHDW3_XCMP3_SHDW3_MASK     (0xFFFF0000U)
#define PWM_EPWM_XCMP3_SHDW3_XCMP3_SHDW3_SHIFT    (0x00000010U)
#define PWM_EPWM_XCMP3_SHDW3_XCMP3_SHDW3_RESETVAL (0x00000000U)
#define PWM_EPWM_XCMP3_SHDW3_XCMP3_SHDW3_MAX      (0x0000FFFFU)

#define PWM_EPWM_XCMP3_SHDW3_RESETVAL (0x00000000U)

