TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP7_MASK     (0x3000U)
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP7_SHIFT    (0x000CU)
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP7_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP7_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLB_SHDW3_XCMP8_MASK     (0xC000U)
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP8_SHIFT    (0x000EU)
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP8_RESETVAL (0x0000U)
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP8_MAX      (0x0003U)

#define PWM_EPWM_XAQCTLB_SHDW3_RESETVAL (0x0000U)

/* RESERVED_73 */

#define PWM_EPWM_RESERVED_73_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_73_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_73_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_73_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_73_RESETVAL (0x0000U)

/* CMPC_SHDW3 */

#define PWM_EPWM_CMPC_SHDW3_CMPC_SHDW3_MASK     (0xFFFFU)
#define PWM_EPWM_CMPC_SHDW3_CMPC_SHDW3_SHIFT    (0x0000U)
#define PWM_EPWM_CMPC_SHDW3_CMPC_SHDW3_RESETVAL (0x0000U)
#define PWM_EPWM_CMPC_SHDW3_CMPC_SHDW3_MAX      (0xFFFFU)

#define PWM_EPWM_CMPC_SHDW3_RESETVAL (0x0000U)

/* RESERVED_74 */

#define PWM_EPWM_RESERVED_74_UNNAMED_MASK     (0x0001U)
#define PWM_EPWM_RESERVED_74_UNNAMED_SHIFT    (0x0000U)
#define PWM_EPWM_RESERVED_74_UNNAMED_RESETVAL (0x0000U)
#define PWM_EPWM_RESERVED_74_UNNAMED_MAX      (0x0001U)

#define PWM_EPWM_RESERVED_74_RESETVAL (0x0000U)

/* CMPD_SHDW3 */

#define PWM_EPWM_CMPD_SHDW3_CMPD_SHDW3_MASK     (0xFFFFU)
#define PWM_EPWM_CMPD_SHDW3_CMPD_SHDW3_SHIFT    (0x0000U)
#define PWM_EPWM_CMPD_SHDW3_CMPD_SHDW3_RESETVAL (0x0000U)
#define PWM_EPWM_CMPD_SHDW3_CMPD_SHDW3_MAX      (0xFFFFU)

#define PWM_EPWM_CMPD_SHDW3_RESETVAL (0x0000U)

/* RESERVED_75 */

#define PWM_EPWM_RESERVED_75_UNNAMED_MASK     (0x00000001U)
#define PWM_EPWM_RESERVED_75_UNNAMED_SHIFT    (0x00000000U)
#define PWM_EPWM_RESERVED_75_UNNAMED_RESETVAL (0x00000000U)
#define PWM_EPWM_RESERVED_75_UNNAMED_MAX      (0x00000001U)

#define PWM_EPWM_RESERVED_75_RESETVAL (0x00000000U)

/* XMINMAX_SHDW3 */

#define PWM_EPWM_XMINMAX_SHDW3_XMAX_SHDW3_MASK     (0x0000FFFFU)
#define PWM_EPWM_XMINMAX_SHDW3_XMAX_SHDW3_SHIFT    (0x00000000U)
#define PWM_EPWM_XMINMAX_SHDW3_XMAX_SHDW3_RESETVAL (0x00000000U)
#define PWM_EPWM_XMINMAX_SHDW3_XMAX_SHDW3_MAX      (0x0000FFFFU)

#define PWM_EPWM_XMINMAX_SHDW3_XMIN_SHDW3_MASK     (0xFFFF0000U)
#define PWM_EPWM_XMINMAX_SHDW3_XMIN_SHDW3_SHIFT    (0x00000010U)
#define PWM_EPWM_XMINMAX_SHDW3_XMIN_SHDW3_RESETVAL (0x00000000U)
#define PWM_EPWM_XMINMAX_SHDW3_XMIN_SHDW3_MAX      (0x0000FFFFU)

#define PWM_EPWM_XMINMAX_SHDW3_RESETVAL (0x00000000U)

/* RESERVED_76 */

#define PWM_EPWM_RESERVED_76_UNNAMED_MASK     (0x00000001U)
#define PWM_EPWM_RESERVED_76_UNNAMED_SHIFT    (0x00000000U)
#define PWM_EPWM_RESERVED_76_UNNAMED_RESETVAL (0x00000000U)
#define PWM_EPWM_RESERVED_76_UNNAMED_MAX      (0x00000001U)

#define PWM_EPWM_RESERVED_76_RESETVAL (0x00000000U)

/* DECTL */

#define PWM_EPWM_DECTL_ENABLE_MASK     (0x00000001U)
#define PWM_EPWM_DECTL_ENABLE_SHIFT    (0x00000000U)
#define PWM_EPWM_DECTL_ENABLE_RESETVAL (0x00000000U)
#define PWM_EPWM_DECTL_ENABLE_MAX      (0x00000001U)

#define PWM_EPWM_DECTL_MODE_MASK     (0x00000002U)
#define PWM_EPWM_DECTL_MODE_SHIFT    (0x00000001U)
#define PWM_EPWM_DECTL_MODE_RESETVAL (0x00000000U)
#define PWM_EPWM_DECTL_MODE_MAX      (0x00000001U)

#define PWM_EPWM_DECTL_RESERVED_1_MASK     (0x000000FCU)
#define PWM_EPWM_DECTL_RESERVED_1_SHIFT    (0x00000002U)
#define PWM_EPWM_DECTL_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_DECTL_RESERVED_1_MAX      (0x0000003FU)

#define PWM_EPWM_DECTL_REENTRYDLY_MASK     (0x0000FF00U)
#define PWM_EPWM_DECTL_REENTRYDLY_SHIFT    (0x00000008U)
#define PWM_EPWM_DECTL_REENTRYDLY_RESETVAL (0x00000000U)
#define PWM_EPWM_DECTL_REENTRYDLY_MAX      (0x000000FFU)

#define PWM_EPWM_DECTL_RESERVED_2_MASK     (0xFFFF0000U)
#define PWM_EPWM_DECTL_RESERVED_2_SHIFT    (0x00000010U)
#define PWM_EPWM_DECTL_RESERVED_2_RESETVAL (0x00000000U)
#define PWM_EPWM_DECTL_RESERVED_2_MAX      (0x0000FFFFU)

#define PWM_EPWM_DECTL_RESETVAL (0x00000000U)

/* DECOMPSEL */

#define PWM_EPWM_DECOMPSEL_TRIPL_MASK     (0x0000003FU)
#define PWM_EPWM_DECOMPSEL_TRIPL_SHIFT    (0x00000000U)
#define PWM_EPWM_DECOMPSEL_TRIPL_RESETVAL (0x00000000U)
#define PWM_EPWM_DECOMPSEL_TRIPL_MAX      (0x0000003FU)

#define PWM_EPWM_DECOMPSEL_RESERVED_1_MASK     (0x0000FFC0U)
#define PWM_EPWM_DECOMPSEL_RESERVED_1_SHIFT    (0x00000006U)
#define PWM_EPWM_DECOMPSEL_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_DECOMPSEL_RESERVED_1_MAX      (0x000003FFU)

#define PWM_EPWM_DECOMPSEL_TRIPH_MASK     (0x003F0000U)
#define PWM_EPWM_DECOMPSEL_TRIPH_SHIFT    (0x00000010U)
#define PWM_EPWM_DECOMPSEL_TRIPH_RESETVAL (0x00000000U)
#define PWM_EPWM_DECOMPSEL_TRIPH_MAX      (0x0000003FU)

#define PWM_EPWM_DECOMPSEL_RESERVED_2_MASK     (0xFFC00000U)
#define PWM_EPWM_DECOMPSEL_RESERVED_2_SHIFT    (0x00000016U)
#define PWM_EPWM_DECOMPSEL_RESERVED_2_RESETVAL (0x00000000U)
#define PWM_EPWM_DECOMPSEL_RESERVED_2_MAX      (0x000003FFU)

#define PWM_EPWM_DECOMPSEL_RESETVAL (0x00000000U)

/* DEACTCTL */

#define PWM_EPWM_DEACTCTL_PWMA_MASK     (0x00000003U)
#define PWM_EPWM_DEACTCTL_PWMA_SHIFT    (0x00000000U)
#define PWM_EPWM_DEACTCTL_PWMA_RESETVAL (0x00000000U)
#define PWM_EPWM_DEACTCTL_PWMA_MAX      (0x00000003U)

#define PWM_EPWM_DEACTCTL_TRIPSELA_MASK     (0x00000004U)
#define PWM_EPWM_DEACTCTL_TRIPSELA_SHIFT    (0x00000002U)
#define PWM_EPWM_DEACTCTL_TRIPSELA_RESETVAL (0x00000000U)
#define PWM_EPWM_DEACTCTL_TRIPSELA_MAX      (0x00000001U)

#define PWM_EPWM_DEACTCTL_RESERVED_1_MASK     (0x00000008U)
#define PWM_EPWM_DEACTCTL_RESERVED_1_SHIFT    (0x00000003U)
#define PWM_EPWM_DEACTCTL_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_DEACTCTL_RESERVED_1_MAX      (0x00000001U)

#define PWM_EPWM_DEACTCTL_PWMB_MASK     (0x00000030U)
#define PWM_EPWM_DEACTCTL_PWMB_SHIFT    (0x00000004U)
#define PWM_EPWM_DEACTCTL_PWMB_RESETVAL (0x00000000U)
#define PWM_EPWM_DEACTCTL_PWMB_MAX      (0x00000003U)

#define PWM_EPWM_DEACTCTL_TRIPSELB_MASK     (0x00000040U)
#define PWM_EPWM_DEACTCTL_TRIPSELB_SHIFT    (0x00000006U)
#define PWM_EPWM_DEACTCTL_TRIPSELB_RESETVAL (0x00000000U)
#define PWM_EPWM_DEACTCTL_TRIPSELB_MAX      (0x00000001U)

#define PWM_EPWM_DEACTCTL_RESERVED_2_MASK     (0x0000FF80U)
#define PWM_EPWM_DEACTCTL_RESERVED_2_SHIFT    (0x00000007U)
#define PWM_EPWM_DEACTCTL_RESERVED_2_RESETVAL (0x00000000U)
#define PWM_EPWM_DEACTCTL_RESERVED_2_MAX      (0x000001FFU)

