TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_DEACTCTL_TRIPENABLE_MASK     (0x00010000U)
#define PWM_EPWM_DEACTCTL_TRIPENABLE_SHIFT    (0x00000010U)
#define PWM_EPWM_DEACTCTL_TRIPENABLE_RESETVAL (0x00000000U)
#define PWM_EPWM_DEACTCTL_TRIPENABLE_MAX      (0x00000001U)

#define PWM_EPWM_DEACTCTL_RESERVED_3_MASK     (0xFFFE0000U)
#define PWM_EPWM_DEACTCTL_RESERVED_3_SHIFT    (0x00000011U)
#define PWM_EPWM_DEACTCTL_RESERVED_3_RESETVAL (0x00000000U)
#define PWM_EPWM_DEACTCTL_RESERVED_3_MAX      (0x00007FFFU)

#define PWM_EPWM_DEACTCTL_RESETVAL (0x00000000U)

/* DESTS */

#define PWM_EPWM_DESTS_DEACTIVE_MASK     (0x00000001U)
#define PWM_EPWM_DESTS_DEACTIVE_SHIFT    (0x00000000U)
#define PWM_EPWM_DESTS_DEACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_DESTS_DEACTIVE_MAX      (0x00000001U)

#define PWM_EPWM_DESTS_RESERVED_1_MASK     (0xFFFFFFFEU)
#define PWM_EPWM_DESTS_RESERVED_1_SHIFT    (0x00000001U)
#define PWM_EPWM_DESTS_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_DESTS_RESERVED_1_MAX      (0x7FFFFFFFU)

#define PWM_EPWM_DESTS_RESETVAL (0x00000000U)

/* DEFRC */

#define PWM_EPWM_DEFRC_DEACTIVE_MASK     (0x00000001U)
#define PWM_EPWM_DEFRC_DEACTIVE_SHIFT    (0x00000000U)
#define PWM_EPWM_DEFRC_DEACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_DEFRC_DEACTIVE_MAX      (0x00000001U)

#define PWM_EPWM_DEFRC_RESERVED_1_MASK     (0xFFFFFFFEU)
#define PWM_EPWM_DEFRC_RESERVED_1_SHIFT    (0x00000001U)
#define PWM_EPWM_DEFRC_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_DEFRC_RESERVED_1_MAX      (0x7FFFFFFFU)

#define PWM_EPWM_DEFRC_RESETVAL (0x00000000U)

/* DECLR */

#define PWM_EPWM_DECLR_DEACTIVE_MASK     (0x00000001U)
#define PWM_EPWM_DECLR_DEACTIVE_SHIFT    (0x00000000U)
#define PWM_EPWM_DECLR_DEACTIVE_RESETVAL (0x00000000U)
#define PWM_EPWM_DECLR_DEACTIVE_MAX      (0x00000001U)

#define PWM_EPWM_DECLR_RESERVED_1_MASK     (0xFFFFFFFEU)
#define PWM_EPWM_DECLR_RESERVED_1_SHIFT    (0x00000001U)
#define PWM_EPWM_DECLR_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_DECLR_RESERVED_1_MAX      (0x7FFFFFFFU)

#define PWM_EPWM_DECLR_RESETVAL (0x00000000U)

/* RESERVED_77 */

#define PWM_EPWM_RESERVED_77_UNNAMED_MASK     (0x00000001U)
#define PWM_EPWM_RESERVED_77_UNNAMED_SHIFT    (0x00000000U)
#define PWM_EPWM_RESERVED_77_UNNAMED_RESETVAL (0x00000000U)
#define PWM_EPWM_RESERVED_77_UNNAMED_MAX      (0x00000001U)

#define PWM_EPWM_RESERVED_77_RESETVAL (0x00000000U)

/* DEMONCNT */

#define PWM_EPWM_DEMONCNT_CNT_MASK     (0x0000FFFFU)
#define PWM_EPWM_DEMONCNT_CNT_SHIFT    (0x00000000U)
#define PWM_EPWM_DEMONCNT_CNT_RESETVAL (0x00000000U)
#define PWM_EPWM_DEMONCNT_CNT_MAX      (0x0000FFFFU)

#define PWM_EPWM_DEMONCNT_RESERVED_1_MASK     (0xFFFF0000U)
#define PWM_EPWM_DEMONCNT_RESERVED_1_SHIFT    (0x00000010U)
#define PWM_EPWM_DEMONCNT_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_DEMONCNT_RESERVED_1_MAX      (0x0000FFFFU)

#define PWM_EPWM_DEMONCNT_RESETVAL (0x00000000U)

/* DEMONCTL */

#define PWM_EPWM_DEMONCTL_ENABLE_MASK     (0x00000001U)
#define PWM_EPWM_DEMONCTL_ENABLE_SHIFT    (0x00000000U)
#define PWM_EPWM_DEMONCTL_ENABLE_RESETVAL (0x00000000U)
#define PWM_EPWM_DEMONCTL_ENABLE_MAX      (0x00000001U)

#define PWM_EPWM_DEMONCTL_RESERVED_1_MASK     (0xFFFFFFFEU)
#define PWM_EPWM_DEMONCTL_RESERVED_1_SHIFT    (0x00000001U)
#define PWM_EPWM_DEMONCTL_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_DEMONCTL_RESERVED_1_MAX      (0x7FFFFFFFU)

#define PWM_EPWM_DEMONCTL_RESETVAL (0x00000000U)

/* DEMONSTEP */

#define PWM_EPWM_DEMONSTEP_INCSTEP_MASK     (0x000000FFU)
#define PWM_EPWM_DEMONSTEP_INCSTEP_SHIFT    (0x00000000U)
#define PWM_EPWM_DEMONSTEP_INCSTEP_RESETVAL (0x00000000U)
#define PWM_EPWM_DEMONSTEP_INCSTEP_MAX      (0x000000FFU)

#define PWM_EPWM_DEMONSTEP_RESERVED_1_MASK     (0x0000FF00U)
#define PWM_EPWM_DEMONSTEP_RESERVED_1_SHIFT    (0x00000008U)
#define PWM_EPWM_DEMONSTEP_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_DEMONSTEP_RESERVED_1_MAX      (0x000000FFU)

#define PWM_EPWM_DEMONSTEP_DECSTEP_MASK     (0x00FF0000U)
#define PWM_EPWM_DEMONSTEP_DECSTEP_SHIFT    (0x00000010U)
#define PWM_EPWM_DEMONSTEP_DECSTEP_RESETVAL (0x00000000U)
#define PWM_EPWM_DEMONSTEP_DECSTEP_MAX      (0x000000FFU)

#define PWM_EPWM_DEMONSTEP_RESERVED_2_MASK     (0xFF000000U)
#define PWM_EPWM_DEMONSTEP_RESERVED_2_SHIFT    (0x00000018U)
#define PWM_EPWM_DEMONSTEP_RESERVED_2_RESETVAL (0x00000000U)
#define PWM_EPWM_DEMONSTEP_RESERVED_2_MAX      (0x000000FFU)

#define PWM_EPWM_DEMONSTEP_RESETVAL (0x00000000U)

/* DEMONTHRES */

#define PWM_EPWM_DEMONTHRES_THRESHOLD_MASK     (0x0000FFFFU)
#define PWM_EPWM_DEMONTHRES_THRESHOLD_SHIFT    (0x00000000U)
#define PWM_EPWM_DEMONTHRES_THRESHOLD_RESETVAL (0x00000000U)
#define PWM_EPWM_DEMONTHRES_THRESHOLD_MAX      (0x0000FFFFU)

#define PWM_EPWM_DEMONTHRES_RESERVED_1_MASK     (0xFFFF0000U)
#define PWM_EPWM_DEMONTHRES_RESERVED_1_SHIFT    (0x00000010U)
#define PWM_EPWM_DEMONTHRES_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_DEMONTHRES_RESERVED_1_MAX      (0x0000FFFFU)

#define PWM_EPWM_DEMONTHRES_RESETVAL (0x00000000U)

/* RESERVED_78 */

#define PWM_EPWM_RESERVED_78_UNNAMED_MASK     (0x00000001U)
#define PWM_EPWM_RESERVED_78_UNNAMED_SHIFT    (0x00000000U)
#define PWM_EPWM_RESERVED_78_UNNAMED_RESETVAL (0x00000000U)
#define PWM_EPWM_RESERVED_78_UNNAMED_MAX      (0x00000001U)

#define PWM_EPWM_RESERVED_78_RESETVAL (0x00000000U)

/* MINDBCFG */

#define PWM_EPWM_MINDBCFG_ENABLEA_MASK     (0x00000001U)
#define PWM_EPWM_MINDBCFG_ENABLEA_SHIFT    (0x00000000U)
#define PWM_EPWM_MINDBCFG_ENABLEA_RESETVAL (0x00000000U)
#define PWM_EPWM_MINDBCFG_ENABLEA_MAX      (0x00000001U)

#define PWM_EPWM_MINDBCFG_RESERVED_1_MASK     (0x00000002U)
#define PWM_EPWM_MINDBCFG_RESERVED_1_SHIFT    (0x00000001U)
#define PWM_EPWM_MINDBCFG_RESERVED_1_RESETVAL (0x00000000U)
#define PWM_EPWM_MINDBCFG_RESERVED_1_MAX      (0x00000001U)

#define PWM_EPWM_MINDBCFG_INVERTA_MASK     (0x00000004U)
#define PWM_EPWM_MINDBCFG_INVERTA_SHIFT    (0x00000002U)
#define PWM_EPWM_MINDBCFG_INVERTA_RESETVAL (0x00000000U)
#define PWM_EPWM_MINDBCFG_INVERTA_MAX      (0x00000001U)

#define PWM_EPWM_MINDBCFG_SELBLOCKA_MASK     (0x00000008U)
#define PWM_EPWM_MINDBCFG_SELBLOCKA_SHIFT    (0x00000003U)
#define PWM_EPWM_MINDBCFG_SELBLOCKA_RESETVAL (0x00000000U)
#define PWM_EPWM_MINDBCFG_SELBLOCKA_MAX      (0x00000001U)

#define PWM_EPWM_MINDBCFG_SELA_MASK     (0x000000F0U)
#define PWM_EPWM_MINDBCFG_SELA_SHIFT    (0x00000004U)
#define PWM_EPWM_MINDBCFG_SELA_RESETVAL (0x00000000U)
#define PWM_EPWM_MINDBCFG_SELA_MAX      (0x0000000FU)

#define PWM_EPWM_MINDBCFG_POLSELA_MASK     (0x00000100U)
#define PWM_EPWM_MINDBCFG_POLSELA_SHIFT    (0x00000008U)
#define PWM_EPWM_MINDBCFG_POLSELA_RESETVAL (0x00000000U)
#define PWM_EPWM_MINDBCFG_POLSELA_MAX      (0x00000001U)

