TexasInstruments/mcal_am263px/mcal/examples/Adc/adc_hw_trig_dma_app/soc/Epwm_Reg.h
#define PWM_EPWM_LUTCTLB_SELXBAR_MASK     (0x000000F0U)
#define PWM_EPWM_LUTCTLB_SELXBAR_SHIFT    (0x00000004U)
#define PWM_EPWM_LUTCTLB_SELXBAR_RESETVAL (0x00000000U)
#define PWM_EPWM_LUTCTLB_SELXBAR_MAX      (0x0000000FU)

#define PWM_EPWM_LUTCTLB_RESERVED_2_MASK     (0x0000FF00U)
#define PWM_EPWM_LUTCTLB_RESERVED_2_SHIFT    (0x00000008U)
#define PWM_EPWM_LUTCTLB_RESERVED_2_RESETVAL (0x00000000U)
#define PWM_EPWM_LUTCTLB_RESERVED_2_MAX      (0x000000FFU)

#define PWM_EPWM_LUTCTLB_LUTDEC0_MASK     (0x00010000U)
#define PWM_EPWM_LUTCTLB_LUTDEC0_SHIFT    (0x00000010U)
#define PWM_EPWM_LUTCTLB_LUTDEC0_RESETVAL (0x00000000U)
#define PWM_EPWM_LUTCTLB_LUTDEC0_MAX      (0x00000001U)

#define PWM_EPWM_LUTCTLB_LUTDEC1_MASK     (0x00020000U)
#define PWM_EPWM_LUTCTLB_LUTDEC1_SHIFT    (0x00000011U)
#define PWM_EPWM_LUTCTLB_LUTDEC1_RESETVAL (0x00000000U)
#define PWM_EPWM_LUTCTLB_LUTDEC1_MAX      (0x00000001U)

#define PWM_EPWM_LUTCTLB_LUTDEC2_MASK     (0x00040000U)
#define PWM_EPWM_LUTCTLB_LUTDEC2_SHIFT    (0x00000012U)
#define PWM_EPWM_LUTCTLB_LUTDEC2_RESETVAL (0x00000000U)
#define PWM_EPWM_LUTCTLB_LUTDEC2_MAX      (0x00000001U)

#define PWM_EPWM_LUTCTLB_LUTDEC3_MASK     (0x00080000U)
#define PWM_EPWM_LUTCTLB_LUTDEC3_SHIFT    (0x00000013U)
#define PWM_EPWM_LUTCTLB_LUTDEC3_RESETVAL (0x00000000U)
#define PWM_EPWM_LUTCTLB_LUTDEC3_MAX      (0x00000001U)

#define PWM_EPWM_LUTCTLB_LUTDEC4_MASK     (0x00100000U)
#define PWM_EPWM_LUTCTLB_LUTDEC4_SHIFT    (0x00000014U)
#define PWM_EPWM_LUTCTLB_LUTDEC4_RESETVAL (0x00000000U)
#define PWM_EPWM_LUTCTLB_LUTDEC4_MAX      (0x00000001U)

#define PWM_EPWM_LUTCTLB_LUTDEC5_MASK     (0x00200000U)
#define PWM_EPWM_LUTCTLB_LUTDEC5_SHIFT    (0x00000015U)
#define PWM_EPWM_LUTCTLB_LUTDEC5_RESETVAL (0x00000000U)
#define PWM_EPWM_LUTCTLB_LUTDEC5_MAX      (0x00000001U)

#define PWM_EPWM_LUTCTLB_LUTDEC6_MASK     (0x00400000U)
#define PWM_EPWM_LUTCTLB_LUTDEC6_SHIFT    (0x00000016U)
#define PWM_EPWM_LUTCTLB_LUTDEC6_RESETVAL (0x00000000U)
#define PWM_EPWM_LUTCTLB_LUTDEC6_MAX      (0x00000001U)

#define PWM_EPWM_LUTCTLB_LUTDEC7_MASK     (0x00800000U)
#define PWM_EPWM_LUTCTLB_LUTDEC7_SHIFT    (0x00000017U)
#define PWM_EPWM_LUTCTLB_LUTDEC7_RESETVAL (0x00000000U)
#define PWM_EPWM_LUTCTLB_LUTDEC7_MAX      (0x00000001U)

#define PWM_EPWM_LUTCTLB_RESERVED_3_MASK     (0xFF000000U)
#define PWM_EPWM_LUTCTLB_RESERVED_3_SHIFT    (0x00000018U)
#define PWM_EPWM_LUTCTLB_RESERVED_3_RESETVAL (0x00000000U)
#define PWM_EPWM_LUTCTLB_RESERVED_3_MAX      (0x000000FFU)

#define PWM_EPWM_LUTCTLB_RESETVAL (0x00000001U)

/* RESERVED_80 */

#define PWM_EPWM_RESERVED_80_UNNAMED_MASK     (0x00000001U)
#define PWM_EPWM_RESERVED_80_UNNAMED_SHIFT    (0x00000000U)
#define PWM_EPWM_RESERVED_80_UNNAMED_RESETVAL (0x00000000U)
#define PWM_EPWM_RESERVED_80_UNNAMED_MAX      (0x00000001U)

#define PWM_EPWM_RESERVED_80_RESETVAL (0x00000000U)

/**************************************************************************
 * Register Macros
 **************************************************************************/

#define PWM_OTTOCAL_HRPWR   (0x00000042U)
#define PWM_OTTOCAL_HRCAL   (0x00000044U)
#define PWM_OTTOCAL_HRPRD   (0x00000046U)
#define PWM_OTTOCAL_HRCNT0  (0x00000048U)
#define PWM_OTTOCAL_HRCNT1  (0x0000004AU)
#define PWM_OTTOCAL_HRMSTEP (0x0000004CU)

/**************************************************************************
 * Field Definition Macros
 **************************************************************************/

/* HRPWR */

#define PWM_OTTOCAL_HRPWR_CALMODE_MASK     (0x0003U)
#define PWM_OTTOCAL_HRPWR_CALMODE_SHIFT    (0x0000U)
#define PWM_OTTOCAL_HRPWR_CALMODE_RESETVAL (0x0000U)
#define PWM_OTTOCAL_HRPWR_CALMODE_MAX      (0x0003U)

#define PWM_OTTOCAL_HRPWR_CALSTART_MASK     (0x0004U)
#define PWM_OTTOCAL_HRPWR_CALSTART_SHIFT    (0x0002U)
#define PWM_OTTOCAL_HRPWR_CALSTART_RESETVAL (0x0000U)
#define PWM_OTTOCAL_HRPWR_CALSTART_MAX      (0x0001U)

#define PWM_OTTOCAL_HRPWR_CNTSEL_MASK     (0x0008U)
#define PWM_OTTOCAL_HRPWR_CNTSEL_SHIFT    (0x0003U)
#define PWM_OTTOCAL_HRPWR_CNTSEL_RESETVAL (0x0000U)
#define PWM_OTTOCAL_HRPWR_CNTSEL_MAX      (0x0001U)

#define PWM_OTTOCAL_HRPWR_CALSTS_MASK     (0x0010U)
#define PWM_OTTOCAL_HRPWR_CALSTS_SHIFT    (0x0004U)
#define PWM_OTTOCAL_HRPWR_CALSTS_RESETVAL (0x0000U)
#define PWM_OTTOCAL_HRPWR_CALSTS_MAX      (0x0001U)

#define PWM_OTTOCAL_HRPWR_TESTSEL_MASK     (0x0020U)
#define PWM_OTTOCAL_HRPWR_TESTSEL_SHIFT    (0x0005U)
#define PWM_OTTOCAL_HRPWR_TESTSEL_RESETVAL (0x0000U)
#define PWM_OTTOCAL_HRPWR_TESTSEL_MAX      (0x0001U)

#define PWM_OTTOCAL_HRPWR_CALSEL_MASK     (0x03C0U)
#define PWM_OTTOCAL_HRPWR_CALSEL_SHIFT    (0x0006U)
#define PWM_OTTOCAL_HRPWR_CALSEL_RESETVAL (0x0000U)
#define PWM_OTTOCAL_HRPWR_CALSEL_MAX      (0x000FU)

#define PWM_OTTOCAL_HRPWR_RESERVED_1_MASK     (0x7C00U)
#define PWM_OTTOCAL_HRPWR_RESERVED_1_SHIFT    (0x000AU)
#define PWM_OTTOCAL_HRPWR_RESERVED_1_RESETVAL (0x0000U)
#define PWM_OTTOCAL_HRPWR_RESERVED_1_MAX      (0x001FU)

#define PWM_OTTOCAL_HRPWR_CALPWRON_MASK     (0x8000U)
#define PWM_OTTOCAL_HRPWR_CALPWRON_SHIFT    (0x000FU)
#define PWM_OTTOCAL_HRPWR_CALPWRON_RESETVAL (0x0000U)
#define PWM_OTTOCAL_HRPWR_CALPWRON_MAX      (0x0001U)

#define PWM_OTTOCAL_HRPWR_RESETVAL (0x0000U)

/* HRCAL */

#define PWM_OTTOCAL_HRCAL_HRCAL_MASK     (0x00FFU)
#define PWM_OTTOCAL_HRCAL_HRCAL_SHIFT    (0x0000U)
#define PWM_OTTOCAL_HRCAL_HRCAL_RESETVAL (0x0000U)
#define PWM_OTTOCAL_HRCAL_HRCAL_MAX      (0x00FFU)

#define PWM_OTTOCAL_HRCAL_RESERVED_1_MASK     (0xFF00U)
#define PWM_OTTOCAL_HRCAL_RESERVED_1_SHIFT    (0x0008U)
#define PWM_OTTOCAL_HRCAL_RESERVED_1_RESETVAL (0x0000U)
#define PWM_OTTOCAL_HRCAL_RESERVED_1_MAX      (0x00FFU)

#define PWM_OTTOCAL_HRCAL_RESETVAL (0x0000U)

/* HRPRD */

#define PWM_OTTOCAL_HRPRD_HRPRD_MASK     (0xFFFFU)
#define PWM_OTTOCAL_HRPRD_HRPRD_SHIFT    (0x0000U)
#define PWM_OTTOCAL_HRPRD_HRPRD_RESETVAL (0x0000U)
#define PWM_OTTOCAL_HRPRD_HRPRD_MAX      (0xFFFFU)

#define PWM_OTTOCAL_HRPRD_RESETVAL (0x0000U)

/* HRCNT0 */

#define PWM_OTTOCAL_HRCNT0_HRCNT0_MASK     (0xFFFFU)
#define PWM_OTTOCAL_HRCNT0_HRCNT0_SHIFT    (0x0000U)
#define PWM_OTTOCAL_HRCNT0_HRCNT0_RESETVAL (0x0000U)
#define PWM_OTTOCAL_HRCNT0_HRCNT0_MAX      (0xFFFFU)

#define PWM_OTTOCAL_HRCNT0_RESETVAL (0x0000U)

/* HRCNT1 */

#define PWM_OTTOCAL_HRCNT1_HRCNT1_MASK     (0xFFFFU)
#define PWM_OTTOCAL_HRCNT1_HRCNT1_SHIFT    (0x0000U)
#define PWM_OTTOCAL_HRCNT1_HRCNT1_RESETVAL (0x0000U)
#define PWM_OTTOCAL_HRCNT1_HRCNT1_MAX      (0xFFFFU)

#define PWM_OTTOCAL_HRCNT1_RESETVAL (0x0000U)

/* HRMSTEP */

#define PWM_OTTOCAL_HRMSTEP_HRMSTEP_MASK     (0x00FFU)
#define PWM_OTTOCAL_HRMSTEP_HRMSTEP_SHIFT    (0x0000U)
#define PWM_OTTOCAL_HRMSTEP_HRMSTEP_RESETVAL (0x0000U)
#define PWM_OTTOCAL_HRMSTEP_HRMSTEP_MAX      (0x00FFU)

#define PWM_OTTOCAL_HRMSTEP_RESERVED_1_MASK     (0xFF00U)
#define PWM_OTTOCAL_HRMSTEP_RESERVED_1_SHIFT    (0x0008U)
#define PWM_OTTOCAL_HRMSTEP_RESERVED_1_RESETVAL (0x0000U)
#define PWM_OTTOCAL_HRMSTEP_RESERVED_1_MAX      (0x00FFU)

#define PWM_OTTOCAL_HRMSTEP_RESETVAL (0x0000U)

#ifdef __cplusplus
}
#endif
#endif
